ProtocolLauncher.0=No se han podido leer los datos a firmar
ProtocolLauncher.1=La URL recibida es nula
ProtocolLauncher.2=Protocolo no soportado
ProtocolLauncher.3=Error en los par\u00E1metros de entrada
ProtocolLauncher.4=Operaci\u00F3n no soportada. Compruebe que dispone de la \u00FAltima versi\u00F3n de Autofirma.
ProtocolLauncher.5=No se ha podido guardar los datos
ProtocolLauncher.6=Formato de firma no soportado
ProtocolLauncher.7=No se ha podido determinar el almac\u00E9n de claves a utilizar
ProtocolLauncher.8=Error accediendo al almac\u00E9n de claves y certificados
ProtocolLauncher.9=Error realizando la firma electr\u00F3nica
ProtocolLauncher.10=No hay certificados de firma instalados en el sistema
ProtocolLauncher.11=Error en el envio del resultado de la operaci\u00F3n.
ProtocolLauncher.12=Error en el cifrado de los datos a enviar
ProtocolLauncher.13=Se ha pedido acceso a una direcci\u00F3n local, pero por seguridad se ha bloqueado el acceso
ProtocolLauncher.14=<html>La aplicaci&oacute;n est&aacute; obsoleta y no puede procesarse la petici&oacute;n.<br>Por favor, instale una versi&oacute;n actualizada y reintente el proceso de nuevo.</html>
ProtocolLauncher.15=Error en el descifrado de los datos
ProtocolLauncher.16=Error al recuperar los datos del servidor intermedio
ProtocolLauncher.17=Los datos proporcionados no son una firma electr\u00F3nica reconocida
ProtocolLauncher.18=Error al descodificar el certificado de firma
ProtocolLauncher.19=No hay ningun certificado v\u00E1lido en su almac\u00E9n. Compruebe las fechas de caducidad e instale un certificado v\u00E1lido.
ProtocolLauncher.20=Error en el procesado del lote de firma.
ProtocolLauncher.21=La versi\u00F3n de Autofirma instalada no es compatible con este tr\u00E1mite.\nActualice a la \u00FAltima versi\u00F3n disponible.
ProtocolLauncher.22=El tr\u00E1mite web no es compatible con la versi\u00F3n de Autofirma instalada.\nConsulte las instrucciones del tr\u00E1mite para saber que versi\u00F3n debe instalar.   
ProtocolLauncher.25=Seleccione el fichero de datos a firmar
ProtocolLauncher.26=Seleccione el fichero de firma
ProtocolLauncher.28=Ha ocurrido un error realizando la operaci\u00F3n.
ProtocolLauncher.29=Error
ProtocolLauncher.30=Firma
ProtocolLauncher.31=Guardar firma
ProtocolLauncher.32=Ficheros de datos
ProtocolLauncher.33=Se ha establecido una pol\u00EDtica de firma no v\u00E1lida o par\u00E1metros no compatibles con ella.
ProtocolLauncher.34=Error al obtener el registro de log acumulado hasta la ejecuci\u00F3n actual.
ProtocolLauncher.35=Error en la lectura de los datos a cargar.
ProtocolLauncher.36=Error en la comunicaci\u00F3n con el servicio de firma de lotes.
ProtocolLauncher.37=El servicio inform\u00F3 de un error durante la firma del lote.
ProtocolLauncher.38=El fichero no es un PDF o es un PDF no soportado.
ProtocolLauncher.39=Las firmas XAdES Enveloped solo pueden realizarse sobre datos XML.
ProtocolLauncher.40=El formato de los datos a firmar no es adecuado para el tipo de firma seleccionado.
ProtocolLauncher.41=Los datos introducidos no se corresponden con un objeto de firma.
ProtocolLauncher.42=La factura ya tiene una firma electr\u00F3nica y no admite firmas adicionales.
ProtocolLauncher.43=La contrase\u00F1a proporcionada no es v\u00E1lida para el PDF actual o no se proporcion\u00F3 ninguna contrase\u00F1a.
ProtocolLauncher.44=El PDF contiene firmas no registradas.
ProtocolLauncher.45=El PDF est\u00E1 certificado.
ProtocolLauncher.46=No se ha podido encontrar el almac\u00E9n de claves SSL para la comunicaci\u00F3n segura. Restaure la instalaci\u00F3n de Autofirma para generar uno nuevo.
ProtocolLauncher.47=No se ha podido acceder al almac\u00E9n de claves SSL para la comunicaci\u00F3n segura. Restaure la instalaci\u00F3n de Autofirma para generar uno nuevo.
ProtocolLauncher.48=El archivo que intenta firmar no es una factura electr\u00F3nica reconocida.
ProtocolLauncher.49=La firma de entrada no es v\u00E1lida.
ProtocolLauncher.50=Error al recuperar el documento
ProtocolLauncher.51=Se ha identificado una versi\u00F3n no segura o con errores del JavaScript de despliegue de\nAutofirma. Solicite al responsable de la aplicaci\u00F3n que actualice a la \u00FAltima versi\u00F3n.
ProtocolLauncher.52=Versi\u00F3n de JavaScript no segura
ProtocolLauncher.53=El uso de este tr\u00E1mite web requiere una versi\u00F3n m\u00E1s reciente de Autofirma.\nActualice a la \u00FAltima versi\u00F3n disponible.
ProtocolLauncher.54=Error al postprocesar una firma, probablemente debido a un plugin que afecte al sistema de firma.
ProtocolLauncher.55=Error durante la firma visible del PDF.
ProtocolLauncher.56=La firma no contiene los datos y no se compatible con la configuraci\u00F3n seleccionada
ProtocolLauncher.57=No se pudo abrir un socket para la comunicaci\u00F3n con la aplicaci\u00F3n
ProtocolLauncher.58=Id de sesi\u00F3n inv\u00E1lido
ProtocolLauncher.59=Peticion al socket desde IP externa o sin identificar
ProtocolLauncher.60=Advertencia
ProtocolLauncher.61=El documento es sospechoso de haber sido modificado desde la \u00FAltima firma. Verifique el contenido firmado en caso de duda. ¿Desea continuar con la firma?
ProtocolLauncher.62=Es posible que hayan dos o m\u00E1s firmas que se solapen en el documento ¿Desea continuar con la firma?
ProtocolLauncher.63=Posible PDF Shadow Attack
ProtocolLauncher.64=Multifirma de firma de archivo
ProtocolLauncher.65=La operaci\u00F3n puede generar firmas no validas, por lo que no se puede continuar sin confirmacion de usuario.
ProtocolLauncher.66=El tipo de clave del certificado no est\u00E1 soportado.
ProtocolLauncher.67=El almac\u00E9n de claves esta bloqueado. Siga las instrucciones del proveedor del almac\u00E9n o tarjeta para desbloquearlo.

