ProtocolLauncher.0=No se han podido leer los datos a firmar
ProtocolLauncher.1=La URL recibida es nula
ProtocolLauncher.2=Protocolo no soportado
ProtocolLauncher.3=Error en los par\u00E1metros de entrada
ProtocolLauncher.4=Operaci\u00F3n no soportada. Compruebe que dispone de la \u00FAltima versi\u00F3n de AutoFirma.
ProtocolLauncher.5=No se ha podido guardar los datos
ProtocolLauncher.6=Formato de firma no soportado
ProtocolLauncher.7=No se ha podido determinar el almac\u00E9n de claves a utilizar
ProtocolLauncher.8=Error accediendo al almac\u00E9n de claves y certificados
ProtocolLauncher.9=Error realizando la firma electr\u00F3nica
ProtocolLauncher.10=No hay certificados de firma instalados en el sistema
ProtocolLauncher.11=Error enviando la firma al servidor remoto
ProtocolLauncher.12=Error en el cifrado de los datos a enviar
ProtocolLauncher.13=Se ha pedido acceso a una direcci\u00F3n local, pero por seguridad se ha bloqueado el acceso
ProtocolLauncher.14=<html>La aplicaci&oacute;n est&aacute; obsoleta y no puede procesarse la petici&oacute;n.<br>Por favor, instale una versi&oacute;n actualizada y reintente el proceso de nuevo.</html>
ProtocolLauncher.15=Error en el descifrado de los datos
ProtocolLauncher.16=Error al recuperar los datos del servidor intermedio
ProtocolLauncher.17=Los datos proporcionados no son una firma electr\u00F3nica reconocida
ProtocolLauncher.18=Error al descodificar el certificado de firma
ProtocolLauncher.19=No hay ningun certificado v\u00E1lido en su almac\u00E9n. Compruebe las fechas de caducidad e instale un certificado v\u00E1lido.
ProtocolLauncher.20=Error en el proceso local del lote de firma.
ProtocolLauncher.21=La versi\u00F3n de AutoFirma instalada no es compatible con este tr\u00E1mite.\nActualice a la \u00FAltima versi\u00F3n disponible.
ProtocolLauncher.22=El tr\u00E1mite web no es compatible con la versi\u00F3n de AutoFirma instalada.\nConsulte las instrucciones del tr\u00E1mite para saber que versi\u00F3n debe instalar.   
ProtocolLauncher.25=Seleccione el fichero de datos a firmar
ProtocolLauncher.26=Seleccione el fichero de firma
ProtocolLauncher.27=Ficheros de datos (*.*)
ProtocolLauncher.28=Ha ocurrido un error realizando la operaci\u00F3n.
ProtocolLauncher.29=Error
ProtocolLauncher.30=Firma
ProtocolLauncher.31=Guardar firma
