ColorResource.0=Negro
ColorResource.1=Blanco
ColorResource.2=Gris claro
ColorResource.3=Gris
ColorResource.4=Gris oscuro
ColorResource.5=Rojo
ColorResource.6=Rosa

RotationModel.0=No rotar
RotationModel.1=Rotar 90º
RotationModel.2=Rotar 180º
RotationModel.3=Rotar 270º

SignPdfUiPanel.0=Siguiente
SignPdfUiPanel.1=Seleccione en este \u00E1rea con una previsualizaci\u00F3n del documento PDF el rect\u00E1ngulo donde desea situar la firma visible
SignPdfUiPanel.10=A\u00F1adir p\u00E1gina
SignPdfUiPanel.11=\u00BFDesea a\u00F1adir una p\u00E1gina en blanco al final del documento para firmar?
SignPdfUiPanel.12=Anchura:
SignPdfUiPanel.13=Altura:
SignPdfUiPanel.14=Inserte o seleccione el \u00E1rea de firma visible.
SignPdfUiPanel.15=Inserte las coordenadas y el tama\u00F1o del \u00E1rea de firma visible.
SignPdfUiPanel.16=Posici\u00F3n en el eje X del \u00E1rea de firma
SignPdfUiPanel.17=Posici\u00F3n en el eje Y del \u00E1rea de firma
SignPdfUiPanel.18=Anchura de la firma
SignPdfUiPanel.19=Altura de la firma
SignPdfUiPanel.20=Inserte o seleccione el \u00E1rea de firma visible para todos los documentos.
SignPdfUiPanel.21=Inserte las coordenadas y el tama\u00F1o del \u00E1rea de firma visible para todos los documentos.
SignPdfUiPanel.22=<html><b>P\u00E1gina de firma</b></html>
SignPdfUiPanel.23=P\u00E1gina actual
SignPdfUiPanel.24=Todas las p\u00E1ginas
SignPdfUiPanel.25=Selecci\u00F3n de p\u00E1ginas
SignPdfUiPanel.26=Error en el formato indicado en la selecci\u00F3n de p\u00E1ginas. Por favor, introduzca uno correcto.
SignPdfUiPanel.27=Bot\u00F3n para abrir ayuda para firmas visibles en PDF.
SignPdfUiPanel.2=Pulse este bot\u00F3n para situar la firma en el PDF en la p\u00E1gina y posici\u00F3n marcadas actualmente en la previsualizaci\u00F3n
SignPdfUiPanel.3=Cancelar
SignPdfUiPanel.4=Pulse este bot\u00F3n cancelar la selecci\u00F3n de situaci\u00F3n de firma en el PDF
SignPdfUiPanel.5=P\u00E1gina %0 de %1 (escala: %2%)
SignPdfUiPanel.6=Previsualizaci\u00F3n de la p\u00E1gina actual del PDF
SignPdfUiPanel.7=<html><b>Posici\u00F3n de firma</b></html>
SignPdfUiPanel.8=X:
SignPdfUiPanel.9=Y:

PdfLoader.0=<html>Creando previsualizaci&oacute;n del PDF.<br>Esta tarea puede tardar varios minutos.</html>
PdfLoader.1=Cargando documento PDF...

SignPdfDialog.0=<html>No se ha podido crear la previsualizaci&oacute;n del PDF.<br>Int&eacute;ntelo de nuevo y si el problema persiste genere firmas invisibles.</html>
SignPdfDialog.1=Error cargando el documento PDF
SignPdfDialog.2=Di\u00E1logo modal para el establecimiento de las propiedades de una firma visible PDF
SignPdfDialog.3=Propiedades de la firma visible PDF
SignPdfDialog.4=<html>El fichero es demasiado grande para generar firma visible.<br>Pruebe a generar una firma invisible.</html>
SignPdfDialog.5=No se ha podido crear la previsualizaci\u00F3n de la nueva p\u00E1gina.
SignPdfDialog.6=El \u00E1rea seleccionada para mostrar la firma tiene un tama\u00F1o demasiado peque\u00F1o.
SignPdfDialog.7=Tama\u00F1o inv\u00E1lido
SignPdfDialog.8=Advertencia
SignPdfDialog.9=No se soporta el uso de imagenes con transparencias. La previsualizaci\u00F3n no refleja el acabado final de la firma.

SignPdfFieldChooser.1=Di\u00E1logo de preparaci\u00F3n de previsualizaci\u00F3n de firma pdf visible con campo para firma.
SignPdfFieldChooser.2=Error cargando la previsualizaci\u00F3n de firma pdf visible.
SignPdfFieldChooser.3=Error
SignPdfFieldChooser.4=Usar campo seleccionado
SignPdfFieldChooser.5=Cancelar firma
SignPdfFieldChooser.6=Crear campo nuevo
SignPdfFieldChooser.7=Se ha detectado un campo de firma vac\u00EDo en el documento. Seleccione el campo en el que desea insertar la firma o si desea agregarla en un nuevo campo.

SignPdfUiPreview.0=Vista Previa
SignPdfUiPreview.1=Configuraci\u00F3n de firma
SignPdfUiPreview.10=Pulse este bot\u00F3n para seleccionar o deseleccionar el estilo de fuente negrita.
SignPdfUiPreview.11=Pulse este bot\u00F3n para seleccionar o deseleccionar el estilo de fuente cursiva.
SignPdfUiPreview.12=Pulse este bot\u00F3n para seleccionar o deseleccionar el estilo de fuente subrayado.
SignPdfUiPreview.13=Pulse este bot\u00F3n para seleccionar o deseleccionar el estilo de fuente tachado.
SignPdfUiPreview.14=Negrita
SignPdfUiPreview.15=Cursiva
SignPdfUiPreview.16=Subrayado
SignPdfUiPreview.17=Tachado
SignPdfUiPreview.18=Tama\u00F1o del texto
SignPdfUiPreview.19=Color texto
SignPdfUiPreview.2=\u00C1rea de texto
SignPdfUiPreview.20=Tipo de letra
SignPdfUiPreview.21=Seleccione el fichero para cargar la imagen
SignPdfUiPreview.22=Archivos de imagen (.jpg, .jpeg, .gif, .png, .bmp)
SignPdfUiPreview.23=Error cargando imagen
SignPdfUiPreview.24=No se ha podido cargar la imagen seleccionada. Proporcione una imagen en formato JPEG.
SignPdfUiPreview.25=Firmado por $$SUBJECTCN$$ el d\u00EDa $$SIGNDATE=dd/MM/yyyy$$ con un certificado emitido por $$ISSUERCN$$
SignPdfUiPreview.26=Arrastre una im\u00E1gen a este \u00E1rea para seleccionarlo y poder previsualizarlo
SignPdfUiPreview.27=Quitar imagen
SignPdfUiPreview.28=A\u00F1adir imagen
SignPdfUiPreview.29=Pulse la previsualizaci\u00F3n para agregar una imagen de fondo. Pulse con el bot\u00F3n derecho para eliminarla.
SignPdfUiPreview.3=Seleccione las propiedades del tipo de letra y escriba la firma en el \u00E1rea de texto para incluirla en el PDF.
SignPdfUiPreview.30=Insertar Marca Visible
SignPdfUiPreview.31=Restaurar configuraci\u00F3n
SignPdfUiPreview.32=Pulse este bot\u00F3n para restaurar la configuraci\u00F3n por defecto de la firma.
SignPdfUiPreview.33=Recordar configuraci\u00F3n
SignPdfUiPreview.34=Eliminar Marca Visible
SignPdfUiPreview.35=Opciones de Marca Visible
SignPdfUiPreview.36=Texto de la firma:
SignPdfUiPreview.37=Imagen de firma:
SignPdfUiPreview.38=Examinar
SignPdfUiPreview.39=Cargar imagen de firma
SignPdfUiPreview.40=Limpiar
SignPdfUiPreview.41=No usar imagen
SignPdfUiPreview.42=Rotaci\u00F3n del texto
SignPdfUiPreview.43=Archivos de imagen (.jpg, .jpeg, .gif, .png, .bmp)
SignPdfUiPreview.44=No se ha podido cargar la imagen seleccionada. Proporcione una imagen en formato JPEG.
SignPdfUiPreview.4=<html><p>La previsualizaci&oacute;n puede diferir del resultado final. Consulte la <a href="https://github.com/ctt-gob-es/clienteafirma/wiki/Uso-del-di%C3%A1logo-gr%C3%A1fico-de-Propiedades-de-la-firma-visible-PDF">p\u00E1gina de ayuda</a> para conocer las palabras clave para introducir informaci\u00F3n del certificado.</p></html>
SignPdfUiPreview.5=Aceptar
SignPdfUiPreview.6=Cancelar
SignPdfUiPreview.7=Pulse este bot\u00F3n cancelar la selecci\u00F3n de situaci\u00F3n de firma en el PDF
SignPdfUiPreview.8=Panel para previsualizar el texto intoducido.
SignPdfUiPreview.9=Espacio de la p\u00E1gina seleccionada en la pantalla anterior.

SignPdfUiStamp.0=Propiedades de marca visible
SignPdfUiStamp.1=Di\u00E1logo modal para la selecci\u00F3n de la posici\u00F3n de una marca visible en PDF.
SignPdfUiStamp.10=Cancelar
SignPdfUiStamp.11=Pulse este bot\u00F3n cancelar la selecci\u00F3n de posici\u00F3n de marca en el PDF
SignPdfUiStamp.12=Error cargando el documento PDF
SignPdfUiStamp.13=<html>No se ha podido crear la previsualizaci&oacute;n del PDF.<br>Int&eacute;ntelo de nuevo y si el problema persiste genere firmas invisibles.</html>
SignPdfUiStamp.14=<html>El fichero es demasiado grande para generar firma visible.<br>Pruebe a generar una firma invisible.</html>
SignPdfUiStamp.15=No se ha podido crear la previsualizaci\u00F3n de la nueva p\u00E1gina.
SignPdfUiStamp.16=Pulse este bot\u00F3n para aplicar la marca en todas las p\u00E1ginas del PDF.
SignPdfUiStamp.17=Seleccione en este \u00E1rea con una previsualizaci\u00F3n del documento PDF el rect\u00E1ngulo donde desea situar la marca visible
SignPdfUiStamp.18=Seleccionar imagen
SignPdfUiStamp.19=Pulse este bot\u00F3n para abrir un di\u00C1logo en el que podr\u00C1 seleccionar la imagen de marca.
SignPdfUiStamp.2=<html><b>Posici\u00F3n de marca</b></html>
SignPdfUiStamp.20=Anchura:
SignPdfUiStamp.21=Altura:
SignPdfUiStamp.22=Posici\u00F3n en el eje X del \u00E1rea de firma
SignPdfUiStamp.23=Posici\u00F3n en el eje Y del \u00E1rea de firma
SignPdfUiStamp.24=Anchura de la firma
SignPdfUiStamp.25=Altura de la firma
SignPdfUiStamp.26=Inserte o seleccione el \u00E1rea para la imagen de marca visible.
SignPdfUiStamp.27=Inserte las coordenadas y el tama\u00F1o del \u00E1rea de la imagen de marca visible.
SignPdfUiStamp.3=X:
SignPdfUiStamp.4=Y:
SignPdfUiStamp.5=Previsualizaci\u00F3n de la p\u00E1gina actual del PDF
SignPdfUiStamp.6=P\u00E1gina %0 de %1 (escala: %2%)
SignPdfUiStamp.7=Incluir imagen en todas las p\u00E1ginas.
SignPdfUiStamp.8=Aceptar
SignPdfUiStamp.9=Pulse este bot\u00F3n para situar la marca en el PDF en la p\u00E1gina y posici\u00F3n marcadas actualmente en la previsualizaci\u00F3n

