
CertificateInfo.0=Certificado gen\u00E9rico X.509v3
CertificateInfo.1=Titular del certificado:  
CertificateInfo.2=Emisor del certificado: 
CertificateInfo.3=Certificado X.509v3 gen\u00E9rico

CertificationLevelResources.0=Firma ordinaria no certificada
CertificationLevelResources.1=Firma de autor
CertificationLevelResources.2=Firma de autor certificada
CertificationLevelResources.3=Firma certificada
CertificationLevelResources.4=Preguntar siempre antes de firmar

TimeStampPdfTypeResource.0=Solo sello a nivel de firma
TimeStampPdfTypeResource.1=Solo sello a nivel de documento
TimeStampPdfTypeResource.2=Dos sellos, uno a nivel de firma y otro a nivel de documento

CipherDialog.0=Cifrado de ficheros
CipherDialog.1=Di\u00E1logo para el cifrado de ficheros
CipherDialog.2=Algoritmo de cifrado
CipherDialog.3=Fichero a cifrar
CipherDialog.4=Cancelar
CipherDialog.5=Cifrar
CipherDialog.6=Seleccionar fichero a cifrar
CipherDialog.7=Pulse este bot\u00F3n para buscar el archivo a cifrar
CipherDialog.8=Contrase\u00F1a
CipherDialog.9=Pulse este bot\u00F3n para cifrar el archivo
CipherDialog.10=Pulse este bot\u00F3n para cerrar el di\u00E1logo
CipherDialog.11=Todos los archivos (*.*)

ClosePanel.0=No volver a mostrar este mensaje

ConfirmSignatureDialog.0=Autorizar firma
ConfirmSignatureDialog.1=Se va a realizar la firma electr\u00F3nica de un documento.
ConfirmSignatureDialog.2=Se va a realizar la firma electr\u00F3nica de %0 documentos.
ConfirmSignatureDialog.4=<html>Pulse "Aceptar" para dar fe de entender las implicaciones legales de firmar y<br>autorizar la firma de los documentos seleccionados. En caso contrario, pulse<br>"Cancelar".</html>
ConfirmSignatureDialog.5=Omitir esta confirmaci\u00F3n en futuras operaciones de firma.
ConfirmSignatureDialog.6=Aceptar
ConfirmSignatureDialog.7=Cancelar

DataDebugDialog.0=Binario
DataDebugDialog.1=Tipo de los datos a firmar: %0
DataDebugDialog.2=Tama\u00F1o de los datos a firmar: %0 octetos
DataDebugDialog.3=Contenido de los datos a firmar:
DataDebugDialog.4=Datos a firmar
DataDebugDialog.5=Ha fallado la carga de datos desde fichero
DataDebugDialog.6=Fichero de datos
DataDebugDialog.7=Seleccione el fichero con los datos a firmar
DataDebugDialog.8=Continuar
DataDebugDialog.9=Pulse este bot\u00F3n para continuar con el proceso de firma

DataFileInfoDialog.0=Guardar
DataFileInfoDialog.1=Abrir
DataFileInfoDialog.2=Cancelar
DataFileInfoDialog.3=Datos firmados
DataFileInfoDialog.4=Tipo de documento:
DataFileInfoDialog.5=Desconocido
DataFileInfoDialog.6=Extensi\u00F3n:
DataFileInfoDialog.7=Desconocida
DataFileInfoDialog.8=Tama\u00F1o:

DnieCertAnalyzer.0=de
DnieCertAnalyzer.2=Certificado de firma de DNIe
DnieCertAnalyzer.4=Certificado de DNI electr\u00F3nico

DNIePasswordCallback.1=Introduzca el PIN de su DNIe
DNIePasswordCallback.3=DNI electr\u00F3nico

DNIeWaitPanel.0=Usar almac\u00E9n por defecto
DNIeWaitPanel.1=Si no desea usar DNI electr\u00F3nico pulse este bot\u00F3n o la tecla escape para poder seleccionar un certificado cualquiera desde el almac\u00E9n de claves y certificados del sistema operativo
DNIeWaitPanel.2=Bot\u00F3n de omisi\u00F3n de espera para inserci\u00F3n de DNIe
DNIeWaitPanel.3=Inserte su DNIe en el lector de tarjetas y pulse el bot\u00F3n "Continuar con DNIe"
DNIeWaitPanel.4=Continuar con DNIe
DNIeWaitPanel.5=Pulse este bot\u00F3n para usar su DNIe en las operaciones posteriores de firma
DNIeWaitPanel.6=Bot\u00F3n de confirmaci\u00F3n de uso de DNIe
DNIeWaitPanel.7=Una vez insertado, no extraiga el DNIe ni el lector de tarjetas durante toda la ejecuci\u00F3n de este programa
DNIeWaitPanel.8=No volver a mostrar esta pantalla inicial y trabajar siempre con el almac\u00E9n por defecto

MainMenu.0=Archivo
MainMenu.1=Men\u00FA con operaciones de apertura y firma de archivos
MainMenu.10=Men\u00FA con operaciones relacionadas con la ayuda de la aplicaci\u00F3n
MainMenu.11=Ayuda de Autofirma
MainMenu.12=Preferencias
MainMenu.13=Carga la ayuda de la aplicaci\u00F3n en una nueva ventana
MainMenu.14=<html><p align="center">Autofirma %0<br>&copy; 2011-2025 Gobierno de Espa&ntilde;a</p><br><p>Autofirma es Software Libre; puedes redistribuirlo y/o modificarlo bajo los t\u00E9rminos de al menos<br>una de estas dos licencias: <ul><li>La "GNU General Public License" tal como es publicada por la Free Software Foundation;<br>versi\u00F3n 2 de la Licencia, o (a su elecci\u00F3n) cualquier versi\u00F3n posterior.</li><li>La "European Software License"; versi\u00F3n 1.1 de la Licencia, o (a su elecci\u00F3n) cualquier<br>versi\u00F3n posterior.</li></ul><p>Autofirma contiene, entre otros, los siguientes componentes de software libre:<br>iText 2.1.7 (MPL 1.1/LGPL), jMimeMagic (Apache License 2.0), JUniversalCharDet (MPL 1.1),<br>jXAdES (EUPL 1.1/GPLv3), SpongyCastle (MIT), Java WebSockets (MIT), Proxy Vole (Apache License 2.0), etc.</p><p><br>Versi\u00F3n de Java actualmente en uso: %1 (%2bits)</p></html>
MainMenu.15=Acerca de Autofirma
MainMenu.16=Preferencias generales de la aplicaci\u00F3n
MainMenu.17=Muestra informaci\u00F3n adicional acerca de Autofirma
MainMenu.18=Opciones
MainMenu.19=Men\u00FA con las opciones configurables de la aplicaci\u00F3n
MainMenu.20=Restaurar instalaci\u00F3n
MainMenu.21=Herramienta para restaurar la configuraci\u00F3n de los navegadores
MainMenu.2=Abrir archivo a firmar
MainMenu.24=Preferencias de configuraci\u00F3n de firma electr\u00F3nica
MainMenu.25=Huellas digitales
MainMenu.26=Calcular huella digital
MainMenu.27=Comprobar huella digital
MainMenu.28=Calcular huella digital de directorio
MainMenu.29=Comprobar huella digital de directorio
MainMenu.30=Fichero
MainMenu.31=Directorio
MainMenu.32=Herramientas
MainMenu.33=Men\u00FA con herramientas complementarias
MainMenu.34=Ver firma
MainMenu.35=Abrir firma
MainMenu.36=Firmas electr\u00F3nicas
MainMenu.37=Gestionar plugins
MainMenu.3=Abre un fichero para permitir su posterior firma
MainMenu.4=Seleccione el fichero a firmar
MainMenu.5=Firmar archivo
MainMenu.6=Firma el fichero seleccionado para su firma
MainMenu.7=Salir
MainMenu.8=Cierra la aplicaci\u00F3n
MainMenu.9=Ayuda

MenuValidation.0=Validaci\u00F3n
MenuValidation.1=Validar certificado
MenuValidation.10=Certificado inv\u00E1lido
MenuValidation.11=El certificado no es v\u00E1lido o no se ha podido validar:
MenuValidation.12=Validar firma electr\u00F3nica
MenuValidation.13=Validaci\u00F3n de firmas electr\u00F3nicas en cuanto a estructura y huellas digitales
MenuValidation.14=<html>El certificado emitido por:<br><i>&nbsp;&nbsp;%0</i><br>A nombre de:<br><i>&nbsp;&nbsp;%1</i><br>Es v\u00E1lido.<br>Esta comprobaci\u00F3n puede ser parcial, para una comprobaci\u00F3n completa<br>use la Plataforma @firma.</html>
MenuValidation.15=Certificado v\u00E1lido
MenuValidation.16=Seleccione la firma a validar
MenuValidation.17=Firmas electr\u00F3nicas (*.*)
MenuValidation.2=Validaci\u00F3n de certificados (periodo de validez, revocaci\u00F3n, etc.)
MenuValidation.3=Seleccione el certificado a validar
MenuValidation.4=Certificados digitales (*.cer, *.cert, *.crt, *.pem)
MenuValidation.5=Error
MenuValidation.6=No se tienen permisos para leer el fichero
MenuValidation.7=Error leyendo el fichero de certificado
MenuValidation.8=El certificado est\u00E1 corrupto y no puede ser validado
MenuValidation.9=No se conocen mecanismos de validaci\u00F3n para este certificado

PreferencesPanel.0=Aplicar ahora
PreferencesPanel.1=Incluir una copia de los datos firmados en la propia firma
PreferencesPanel.10=C\u00F3digo postal del lugar en el que se realiza la firma
PreferencesPanel.11=Ciudad en la que se realiza la firma
PreferencesPanel.12=Pa\u00EDs en el que se realiza la firma
PreferencesPanel.13=Cargo atribuido al firmante
PreferencesPanel.14=Provincia en la que se realiza la firma
PreferencesPanel.15=Formato de firma:
PreferencesPanel.16=Opciones de firma
PreferencesPanel.17=Opciones de firma
PreferencesPanel.18=Algoritmo de huella para la firma:
PreferencesPanel.19=Metadatos de las firmas
PreferencesPanel.2=General
PreferencesPanel.20=Raz\u00F3n por la que se firma el documento
PreferencesPanel.21=Ciudad en la que se realiza la firma
PreferencesPanel.22=Contacto del firmante (usualmente una direcci\u00F3n de correo electr\u00F3nico)
PreferencesPanel.23=Pol\u00EDtica de firma:
PreferencesPanel.24=Ninguna pol\u00EDtica
PreferencesPanel.25=Pol\u00EDtica de firma de la AGE 1.8
PreferencesPanel.26=Pol\u00EDtica de firma a medida
PreferencesPanel.CAdES.27=Identificador de la pol\u00EDtica (debe ser un OID)
PreferencesPanel.XAdES.27=Identificador de la pol\u00EDtica (debe ser una URI)
PreferencesPanel.PAdES.27=Identificador de la pol\u00EDtica (debe ser un OID)
PreferencesPanel.FacturaE.27=Identificador de la pol\u00EDtica (debe ser una URI)
PreferencesPanel.28=Huella digital del identificador de la pol\u00EDtica (en Base64)
PreferencesPanel.29=Algoritmo de la huella digital del identificador de la pol\u00EDtica
PreferencesPanel.3=Firmas PAdES (PDF)
PreferencesPanel.30=Calificador de la pol\u00EDtica (URL)
PreferencesPanel.31=Cancelar
PreferencesPanel.32=Cancela el establecimiento de preferencias descartando los cambios realizados desde la \u00FAltima vez que se guardaron
PreferencesPanel.33=Aceptar
PreferencesPanel.34=Guarda los valores establecidos para las preferencias y finaliza el proceso de establecimiento de estas cerrando la ventana
PreferencesPanel.35=Guarda los valores establecidos para las preferencias permitiendo continuar con el proceso de establecimiento de estas
PreferencesPanel.36=No pedir confirmaci\u00F3n al cerrar la aplicaci\u00F3n
PreferencesPanel.37=Preferencias generales
PreferencesPanel.38=Los datos de la pol\u00EDtica de firma CAdES son inv\u00E1lidos
PreferencesPanel.4=Firmas CAdES
PreferencesPanel.40=Opciones generales de configuraci\u00F3n
PreferencesPanel.41=Opciones de configuraci\u00F3n para las firmas PAdES de documentos PDF
PreferencesPanel.42=Opciones de configuraci\u00F3n para las firmas CAdES de ficheros binarios
PreferencesPanel.43=Opciones de configuraci\u00F3n para las firmas XAdES de documentos XML
PreferencesPanel.44=Establece si debe omitirse la solicitud de confirmaci\u00F3n al usuario cuando se intente cerrar la aplicaci\u00F3n
PreferencesPanel.45=Establece si las firmas CAdES generadas deben ser impl\u00EDcitas
PreferencesPanel.46=Algoritmo que se utilizar\u00E1 en todas las firmas electr\u00F3nicas que permitan su configuraci\u00F3n
PreferencesPanel.47=Configuraci\u00F3n de pol\u00EDtica de firma para firmas XAdES
PreferencesPanel.48=Configuraci\u00F3n de pol\u00EDtica de firma para firmas PAdES
PreferencesPanel.49=Configuraci\u00F3n de pol\u00EDtica de firma para firmas CAdES
PreferencesPanel.5=Firmas XAdES
PreferencesPanel.50=Algoritmo utilizado para el c\u00E1lculo de la huella digital del identificador de la pol\u00EDtica de firma para firmas XAdES
PreferencesPanel.51=Algoritmo utilizado para el c\u00E1lculo de la huella digital del identificador de la pol\u00EDtica de firma para firmas CAdES
PreferencesPanel.52=Algoritmo utilizado para el c\u00E1lculo de la huella digital del identificador de la pol\u00EDtica de firma para firmas PAdES
PreferencesPanel.53=Formato utilizado en la generaci\u00F3n de las firmas XAdES
PreferencesPanel.54=URI identificadora de la pol\u00EDtica de firma para firmas XAdES
PreferencesPanel.55=Huella digital del identificador de la pol\u00EDtica de firma para firmas XAdES
PreferencesPanel.56=URL calificadora de la pol\u00EDtica de firma para firmas XAdES
PreferencesPanel.57=OID identificador de la pol\u00EDtica de firma para firmas CAdES
PreferencesPanel.58=Huella digital del identificador de la pol\u00EDtica de firma para firmas CAdES
PreferencesPanel.59=URL calificadora de la pol\u00EDtica de firma para firmas CAdES
PreferencesPanel.6=Los datos de la pol\u00EDtica de firma XAdES son inv\u00E1lidos
PreferencesPanel.60=OID identificador de la pol\u00EDtica de firma para firmas PAdES
PreferencesPanel.61=Huella digital del identificador de la pol\u00EDtica de firma para firmas PAdES
PreferencesPanel.62=URL calificadora de la pol\u00EDtica de firma para firmas PAdES
PreferencesPanel.63=Raz\u00EDn de firma de los documentos PDF
PreferencesPanel.64=Ciudad en la que se realiza la firma PDF
PreferencesPanel.65=Informaci\u00F3n de contacto que se agrega a las firmas PDF. Com\u00FAnmente una direcci\u00F3n de correo electr\u00F3nico
PreferencesPanel.66=Ciudad en la que se realiza la firma
PreferencesPanel.67=Pa\u00EDs en el que se realiza la firma
PreferencesPanel.68=Provincia en la que se realiza la firma
PreferencesPanel.69=Opciones de firma
PreferencesPanel.7=Los datos de la pol\u00EDtica de firma PAdES son inv\u00E1lidos
PreferencesPanel.70=Formato b\u00E1sico de las firmas PAdES
PreferencesPanel.71=PAdES B\u00E1sico
PreferencesPanel.72=PAdES-BES
PreferencesPanel.73=Pol\u00EDtica de firma de la AGE 1.9
PreferencesPanel.79=Realizar por defecto firmas visibles PDF
PreferencesPanel.8=Metadatos de las firmas
PreferencesPanel.80=Firma visible
PreferencesPanel.81=Omitir pantalla inicial de DNIe.
PreferencesPanel.82=Establece si debe mostrarse o no la pantalla inicial que pregunta al usuario si desea usar solo DNIe o cualquier certificado
PreferencesPanel.84=Almacenes de claves
PreferencesPanel.85=Opciones de configuraci\u00F3n para los almacenes de claves y certificados
PreferencesPanel.86=Seleccione el fichero de configuraci\u00F3n
PreferencesPanel.87=Buscar actualizaciones al inicio
PreferencesPanel.88=En esta casilla puede seleccionar si desea o no que el programa busque autom\u00E1ticamente actualizaciones al iniciarse
PreferencesPanel.9=Provincia o regi\u00F3n en la que se realiza la firma
PreferencesPanel.100=Factura Electr\u00F3nica
PreferencesPanel.101=Opciones de configuraci\u00F3n para la Factura Electr\u00F3nica de documentos
PreferencesPanel.102=C\u00F3digo postal del lugar en el que se realiza la firma
PreferencesPanel.104=Formato 1
PreferencesPanel.105=Formato 2
PreferencesPanel.106=Formato b\u00E1sico de la Firma Electr\u00F3nica
PreferencesPanel.107=Importar configuraci\u00F3n
PreferencesPanel.108=Opciones generales
PreferencesPanel.109=Seleccione la URL para descarga del fichero de preferencias
PreferencesPanel.110=Importar configuraci\u00F3n desde red
PreferencesPanel.111=Configuraciones de Autofirma (*.afconfig)
PreferencesPanel.112=Pulse este bot\u00F3n para seleccionar un fichero con las opciones de configuraci\u00F3n para todo el programa
PreferencesPanel.113=Mostrar icono en el \u00E1rea de notificaciones y ejecutar autom\u00E1ticamente al inicio (necesita reiniciar)
PreferencesPanel.114=Establece el icono en el \u00E1rea de notificaciones y ejecutar autom\u00E1ticamente al inicio
PreferencesPanel.115=Formato avanzado de firma:
PreferencesPanel.116=Error importando la configuraci\u00F3n desde red
PreferencesPanel.117=Error
PreferencesPanel.118=Personalizar formato de sello de tiempo
PreferencesPanel.119=Configurar
PreferencesPanel.120=Pulse este bot\u00F3n para personalizar el formato de sellos de tiempo
PreferencesPanel.121=Sello de tiempo
PreferencesPanel.122=Aplicar sellos de tiempo al documento firmado
PreferencesPanel.123=Nivel de certificaci\u00F3n de la firma
PreferencesPanel.124=Sellos de tiempo
PreferencesPanel.125=Configuraci\u00F3n de red
PreferencesPanel.126=Configurar proxy
PreferencesPanel.127=Pulse este bot\u00F3n para configurar las opciones de proxy
PreferencesPanel.128=Cambiar configuraci\u00F3n de proxy para las conexiones de red:
PreferencesPanel.129=Error
PreferencesPanel.130=No se ha podido instalar el icono en el \u00E1rearea de notificaciones
PreferencesPanel.131=No se ha podido desinstalar el icono del \u00E1rearea de notificaciones
PreferencesPanel.132=<html>Se ha instalado correctamente el icono en el \u00E1rearea de notificaciones. La aplicaci\u00F3n se ejecutara autom\u00E1ticamente a partir del pr\u00F3ximo reinicio</html>
PreferencesPanel.133=<html>Se ha desinstalado correctamente el icono del \u00E1rearea de notificaciones. La aplicaci\u00F3n dejar\u00E1 de ejecutarse autom\u00E1ticamente a partir del pr\u00F3ximo reinicio</html>
PreferencesPanel.134=Icono en el \u00E1rearea de notificaciones
PreferencesPanel.135=Restaurar configuraci\u00F3n
PreferencesPanel.136=Pulse este bot\u00F3n para restaurar las opciones de configuraci\u00F3n para todo el programa.
PreferencesPanel.137=Cifrado
PreferencesPanel.138=Opciones de configuraci\u00F3n para el cifrado
PreferencesPanel.139=Restaurar configuraci\u00F3n
PreferencesPanel.140=\u00BFDesea restaurar la configuraci\u00F3n general de la aplicaci\u00F3n?
PreferencesPanel.141=Ha ocurrido un error eliminando las preferencias de la aplicaci\u00F3n
PreferencesPanel.142=La configuraci\u00F3n se ha importado correctamente.
PreferencesPanel.143=Importaci\u00F3n de la configuraci\u00F3n
PreferencesPanel.144=Restaurar valores
PreferencesPanel.145=Restaura los valores por defecto de las preferencias
PreferencesPanel.146=Haga clic en el siguiente bot\u00F3n para restaurar la configuraci\u00F3n de firmas PAdES.
PreferencesPanel.147=Restaurar configuraci\u00F3n
PreferencesPanel.148=Haga clic en el siguiente bot\u00F3n para restaurar la configuraci\u00F3n de firmas XAdES.
PreferencesPanel.149=Haga clic en el siguiente bot\u00F3n para restaurar la configuraci\u00F3n de firmas FacturaE.
PreferencesPanel.150=Configurar pol\u00EDtica
PreferencesPanel.151=Pulse este bot\u00F3n para configurar la pol\u00EDtica de firma
PreferencesPanel.152=Haga clic en el siguiente bot\u00F3n para configurar la pol\u00EDtica de firma.
PreferencesPanel.153=Configuraci\u00F3n de la pol\u00EDtica de firma
PreferencesPanel.154=Haga clic en el siguiente bot\u00F3n para restaurar la configuraci\u00F3n de firmas CAdES.
PreferencesPanel.155=\u00BFDesea restaurar la configuraci\u00F3n de las firmas PAdES?
PreferencesPanel.156=\u00BFDesea restaurar la configuraci\u00F3n de las firmas XAdES?
PreferencesPanel.157=\u00BFDesea restaurar la configuraci\u00F3n de las firmas CAdES?
PreferencesPanel.158=\u00BFDesea restaurar la configuraci\u00F3n de las Facturas Electr\u00F3nicas?
PreferencesPanel.160=Sobreescribir ficheros en el directorio de salida en las firmas masivas 
PreferencesPanel.161=Cambiar formato de firma para cada tipo de fichero:
PreferencesPanel.162=Configurar formatos
PreferencesPanel.163=Pulse este bot\u00F3n para configurar el formato de firma que debe aplicarse a cada tipo de fichero
PreferencesPanel.164=Formatos de firma
PreferencesPanel.165=Habilitar JMulticard para el uso de tarjetas de la FNMT y DNIe (requiere reiniciar Autofirma)
PreferencesPanel.166=Habilita el uso de DNIe y tarjetas CERES mediante JMulticard (requiere reiniciar)
PreferencesPanel.167=Operaci\u00F3n en multifirmas
PreferencesPanel.168=Cofirma
PreferencesPanel.169=Contrafirma (\u00FAnicamente de los nodos hoja)
PreferencesPanel.170=Contrafirma (de todo el \u00E1rbol)
PreferencesPanel.171=Pol\u00EDtica de firma:
PreferencesPanel.172=Aplicar marca visible a documentos PDF
PreferencesPanel.173=Aceptar s\u00F3lo conexiones con sitios seguros (Recomendado)
PreferencesPanel.174=S\u00F3lo se aceptar\u00E1n conexiones con direcciones HTTPS cuando el certificado sea de confianza
PreferencesPanel.175=Ofuscar identificadores de usuario de los certificados de las firmas visibles
PreferencesPanel.176=Permitir el uso de certificados caducados
PreferencesPanel.177=Permitir seleccionar certificados caducados para firmar
PreferencesPanel.178=Permitir agregar nuevas firmas a documentos con firmas no v\u00E1lidas
PreferencesPanel.179=Solicitar confirmaci\u00F3n para firmar
PreferencesPanel.180=Pide confirmaci\u00F3n al usuario antes de ejecutar una operaci\u00F3n de firma
PreferencesPanel.181=Caja para introducir texto
PreferencesPanel.182=Casilla de verificaci\u00F3n para activar o desactivar 
PreferencesPanel.183=Desplegable con opciones de 
PreferencesPanel.184=Bot\u00F3n de opci\u00F3n para 
PreferencesPanel.185=Dominios seguros
PreferencesPanel.186=Bot\u00F3n para abrir listado de dominios seguros
PreferencesPanel.187=Comprobar PDF Shadow Attack
PreferencesPanel.188=Bot\u00F3n para activar la comprobaci\u00F3nn de PDF Shadow Attacks
PreferencesPanel.189=Al activar esta opci\u00F3n, el proceso de validaci\u00F3n para PDF puede retrasarse.
PreferencesPanel.190=Funcionamiento optimizado para VDI. No recomendado en otros entornos.
PreferencesPanel.191=Adapta la comunicaci\u00F3n con el navegador para un mejor desempe\u00F1o sobre entornos VDI.
PreferencesPanel.192=Almacenes de claves
PreferencesPanel.193=Opciones de configuraci\u00F3n de certificados
PreferencesPanel.194=Certificados de confianza
PreferencesPanel.195=Pulse este bot\u00F3n para configurar los certificados de confianza
PreferencesPanel.196=Exportar configuraci\u00F3n
PreferencesPanel.197=Pulse este bot\u00F3n para exportar a un fichero las opciones de configuraci\u00F3n para todo el programa
PreferencesPanel.198=Seleccione una ruta donde exportar el archivo de configuraci\u00F3n
PreferencesPanel.199=La configuraci\u00F3n se ha exportado correctamente.
PreferencesPanel.200=Exportaci\u00F3n de la configuraci\u00F3n
PreferencesPanel.201=exported_config.afconfig
PreferencesPanel.203=Tipo por defecto:
PreferencesPanel.204=Permitir generar PDF certificado.
PreferencesPanel.205=Bot\u00F3n para activar la generaci\u00F3nn de PDF certificado
PreferencesPanel.206=Sin certificar
PreferencesPanel.207=Certificada de autor
PreferencesPanel.208=Certificada de autor para formularios
PreferencesPanel.209=Certificada com\u00FAn
PreferencesPanel.210=Generar firma PDF certificado

DefaultFormatPanel.1=Seleccione el formato de firma que se utilizar\u00E1 para firmar cada tipo de fichero.
DefaultFormatPanel.2=Reestablecer
DefaultFormatPanel.3=Establece los valores por defecto originales en los campos del di\u00E1logo
DefaultFormatPanel.5=Documentos PDF
DefaultFormatPanel.6=Documentos OOXML de Microsoft Office
DefaultFormatPanel.7=Facturas electr\u00F3nicas
DefaultFormatPanel.8=Ficheros XML gen\u00E9ricos
DefaultFormatPanel.9=Ficheros ODF de LibreOffice u OpenOffice
DefaultFormatPanel.10=Resto de ficheros

PreferencesPanelCiperment.0=Panel para configurar las opciones de cifrado.
PreferencesPanelCiperment.1=Opciones de cifrado
PreferencesPanelCiperment.10=encipherOnly
PreferencesPanelCiperment.11=decipherOnly
PreferencesPanelCiperment.12=Algoritmo de cifrado
PreferencesPanelCiperment.13=Repositorio de certificados de usuarios destinatarios
PreferencesPanelCiperment.14=URI del Repositorio
PreferencesPanelCiperment.15=M\u00E9todo de acceso
PreferencesPanelCiperment.16=Comprobar
PreferencesPanelCiperment.17=Pulse este bot\u00F3n para comprobar que la URI introducida es correcta.
PreferencesPanelCiperment.18=La URI introducida no es correcta.
PreferencesPanelCiperment.19=Error
PreferencesPanelCiperment.2=Usos de clave permitidos
PreferencesPanelCiperment.20=La URI introducida es correcta.
PreferencesPanelCiperment.3=digitalSignature
PreferencesPanelCiperment.4=nonRepudiation
PreferencesPanelCiperment.5=keyEncipherment
PreferencesPanelCiperment.6=dataEncipherment
PreferencesPanelCiperment.7=keyAgreement
PreferencesPanelCiperment.8=keyCertSign
PreferencesPanelCiperment.9=cRLSign

PreferencesPanelXades.0=Cargo atribuido al firmante

PreferencesPlistHandler.0=No ha sido posible leer el fichero de preferencias, no se hizo ning\u00FAn cambio en la configuraci\u00F3n
PreferencesPlistHandler.1=Error
PreferencesPlistHandler.2=El fichero de preferencias no ha sido firmado.
PreferencesPlistHandler.3=El fichero de preferencias no esta firmado, no se hizo ning\u00FAn cambio en la configuraci\u00F3n
PreferencesPlistHandler.4=El fichero de preferencias no esta firmado correctamente, no se hizo ning\u00FAn cambio en la configuraci\u00F3n
PreferencesPlistHandler.5=El fichero de preferencias esta firmado digitalmente por: %0
PreferencesPlistHandler.6=<html>El firmante de las preferencias no esta autorizado ('%0').<br>No se hizo ning\u00FAn cambio en la configuraci\u00F3n.</html>
PreferencesPlistHandler.7=No se ha podido extraer la informaci\u00F3n de la firma del fichero de preferencias, no se hizo ning\u00FAn cambio en la configuraci\u00F3n
PreferencesPlistHandler.8=El fichero de preferencias es inv\u00E1lido, no se hizo ning\u00FAn cambio en la configuraci\u00F3n
PreferencesPlistHandler.109=<html><p>Si continua, se reemplazar\u00E1 la configuraci\u00F3n actual con la indicada en el fichero, &iquest;Desea continuar?<br>Si cancela la importaci\u00F3n, no se aplicar\u00E1 ninguna configuraci\u00F3n del fichero seleccionado.</p><p>%0</p></html>
PreferencesPlistHandler.110=Importar configuraci\u00F3n de firma

PreferencesPanelFacturaE.0=Versi\u00F3n de la pol\u00EDtica de firma de factura electr\u00F3nica
PreferencesPanelFacturaE.1=Pol\u00EDtica de Factura Electr\u00F3nica 3.0
PreferencesPanelFacturaE.2=Pol\u00EDtica de Factura Electr\u00F3nica 3.1
PreferencesPanelFacturaE.3=Papel del firmante de la factura electr\u00F3nica:
PreferencesPanelFacturaE.4=Metadatos de las firmas

PreferencesPanelKeyStores.1=Almac\u00E9n por defecto
PreferencesPanelKeyStores.2=Ver contenido
PreferencesPanelKeyStores.3=Usar tambi\u00E9n en las llamadas a Autofirma desde el navegador
PreferencesPanelKeyStores.4=Filtros de certificados
PreferencesPanelKeyStores.5=Mostrar pantalla inicial de selecci\u00F3n de DNIe o cualquier otro certificado
PreferencesPanelKeyStores.6=Permitir el uso de certificados caducados
PreferencesPanelKeyStores.7=Usar solo certificados espec\u00EDficos para firma en las firmas electr\u00F3nicas (atributo de no repudio)
PreferencesPanelKeyStores.8=Usar exclusivamente certificados de seud\u00F3nimo
PreferencesPanelKeyStores.9=Tarjetas inteligentes
PreferencesPanelKeyStores.10=Conectar
PreferencesPanelKeyStores.11=Agregar tarjeta
PreferencesPanelKeyStores.12=Selecci\u00F3n de almac\u00E9n local
PreferencesPanelKeyStores.13=Almacenes de claves
PreferencesPanelKeyStores.14=No se ha podido cargar el DNIe
PreferencesPanelKeyStores.15=\u00BFDesea restaurar la configuraci\u00F3n para los almacenes de claves?
PreferencesPanelKeyStores.16=Error al obtener almac\u00E9n
PreferencesPanelKeyStores.17=Permite utilizar el almac\u00E9n por defecto en caso de realizar llamadas a la aplicaci\u00F3n desde el navegador.
PreferencesPanelKeyStores.18=Contenido del almac\u00E9n '%0'
PreferencesPanelKeyStores.19=Es posible que no todos los certificados mostrados est\u00E9n disponibles para firmar electr\u00F3nicamente.
PreferencesPanelKeyStores.20=Error al recuperar el almac\u00E9n por defecto seleccionado
PreferencesPanelKeyStores.21=Error al registrar tarjeta inteligente en el sistema
PreferencesPanelKeyStores.22=Error al obtener los registros de tarjetas inteligentes
PreferencesPanelKeyStores.23=Modificar
PreferencesPanelKeyStores.24=Eliminar
PreferencesPanelKeyStores.25=\u00BFDesea eliminar la tarjeta seleccionada?
PreferencesPanelKeyStores.26=Error al eliminar tarjeta inteligente del sistema
PreferencesPanelKeyStores.27=Rellene todos los campos
PreferencesPanelKeyStores.28=Error al conectar con tarjeta inteligente
PreferencesPanelKeyStores.29=Conexi\u00F3n correcta con tarjeta inteligente.
PreferencesPanelKeyStores.30=Informaci\u00F3n
PreferencesPanelKeyStores.31=Seleccione una tarjeta
PreferencesPanelKeyStores.32=Omitir certificado de autenticaci\u00F3n de DNIe
PreferencesPanelKeyStores.33=<html>Agregue tarjetas inteligentes por medio de sus PKCS#11 para poder acceder directamente <br> a sus certificados.</html>
PreferencesPanelKeyStores.34=El nombre de tarjeta introducido ya se encuentra registrado. Por favor, introduzca uno distinto.
PreferencesPanelKeyStores.35=El controlador introducido ya se encuentra registrado. Por favor, introduzca uno distinto.
PreferencesPanelKeyStores.36=No se ha identificar el tipo de almac\u00E9n.

PreferencesPanelTimeStamps.0=Configuraci\u00F3n de los par\u00E1metros de sellos de tiempo
PreferencesPanelTimeStamps.1=Di\u00E1logo para configurar los par\u00E1metros de sellos de tiempo
PreferencesPanelTimeStamps.2=Aceptar
PreferencesPanelTimeStamps.3=Tipo de sello de tiempo a aplicar
PreferencesPanelTimeStamps.4=URL de la autoridad de sello de tiempo
PreferencesPanelTimeStamps.5=Pol\u00EDtica de sellado de tiempo
PreferencesPanelTimeStamps.6=Algoritmo de huella digital
PreferencesPanelTimeStamps.7=Certificado de la TSA requerido
PreferencesPanelTimeStamps.8=Nombre de usuario de la TSA
PreferencesPanelTimeStamps.9=Contrase\u00F1a del usuario de la TSA
PreferencesPanelTimeStamps.10=OID de la extensi\u00F3n a a\u00F1adir a la petici\u00F3n al servidor de sello de tiempo (opcional)
PreferencesPanelTimeStamps.11=Valor, en binario convertido a Base64, de la extensi\u00F3n a a\u00F1adir a la petici\u00F3n al servidor de sello de tiempo
PreferencesPanelTimeStamps.12=El OID de la extensi\u00F3n indicada anteriormente es cr\u00EDtica
PreferencesPanelTimeStamps.13=El formato de URL introducido es err\u00F3neo o vac\u00EDo
PreferencesPanelTimeStamps.14=Error URL
PreferencesPanelTimeStamps.15=El formato de OID introducido es err\u00F3neo
PreferencesPanelTimeStamps.16=Error OID
PreferencesPanelTimeStamps.17=Cancelar
PreferencesPanelTimeStamps.18=Pulse este bot\u00F3n para cancelar los cambios y volver a la pantalla anterior

PreferencesPanelTrustedSites.0=Configuraci\u00F3n de las pol\u00EDticas de certificaci\u00F3n permitidas
PreferencesPanelTrustedSites.1=Di\u00E1logo para configurar que pol\u00EDticas de certificaci\u00F3n estar\u00E1n permitidas para las operaciones de firma
PreferencesPanelTrustedSites.10=Pulse este bot\u00F3n para aceptar los cambios y volver a la pantalla anterior
PreferencesPanelTrustedSites.11=Cancelar
PreferencesPanelTrustedSites.12=Pulse este bot\u00F3n para cancelar los cambios y volver a la pantalla anterior
PreferencesPanelTrustedSites.13=Error
PreferencesPanelTrustedSites.14=Necesita a\u00F1adir al menos un OID para habilitar el filtro.
PreferencesPanelTrustedSites.2=<html>Agregue o quite los OID de las pol\u00EDticas que desee admitir en firmas electr\u00F3nicas.</html>
PreferencesPanelTrustedSites.3=A\u00F1adir OID:
PreferencesPanelTrustedSites.4=Agregar
PreferencesPanelTrustedSites.5=Pulse este bot\u00F3n para a\u00F1adir el sitio seleccionado
PreferencesPanelTrustedSites.6=OID de pol\u00EDticas admitidas para firma:
PreferencesPanelTrustedSites.7=Quitar
PreferencesPanelTrustedSites.8=Pulse este bot\u00F3n para quitar el sitio seleccionado
PreferencesPanelTrustedSites.9=Aceptar

ProxyDialog.0=Configuraci\u00F3n de proxy
ProxyDialog.1=El host no es v\u00E1lido
ProxyDialog.10=<html>Conexi\u00F3n <i>incorrecta</i></html>
ProxyDialog.11=Autodetectar
ProxyDialog.12=Panel para configurar un servidor de proxy
ProxyDialog.13=Pulse este bot\u00F3n para autodetectar si hay proxys en el sistema
ProxyDialog.14=No se han detectado proxies en el sistema
ProxyDialog.15=La configuraci\u00F3n de proxy se aplica a HTTP, HTTPS, FTP y SOCKS.
ProxyDialog.16=Usuario:
ProxyDialog.17=Contrase\u00F1a:
ProxyDialog.18=No se pudo cargar la contrase\u00F1a del proxy. Se omitir\u00E1 el valor actual.
ProxyDialog.19=No se pudo guardar la contrase\u00F1a del proxy. Se ignorar\u00E1 la contrase\u00F1 establecida.
ProxyDialog.2=Error
ProxyDialog.20=No usar proxy para las siguientes IP y direcciones de dominio:
ProxyDialog.21=<html>Las direcciones se separan con comas (,) y se puede utilizar asterisco (*) al principio<br>y fin de las direcciones como comod\u00EDn.</html>
ProxyDialog.22=Sin proxy
ProxyDialog.23=Usar la configuraci\u00F3n de proxy del sistema
ProxyDialog.24=Configuraci\u00F3n manual del proxy
ProxyDialog.3=El puerto no es v\u00E1lido
ProxyDialog.4=Usar un servidor proxy para las conexiones de red.
ProxyDialog.5=Host: 
ProxyDialog.6=Pulse este bot\u00F3n para comprobar la conexi\u00F3n de los datos introducidos
ProxyDialog.7=Puerto:
ProxyDialog.8=Verificar conexi\u00F3n
ProxyDialog.9=<html>Conexi\u00F3n <i>correcta</i></html>

SecureDomainsDialog.0=Listado de dominios seguros
SecureDomainsDialog.1=Error
SecureDomainsDialog.2=<html>Se consideran dominios seguros todos aquellos en los que la conexi\u00F3n est\u00E1 cifrada<br>con un certificado SSL reconocido internacionalmente, vigente y emitido para el dominio<br>en cuesti\u00F3n. Adicionalmente, se considerar\u00E1n dominios seguros todos aquellos<br>recogidos en este listado.</html>
SecureDomainsDialog.3=<html>Las direcciones se separan por comas (,) o saltos de l\u00EDnea y se pueden utilizar<br>asteriscos (*) al principio y final de cada una de ellas como comod\u00EDn.</html>
SecureDomainsDialog.4=Introduzca solo un tipo de separador entre direcciones. Comas o saltos de l\u00EDnea.
SecureDomainsDialog.5=Introduzca al menos un dominio.

TrustedCertificatesDialog.0=Certificados de confianza
TrustedCertificatesDialog.1=Certificados importados
TrustedCertificatesDialog.2=Importar...
TrustedCertificatesDialog.3=Ver certificado
TrustedCertificatesDialog.5=Eliminar
TrustedCertificatesDialog.6=Importar certificados
TrustedCertificatesDialog.7=<html>Agregue nuevos certificados a su almac\u00E9n de confianza para permitir la conexi\u00F3n a los sitios <br>web que los utilicen.</html>
TrustedCertificatesDialog.8=Importar certificado local
TrustedCertificatesDialog.9=Carga un certificado en disco para revisarlo e importarlo en el almac\u00E9n de confianza.
TrustedCertificatesDialog.10=Importar certificado desde URL
TrustedCertificatesDialog.11=URL
TrustedCertificatesDialog.12=Obtener certificado
TrustedCertificatesDialog.13=Examinar
TrustedCertificatesDialog.14=Confirmar importaci\u00F3n del certificado
TrustedCertificatesDialog.15=Se han cargado los siguientes certificados:
TrustedCertificatesDialog.17=Ver certificado
TrustedCertificatesDialog.18=Omitir
TrustedCertificatesDialog.19=Importar certificados
TrustedCertificatesDialog.20=Seleccione el certificado a importar
TrustedCertificatesDialog.21=Certificados digitales (*.cer, *.cert, *.crt)
TrustedCertificatesDialog.22=Verificaci\u00F3n de dominio
TrustedCertificatesDialog.23=<html>Se ha tratado de conectar con el dominio<br> %0 que presenta un certificado SSL que no es de confianza. <br>¿Desea importar este certificado a su almac\u00E9n de confianza?</html>
TrustedCertificatesDialog.24=Paso 1: Verifique su certificado.
TrustedCertificatesDialog.25=Paso 2: Importe el certificado si lo considera de confianza.
TrustedCertificatesDialog.26=Error al crear almac\u00E9n de confianza.
TrustedCertificatesDialog.27=Error al obtener el certificado.
TrustedCertificatesDialog.28=Cerrar
TrustedCertificatesDialog.29=\u00BFEst\u00E1 seguro de que quiere eliminar el certificado '%0'?
TrustedCertificatesDialog.30=Error al eliminar certificado de confianza.
TrustedCertificatesDialog.31=No se ha indicado una URL v\u00E1lida.
TrustedCertificatesDialog.32=No se ha podido cargar el almac\u00E9n de confianza de Autofirma. \u00BFDesea regenerarlo?

PolicyDialog.0=Configuraci\u00F3n de la pol\u00EDtica de firma
PolicyDialog.1=El identificador de la pol\u00EDtica no es v\u00E1lido 
PolicyDialog.2=Error

SmartCardDialog.0=Agregar tarjeta como almac\u00E9n de claves
SmartCardDialog.1=Nombre de la tarjeta
SmartCardDialog.2=Controlador PKCS#11
SmartCardDialog.3=Examinar
SmartCardDialog.4=Conectar
SmartCardDialog.5=Introducir un nombre para la tarjeta que se quiere a\u00F1adir
SmartCardDialog.6=Ruta del controlador PKCS#11 correspondiente a la tarjeta
SmartCardDialog.7=Seleccionar controlador
SmartCardDialog.8=Controladores PKCS\#11
SmartCardDialog.9=Modificar tarjeta
SmartCardDialog.10=Eliminar tarjeta

ShowFileLinkAction.1=Guardar datos
ShowFileLinkAction.2=No se ha podido abrir el fichero,\ncompruebe que dispone de una aplicaci\u00F3n instalada para visualizar ficheros '%0'
ShowFileLinkAction.3=No se ha podido guardar el fichero
ShowFileLinkAction.4=Error
ShowFileLinkAction.5=documento

SignatureAttributesDialog.0=Atributos de firma
SignatureAttributesDialog.1=<html>Adem\u00E1s de los datos, la fecha y hora y el certificado de firma que seleccione,<br>la firma electr\u00F3nica del documento incluir\u00E1 los siguientes atributos:</html>
SignatureAttributesDialog.2=Pol\u00EDtica de firma:
SignatureAttributesDialog.3=Identificador:
SignatureAttributesDialog.4=Huella digital: 
SignatureAttributesDialog.5=Algoritmo de huella: 
SignatureAttributesDialog.6=Descripci\u00F3n: 
SignatureAttributesDialog.7=Referencia: 
SignatureAttributesDialog.8=Lugar de firma:
SignatureAttributesDialog.9=Direcci\u00F3n: 
SignatureAttributesDialog.10=Ciudad: 
SignatureAttributesDialog.11=Provincia: 
SignatureAttributesDialog.12=C\u00F3digo postal: 
SignatureAttributesDialog.13=Pa\u00EDs: 
SignatureAttributesDialog.14=Rol de firma:
SignatureAttributesDialog.15=Roles declarados: 
SignatureAttributesDialog.16=<html>La firma se realizar\u00E1 sobre los datos del documento, la fecha y hora y el certificado de firma que seleccione.<br>No se han definido atributos de firma adicionales.</html>
SignatureAttributesDialog.17=Raz\u00F3n de firma:
SignatureAttributesDialog.18=Informaci\u00F3n de contacto:
SignatureAttributesDialog.19=Informaci\u00F3n adicional:

ChangeFormatDialog.0=Configuraci\u00F3n de firma
ChangeFormatDialog.1=Seleccione el formato de firma que se utilizar\u00E1 para el fichero:
ChangeFormatDialog.2=(Recomendado)

SignDataPanel.0=Fichero de firma
SignDataPanel.1=Ruta del fichero de firma analizado
SignDataPanel.10=Fichero de tipo Factura Electr\u00F3nica (XML) firmada
SignDataPanel.12=Pulse en la descripci\u00F3n del certificado para obtener informaci\u00F3n adicional sobre \u00E9l o a\u00F1adirlo al almac\u00E9n de certificados de su sistema operativo
SignDataPanel.13=Descripci\u00F3n del certificado
SignDataPanel.14=Informaci\u00F3n resumida del certificado, pulse sobre esta para abrir una nueva ventana con informaci\u00F3n adicional
SignDataPanel.15=Comprobar validez
SignDataPanel.16=Comprueba la validez del certificado contra el OCSP de su autoridad de certificaci\u00F3n
SignDataPanel.17=Bot\u00F3n para validar el certificado
SignDataPanel.18=Comprueba la validez del certificado contra el OCSP de su autoridad de certificaci\u00F3n
SignDataPanel.2=Fichero firmado:
SignDataPanel.21=Certificado de firma utilizado:
SignDataPanel.22=Datos de la firma:
SignDataPanel.23=No se ha podido abrir el fichero,\ncompruebe que dispone de una aplicaci\u00F3n instalada para visualizar Certificados X.509
SignDataPanel.24=Datos en memoria
SignDataPanel.25=Formato de firma
SignDataPanel.26=Datos firmados
SignDataPanel.27=La firma no contiene los datos firmados
SignDataPanel.28=Ver datos firmados
SignDataPanel.29=\u00C1rbol de firmas del documento
SignDataPanel.3=Ver fichero
SignDataPanel.30=Copiar la ruta del fichero
SignDataPanel.31=Firma electr\u00F3nica
SignDataPanel.32=No se han encontrado firmantes
SignDataPanel.4=Abre el fichero firmado con la aplicaci\u00F3n configurada en su sistema operativo
SignDataPanel.40=Fichero de tipo Microsoft Office (OOXML)
SignDataPanel.41=Fichero de tipo OpenDocument (ODF)
SignDataPanel.42=Sellos de tiempo
SignDataPanel.43=Fichero
SignDataPanel.44=Formato
SignDataPanel.45=Tama\u00F1o
SignDataPanel.46=Enlace a 
SignDataPanel.47=Lista de archivos a firmar 
SignDataPanel.5=Bot\u00F3n para abrir los datos firmados
SignDataPanel.6=Abre el documento firmado con la aplicaci\u00F3n configurada en el sistema
SignDataPanel.7=No se ha podido abrir el fichero,\ncompruebe que no ha sido manipulado mientras se ejecutaba esta aplicaci\u00F3n\n y que dispone de una aplicaci\u00F3n instalada para visualizarlo
SignDataPanel.9=Fichero de tipo Portable Document Format (PDF)
SignDetailPanel.0=Firmar m\u00E1s ficheros

MassiveResultProcessPanel.0=Directorio de salida
MassiveResultProcessPanel.1=Ruta del directorio en el que se han almacenado las firmas
MassiveResultProcessPanel.10=Tama\u00F1o
MassiveResultProcessPanel.11=Estado
MassiveResultProcessPanel.12=Lista de documentos firmados 
MassiveResultProcessPanel.13=Firma correcta 
MassiveResultProcessPanel.14=Firma incorrecta  
MassiveResultProcessPanel.2=Copiar la ruta del directorio
MassiveResultProcessPanel.3=Directorio de firmas:
MassiveResultProcessPanel.4=Abrir directorio
MassiveResultProcessPanel.5=Abre el directorio con las firmas generadas en su explorador de archivos
MassiveResultProcessPanel.6=Bot\u00F3n para abrir el directorio
MassiveResultProcessPanel.7=Abre el directorio con las firmas generadas en su explorador de archivos
MassiveResultProcessPanel.8=No se ha podido abrir el fichero,\ncompruebe que no ha sido manipulado mientras se ejecutaba esta aplicaci\u00F3n
MassiveResultProcessPanel.9=Fichero

SignPanel.0=Fichero de tipo Portable Document Format (PDF)
SignPanel.1=El fichero es demasiado grande y no se puede firmar por falta de memoria
SignPanel.10=Documento XML
SignPanel.11=Documento binario gen\u00E9rico
SignPanel.12=Fichero binario gen\u00E9rico
SignPanel.13=Por favor, espere mientras se inicializa el almac\u00E9n de claves
SignPanel.14=Bienvenido a Autofirma
SignPanel.15=Firmando electr\u00F3nicamente el fichero
SignPanel.16=A\u00F1adir firma
SignPanel.17=Fichero de tipo Factura-e (Factura Electr\u00F3nica)
SignPanel.19=No se ha podido completar la selecci\u00F3n de certificados.
SignPanel.20=Factura-e (Factura Electr\u00F3nica)
SignPanel.21=No se permite la firma de directorios,\n\u00FAnicamente de ficheros individuales.
SignPanel.22=Se intenta cargar una factura electr\u00F3nica ya firmada. No se permite agregar nuevas firmas a\r\nuna factura electr\u00F3nica. Se cancelar\u00E1 la operaci\u00F3n.
SignPanel.23=La contrase\u00F1a proporcionada para firmar el PDF no es v\u00E1lida.
SignPanel.24=No se soporta la firma de ficheros remotos con esta aplicaci\u00F3n,\nseleccione un fichero local para firmarlo
SignPanel.25=Firmando...
SignPanel.26=El fichero es demasiado grande.\nSu sistema no puede firmar ficheros tan grandes por falta de memoria.
SignPanel.29=El almac\u00E9n no contiene ning\u00FAn certificado que se pueda usar para firmar.
SignPanel.3=El fichero seleccionado no existe, y por lo tanto no puede firmarse.
SignPanel.30=Documento OpenDocument (ODF)
SignPanel.31=Fichero ODF (Open Document Format)
SignPanel.32=Seleccionar ficheros a firmar
SignPanel.33=Pulse este bot\u00F3n o arrastre un fichero al \u00E1rea inferior para iniciar el proceso de selecci\u00F3n de fichero a firmar
SignPanel.34=Bot\u00F3n de selecci\u00F3n de fichero a firmar
SignPanel.35=Seleccione el fichero a firmar
SignPanel.36=No se ha podido leer el contenido del fichero a firmar,\ncompruebe que no esta abierto por otra aplicaci\u00F3n y\nsi est\u00E1 en almacenamiento extraible pruebe a expulsarlo\ne insertarlo de nuevo
SignPanel.37=Documento Microsoft Office (OOXML)
SignPanel.38=Fichero OOXML (Office Open XML)
SignPanel.39=Documento de firma
SignPanel.40=<html><p>En esta pantalla puede firmar electr\u00F3nicamente ficheros que se encuentren en su disco duro.<br>Cuando firma electr\u00F3nicamente un fichero pueden incorporarse a este ciertos datos personales, entre los que pueden encontrarse su n\u00FAmero de DNI, su nombre y apellidos o incluso informaci\u00F3n sobre su situaci\u00F3n laboral si utiliza un certificado profesional. Consulte las pol\u00EDticas de seguridad y protecci\u00F3n de datos de los receptores de los ficheros firmados antes de enviarlos o distribuirlos.</p>A partir de este punto, si inserta o extrae una tarjeta inteligente o dispositivo criptogr\u00E1fico USB deber\u00E1 seleccionar el almac\u00E9n de claves apropiado desde el di\u00E1logo de selecci\u00F3n de certificados o pulsar el bot\u00F3n Actualizar para recargar el almac\u00E9n seleccionado.</html>
SignPanel.41=Pulse el bot\u00F3n o arrastre ficheros o directorios a esta \u00E1rea
SignPanel.42=Arrastre un fichero a este \u00E1rea para seleccionarlo y poder firmarlo electr\u00F3nicamente
SignPanel.43=Panel de arrastre de fichero
SignPanel.44=Hacer la firma visible dentro del PDF
SignPanel.45=Firmar
SignPanel.46=Tipo de fichero: %0
SignPanel.47=Fecha \u00FAltima modificaci\u00F3n: %0
SignPanel.48=<html>Realizando la firma electr\u00F3nica...<br>Esta tarea puede tardar varios minutos.</html>
SignPanel.49=Tama\u00F1o: 
SignPanel.5=El fichero seleccionado est\u00E1 vac\u00EDo.\nNo es posible firmar ficheros vac\u00EDos.
SignPanel.50=Proceso de firma electr\u00F3nica
SignPanel.51=Ver Fichero
SignPanel.52=Bot\u00F3n de ver fichero
SignPanel.53=No se ha podido abrir el fichero.\nCompruebe que dispone de una aplicaci\u00F3n instalada para ver este tipo de ficheros\ny que este no ha sido manipulado mientras se ejecutaba esta aplicaci\u00F3n
SignPanel.55=No se ha encontrado ning\u00FAn certificado para firmar,\nCompruebe su almac\u00E9n de claves e importe uno si es necesario
SignPanel.56=Se encontr\u00F3 un error durante la operaci\u00F3n con el certificado seleccionado.
SignPanel.6=Fichero de firma 
SignPanel.65=Ocurri\u00F3 un problema durante el proceso de firma, pruebe a reintentar\nla firma reiniciando la aplicaci\u00F3n
SignPanel.7=No se tienen permisos de lectura para el fichero seleccionado.\nSeleccione otro fichero o habilite los permisos de lectura para este.
SignPanel.72=Documentos Adobe PDF (*.pdf)
SignPanel.76=Firmas XML (*.xml, *.xsig)
SignPanel.8=Fichero de tipo XML
SignPanel.80=Firmas binarias (*.csig, *.p7s)
SignPanel.81=Guardar fichero firmado
SignPanel.84=Ya existe un fichero con ese nombre,\n\u00BFDesea sobreescribirlo?
SignPanel.88=No se ha podido guardar el resultado de la firma, asegures\u00E9 de\nque el fichero seleccionado no est\u00E1 abierto por otra aplicaci\u00F3n y\nde que cuenta con los permisos adecuados y reintente la operaci\u00F3n
SignPanel.89=No se ha podido guardar los datos, asegures\u00E9 de\nque el fichero seleccionado no est\u00E1 abierto por otra aplicaci\u00F3n y\nde que cuenta con los permisos adecuados y reintente la operaci\u00F3n
SignPanel.9=Documento Adobe PDF
SignPanel.91=Documentos Microsoft Word (*.docx)
SignPanel.92=Documentos Microsoft PowerPoint (*.pptx)
SignPanel.93=Documentos Microsoft Excel (*.xslx)
SignPanel.94=Documentos Microsoft Office (*.ooxml)
SignPanel.96=Textos de OpenDocument (*.odt)
SignPanel.97=Presentaciones de OpenDocument (*.odp)
SignPanel.98=Hojas de c\u00E1lculo de OpenDocument (*.ods)
SignPanel.99=Documentos OpenDocument (*.odf)
SignPanel.100=No se han podido guardar los par\u00E1metros de la firma visible
SignPanel.101=El archivo no es un formato de im\u00E1gen valido
SignPanel.102=El documento indicado no permite que se le agreguen firmas
SignPanel.103=Formato: %0 
SignPanel.104=Firma PDF
SignPanel.105=Firma de FacturaE
SignPanel.106=Firma XAdES
SignPanel.107=Firma CAdES
SignPanel.108=Firma ODF
SignPanel.109=Firma OOXML
SignPanel.110=Formato desconocido
SignPanel.111=El plugin %0 ha devuelto un error al procesar los datos de entrada: %1
SignPanel.112=El plugin %0 ha devuelto un error al procesar la firma generada: %1
SignPanel.113=No se ha podido cargar el listado de plugins. No se usaran para el procesado de los datos.
SignPanel.114=No se ha podido cargar el listado de plugins. No se usaran para el procesado de la firma.
SignPanel.115=El plugin %0 ha devuelto un error al reiniciarse para permitir nuevas firmas: %1
SignPanel.116=Cofirma
SignPanel.117=Contrafirma (\u00FAnicamente de los nodos hoja)
SignPanel.118=Contrafirma (de todo el \u00E1rbol)
SignPanel.119=Opciones Avanzadas
SignPanel.120=Insertar una marca visible dentro del PDF
SignPanel.121=No se pueden aplicar marcas visibles a documentos ya firmados
SignPanel.123=No se ha podido cargar el fichero seleccionado.
SignPanel.124=Tipo de certificado no soportado: %0
SignPanel.125=No se encuentran los datos firmados
SignPanel.126=Informaci\u00F3n corrupta
SignPanel.127=La firma no se corresponde con los datos firmados
SignPanel.128=No se encuentra la firma dentro del documento
SignPanel.129=No se puede extraer un certificado o no es v\u00E1lido
SignPanel.130=Certificado de firma caducado
SignPanel.131=Certificado de firma que a\u00FAn no es v\u00E1lido
SignPanel.132=Algoritmo no reconocido o no soportado
SignPanel.133=No se soporta la CA de expedici\u00F3n
SignPanel.134=CRLs de firma err\u00F3neas
SignPanel.135=No se puede comprobar la validez de la firma PDF
SignPanel.136=No se puede comprobar la validez de la firma OOXML
SignPanel.137=No se puede comprobar la validez de la firma ODF
SignPanel.138=No se puede comprobar la validez de la firma
SignPanel.139=Formato de firma no reconocido
SignPanel.140=Firma inv\u00E1lida
SignPanel.141=No se puede completar la validaci\u00F3n
SignPanel.142=Configuraci\u00F3n de firma:
SignPanel.143=Atributos de firma:
SignPanel.144=Roles del firmante: %0
SignPanel.145=Informaci\u00F3n del documento:
SignPanel.146=Ver todos los atributos...
SignPanel.147=(Firma inv\u00E1lida)
SignPanel.148=Ver atributos de firma
SignPanel.149=Lugar de firma
SignPanel.150=No se puede firmar con formato FacturaE la factura ya firmada
SignPanel.151=Es posible que el documento se haya modificado despues de firmarse
SignPanel.152=Posible solapamiento entre firmas visibles
SignPanel.153=Confirmaci\u00F3n requerida
SignPanel.154=No se pudo completar la firma: %0
SignPanel.155=Resultado de validaci\u00F3n:
SignPanel.156=Firma v\u00E1lida
SignPanel.157=(Cambiar)
SignPanel.158=No se pueden agregar firmas certificadas a un documento ya firmado
SignPanel.159=El documento certificado no permit\u00EDa nuevas firmas
SignPanel.160=PIN es incorrecto. ¿Desea reintentar la operaci\u00F3n?
SignPanel.161=El almacen del certificado est\u00E1 bloqueado. Se aborta la operaci\u00F3n.
SignPanel.162=Se identifico un error de autenticaci\u00F3n al utilizar el certificado. Se aborta la operaci\u00F3n.

SignPanelSignTask.0=<html>Creando previsualizaci\u00F3n del PDF.<br>Esta tarea puede tardar varios minutos.</html>
SignPanelSignTask.1=Selecci\u00F3n de campo PDF para firma visible
SignPanelSignTask.3=Seleccione el directorio de salida
SignPanelSignTask.4=Confirmaci\u00F3n requerida

SignResultPanel.0=No ha sido posible recuperar la informaci\u00F3n adicional,\npruebe a abrir la siguiente URL desde un navegador Web:\n
SignResultPanel.10=La firma electr\u00F3nica es v\u00E1lida en cuanto a estructura
SignResultPanel.11=No se ha podido completar la validaci\u00F3n
SignResultPanel.12=Ha ocurrido un error que ha impedido la validaci\u00F3n de la firma electr\u00F3nica.
SignResultPanel.13=Se desconoce la validez de la firma
SignResultPanel.14=Firma electr\u00F3nica corrupta.
SignResultPanel.15=No se dispone de los datos originales para la validaci\u00F3n de la firma electr\u00F3nica.
SignResultPanel.16=Alguno de los certificados de firma est\u00E1 caducado.
SignResultPanel.17=Alguno de los certificados de firma aun no es v\u00E1lido.
SignResultPanel.18=No se ha podido extraer el certificado de firma o \u00E9ste est\u00E1 corrupto.
SignResultPanel.19=Los datos contenidos o referenciados en la firma no se corresponden con los datos firmados.
SignResultPanel.2=Proceso de firma completado satisfactoriamente
SignResultPanel.21=Ha ocurrido un problema procesando las listas de certificados revocados.
SignResultPanel.20=Se detect\u00F3 un error en las CRL de la firma.
SignResultPanel.22=Se ha encontrado un algoritmo no reconocido o no soportado.
SignResultPanel.23=Se han producido errores al firmar uno o varios de los documentos seleccionados. 
SignResultPanel.24=Compruebe la validez de la firma en su aplicaci\u00F3n de lectura de PDF.
SignResultPanel.25=Compruebe la validez de la firma con la \u00FAltima versi\u00F3n disponible de Microsoft Office.
SignResultPanel.26=Compruebe la validez de la firma con la \u00FAltima versi\u00F3n disponible de su programa compatible con OpenDocument (LibreOffice, Apache OpenOffice, etc.)
SignResultPanel.27=Proceso finalizado correctamente
SignResultPanel.28=Todas las firmas se han generado correctamente. Puede validar estas u otras firmas electr\u00F3nicas en:
SignResultPanel.29=Todas las firmas del lote se han generado correctamente.
SignResultPanel.30=Proceso finalizado con errores
SignResultPanel.31=Ocurri\u00F3 un error al firmar uno o varios de los documentos seleccionados. Compruebe que estos documentos existen y pueden leerse. Firme los documentos individualmente si persiste el problema. Puede validar las firmas generadas correctamente en:
SignResultPanel.32=Ocurri\u00F3 un error al firmar alguno de los documentos seleccionados.
SignResultPanel.33=https://valide.redsara.es/
SignResultPanel.34=No se pudo aplicar la firma visible correctamente a los siguientes documentos, \nya que la posici\u00F3n o p\u00E1ginas donde introducir la misma se encontraba fuera de rango:\n
SignResultPanel.35=Se han encontrado cambios en un formulario del PDF posteriores a la firma.
SignResultPanel.36=Es probable que el documento haya sido modificado despu\u00E9s de la \u00FAltima firma.
SignResultPanel.37=Hay firmas solapadas en el documento, lo cual puede ocultar informaci&oacute;n del mismo.
SignResultPanel.38=Detalles de la firma
SignResultPanel.39=No se permite la validaci\u00F3n de firmas con referencias externas.
SignResultPanel.40=La firma contiene atributos longevos que Autofirma no puede validar. Para una validaci\u00F3n completa acuda a VALIDe.
SignResultPanel.3=La firma es correcta en cuanto a estructura, pero para determinar su completa validez legal debe comprobar adem\u00E1s la validez de los certificados usados. Para ello, puede validar esta u otras firmas electr\u00F3nicas en:
SignResultPanel.4=Se ha generado correctamente una firma electr\u00F3nica
SignResultPanel.5=La firma no es v\u00E1lida o no est\u00E1 soportada
SignResultPanel.6=La firma electr\u00F3nica seleccionada no es v\u00E1lida
SignResultPanel.8=Firma electr\u00F3nica v\u00E1lida
SignResultPanel.9=La firma es correcta en cuanto a estructura, pero para determinar su completa validez legal debe comprobar adem\u00E1s la validez de los certificados usados. Puede validar esta u otras firmas electr\u00F3nicas en:

ValidationInfoDialog.0=Detalles de la firma y errores de validaci\u00F3n
ValidationInfoDialog.1=Informaci\u00F3n sobre la firma:
ValidationInfoDialog.2=Certificado caducado.
ValidationInfoDialog.3=Certificado no v\u00E1lido a\u00FAn.
ValidationInfoDialog.4=No se ha podido verificar la informacion del firmante.
ValidationInfoDialog.5=La clave de firma no es v\u00E1lida o no es compatible con el algoritmo de firma declarado.
ValidationInfoDialog.6=Ciudad
ValidationInfoDialog.7=Estado o provincia
ValidationInfoDialog.8=C\u00F3digo postal
ValidationInfoDialog.9=Pa\u00EDs
ValidationInfoDialog.10=Papel del firmante
ValidationInfoDialog.11=Calle
ValidationInfoDialog.12=La firma se encuentra dentro del XML firmado.
ValidationInfoDialog.14=Datos anexos a la firma.
ValidationInfoDialog.16=Relaci\u00F3n interna de datos.
ValidationInfoDialog.17=No se ha podido leer correctamente el fichero de firma.
ValidationInfoDialog.18=Raz\u00F3n de firma
ValidationInfoDialog.19=Localizaci\u00F3n
ValidationInfoDialog.20=Informaci\u00F3n de contacto
ValidationInfoDialog.21=La firma contiene los datos.
ValidationInfoDialog.22=La firma no contiene los datos.
ValidationInfoDialog.23=Localidad
ValidationInfoDialog.24=Datos binarios
ValidationInfoDialog.25=PDF
ValidationInfoDialog.26=XML
ValidationInfoDialog.27=PostScript
ValidationInfoDialog.28=HTML
ValidationInfoDialog.29=TIFF
ValidationInfoDialog.30=GIF
ValidationInfoDialog.31=JPEG
ValidationInfoDialog.32=PNG
ValidationInfoDialog.33=MPEG
ValidationInfoDialog.34=SGML
ValidationInfoDialog.35=Microsoft Word
ValidationInfoDialog.36=Microsoft Excel
ValidationInfoDialog.37=Microsoft Project
ValidationInfoDialog.38=Microsoft Powerpoint
ValidationInfoDialog.38=Microsoft Works
ValidationInfoDialog.39=JPG
ValidationInfoDialog.40=Correcta. No se ha realizado la comprobaci\u00F3n de revocaci\u00F3n del certificado.
ValidationInfoDialog.41=No se admiten cambios.
ValidationInfoDialog.42=Solo se permiten acciones de rellenado de formularios, firma y adici\u00F3n de p\u00E1ginas.
ValidationInfoDialog.43=Solo se permiten acciones de comentarios, rellenado de formularios, firma y adici\u00F3n de p\u00E1ginas.

RestoreConfigPanel.0=
RestoreConfigPanel.1=Iniciar restauraci\u00F3n
RestoreConfigPanel.2=Pulse este bot\u00F3n para iniciar la restauraci\u00F3n de la configuraci\u00F3n en navegadores y conexiones de Autofirma.
RestoreConfigPanel.3=Bot\u00F3n para iniciar el proceso de restauraci\u00F3 de la configuraci\u00F3n de navegadores y conexiones de Autofirma.
RestoreConfigPanel.4=<html><p>Autofirma permite generar firmas electr\u00F3nicas como parte de un tr\u00E1mite web compatible de administraci\u00F3n electr\u00F3nica. Para ello es necesario que su sistema se encuentre correctamente configurado. Si instala un nuevo navegador web, se da de alta un nuevo usuario en el sistema o tienes problemas al firmar en un tr\u00E1mite web, utilice esta funci\u00F3n para restaurar la comunicaci\u00F3n entre Autofirma y sus navegadores web.</p>
RestoreConfigPanel.5=Cerrar
RestoreConfigPanel.6=Cierra el di\u00E1logo de restauraci\u00F3n
RestoreConfigPanel.7=Configurar Firefox para que conf\u00EDe en los certificados ra\u00EDz del sistema.
RestoreConfigPanel.8=Al activarlo, se configura Firefox para que conf\u00FDe en los certificados de las entidades de certificaci\u00F3n ra\u00FDz de confianza del sistema. Si no se activa, se desactivar\u00E1 esta opci\u00F3n de Firefox. 
RestoreConfigPanel.9=Casilla de verificaci\u00F3n para activar o desactivar 

SimpleAfirma.0=No se ha podido leer el contenido del fichero a firmar,\ncompruebe que no esta abierto por otra aplicaci\u00F3n y\nsi est\u00E1 en almacenamiento extraible pruebe a expulsarlo\ne insertarlo de nuevo
SimpleAfirma.10=Autofirma v%0
SimpleAfirma.11=No se pudo aplicar la configuraci\u00F3n de proxy configurada. Esto puede afectar a su uso desde aplicaciones web.
SimpleAfirma.12=No se pudo cargar el fichero indicado. 
SimpleAfirma.2=El fichero no existe o no es accesible para lectura
SimpleAfirma.3=La aplicaci\u00F3n ya se est\u00E1 ejecutando en otra ventana.\n\u00DAnicamente se permite una instancia activa.
SimpleAfirma.4=No se han podido cargar los plugins en la aplicaci\u00F3n.
SimpleAfirma.42=No se ha podido inicializar ni su DNIe ni el almac\u00E9n de claves de su sistema operativo.\nNo podr\u00E1 realizar firmas electr\u00F3nicas.
SimpleAfirma.47=\u00BFDesea cerrar la aplicaci\u00F3n de firma?
SimpleAfirma.48=Advertencia
SimpleAfirma.49=Autofirma se est\u00E1 ejecutando con Java %0. Esta versi\u00F3n no est\u00E1 oficialmente soportada y pueden producirse errores durante su ejecuci\u00F3n.
SimpleAfirma.50=Versi\u00F3n de Java no soportada
SimpleAfirma.51=No volver a mostrar
SimpleAfirma.52=Ocurri\u00F3 un error inesperado al ejecutar la acci\u00F3n.
SimpleAfirma.53=Error al leer el archivo de ayuda.
SimpleAfirma.54=Error al seleccionar el almac\u00E9n configurado. Se cargar\u00E1 el del sistema.
SimpleAfirma.56=Error al leer almac\u00E9n. Se cargar\u00E1 el del sistema.
SimpleAfirma.57=Operaci\u00F3n cancelada. Se cargar\u00E1 el almac\u00E9n de claves del sistema.
SimpleAfirma.6=No se ha podido inicializar el almac\u00E9n de claves.\nNo podr\u00E1 realizar firmas electr\u00F3nicas.
SimpleAfirma.7=Error
SimpleAfirma.8=Problema en la operaci\u00F3n
SimpleAfirma.9=No se permite agregar nuevas firmas a documentos con firmas no v\u00E1lidas. 

SimpleKeyStoreManager.0=Introduzca la contrase\u00F1a maestra de Mozilla Firefox
SimpleKeyStoreManager.1=No se ha detectado un DNIe insertado \u00BFDesea reintentar?
SimpleKeyStoreManager.9=Su DNIe est\u00E1 bloqueado, debe acudir a una comisar\u00EDa de polic\u00EDa para desbloquearlo.\nSe continuar\u00E1 con el almac\u00E9n por defecto del sistema.
SimpleKeyStoreManager.10=Detectado DNIe bloqueado
SimpleKeyStoreManager.11=No se ha podido obtener el almac\u00E9n de claves por defecto: %0 . Se cargar\u00E1 el del sistema.
SimpleKeyStoreManager.12=Contrase\u00F1a incorrecta
SimpleKeyStoreManager.13=Operaci\u00F3n cancelada. Se cargar\u00E1 el almac\u00E9n de claves del sistema.
SimpleKeyStoreManager.2=No hay tarjeta en el lector
SimpleKeyStoreManager.3=La tarjeta detectada en el lector no es un DNIe.\n\u00BFDesea reintentar?
SimpleKeyStoreManager.4=Detectada tarjeta incorrecta
SimpleKeyStoreManager.5=Su DNIe est\u00E1 da\u00F1ado, debe acudir a una comisar\u00EDa de polic\u00EDa para renovarlo.\nSe continuar\u00E1 con el almac\u00E9n por defecto del sistema.
SimpleKeyStoreManager.6=Detectado DNIe da\u00F1ado
SimpleKeyStoreManager.7=No ha sido posible inicializar su DNIe.\nSe continuar\u00E1 con el almac\u00E9n por defecto del sistema.
SimpleKeyStoreManager.8=Error en la iniciaizaci\u00F3n del DNIe

VisorFirma.0=Visor de firmas electr\u00F3nicas
VisorFirma.1=Abrir
VisorPanel.0=Cerrar visor
VisorPanel.1=Ver otra firma

ErrorPane.1=<a>Ver detalles</a>

TrayIcon.0=Utilice este men\u00fa para configurar las opciones de Autofirma.
TrayIcon.1=Accede al di\u00E1logo  de preferencias de Autofirma.
TrayIcon.10=Selecci\u00f3n de Almac\u00e9n de certificados prioritario
TrayIcon.11=Selecciona el almac\u00E9n de claves y certificados prioritario de la aplicaci\u00F3n.
TrayIcon.12=Ver Almac\u00e9n de certificados
TrayIcon.13=Muestra el contenido del almac\u00E9n de claves y certificados por defecto de la aplicaci\u00F3n.
TrayIcon.14=No ha sido posible modificar la opci\u00f3n de inicio autom\u00E1tico de Autofirma
TrayIcon.15=Error
TrayIcon.16=Selecci\u00f3n de Almac\u00e9n de certificados por defecto
TrayIcon.17=Selecciona el almac\u00E9n de claves y certificados por defecto de la aplicaci\u00F3n.
TrayIcon.2=Cierra el men\u00fa de configuraci\u00f3n de las opciones de Autofirma.
TrayIcon.20=Selecionar almac\u00E9n por defecto
TrayIcon.21=Selecionar almac\u00E9n prioritario
TrayIcon.22=<html><p>Se usar\u00E1 el almac\u00E9n prioritario siempre que est\u00E9 presente, con preferencia sobre el almac\u00E9n por defecto.</p><p>Si se tratase de una tarjeta inteligente, esta deber\u00E1 permanecer insertada durante toda la ejecuci\u00F3n del programa.</p><br>Si no se establece un almac\u00E9n prioritario se usar\u00E1 siempre el por defecto.</html>
TrayIcon.3=Muestra informaci\u00f3n acerca de Autofirma.
TrayIcon.4=Habilita el inicio autom\u00e1tico de Autofirma mostrando un icono en el \u00e1rea de notificaciones.
TrayIcon.5=Preferencias
TrayIcon.6=Cerrar
TrayIcon.7=Acerca de Autofirma
TrayIcon.8=Mostrar Icono
TrayIcon.9=Almac\u00e9n de certificados

TimestampsAnalyzer.0=Por favor, introduzca la contrase\u00F1a del PDF

RestoreApplication.0=Ocurri\u00F3 un error durante la configuraci\u00F3n de Autofirma.\nAutofirma no podr\u00E1 comunicarse con su navegador web.
RestoreApplication.1=Ocurri\u00F3 un error grave durante la configuraci\u00F3n de Autofirma.\nAutofirma no podr\u00E1 comunicarse con su navegador web.
RestoreApplication.2=Error
RestoreApplication.3=\ \ Error al copiar, leer o eliminar alguno de los ficheros de configuraci\u00F3n
RestoreApplication.4=\ \ Error al generar las claves de cifrado SSL
RestoreApplication.5=\ \ Error en la importacion de la CA de confianza o la limpieza del almacen
RestoreApplication.6=No se se tiene acceso a la red. Es posible que esto afecte a los procesos\nde firma en la invocaci\u00F3n desde una p\u00E1gina web.
RestoreApplication.7=Cierre el navegador Mozilla Firefox para poder instalar el certificado de confianza de Autofirma en el navegador.
RestoreApplication.8=Cierre el navegador Chrome para registrar el protocolo de Autofirma en el navegador.
RestoreApplication.9=Aviso
RestoreApplication.10=El certificado de confianza para la comunicaci\u00F3n entre Mozilla Firefox y Autofirma\nno ha podido instalarse. Para realizar esta operaci\u00F3n debe ejecutar Autofirma en modo administrador.
RestoreApplication.11=No se ha cerrado el navegador Chrome. Cierre el Chrome y pulse el bot\u00F3n OK para registrar\nel procolo de Autofirma en el navegador. Si no puede o no desea cerrar el navegador, pulse el\nbot\u00F3n Cancelar para continuar con la restauraci\u00F3n.
RestoreApplication.12=No se ha cerrado el navegador Firefox. Cierre el Firefox y pulse el bot\u00F3n OK para poder\ninstalar el certificado de confianza de Autofirma en el navegador. Si no necesita utilizar Autofirma\ndesde Firefox, pulse el bot\u00F3n Cancelar para continuar con la restauraci\u00F3n. 
RestoreApplication.13=INFO: Inicio de la restauraci\u00F3n
RestoreApplication.14=INFO: Fin de la restauraci\u00F3n

RestoreConfigWindows.0=El certificado de confianza para la comunicaci\u00F3n entre el su navegador Web y Autofirma\nno ha podido instalarse. Necesita instalar este certificado para poder realizar firmas desde\nsu navegador. \u00BFDesea reintentar instalar este certificado?
RestoreConfigWindows.1=Error
RestoreConfigWindows.11=INFO: Guardando en disco los certificados SSL...
RestoreConfigWindows.12=INFO: No se han detectado perfiles de Mozilla Firefox en el que instalar el certificado
RestoreConfigWindows.13=INFO: Instalando el certificado SSL en el almac\u00E9n de Mozilla Firefox
RestoreConfigWindows.14=INFO: Se utilizaran los certificados del directorio de instalaci\u00F3n
RestoreConfigWindows.16=INFO: Eliminando los certificados SSL anteriores...
RestoreConfigWindows.17=ERROR: No se ha podido eliminar la versi\u00F3n previa de los certificados.
RestoreConfigWindows.18=INFO: Instalando certificados SSL en el almac\u00E9n de Windows...
RestoreConfigWindows.20=ERROR: No se ha importado el certificado ra\u00EDz CA "Autofirma ROOT" en almac\u00E9n de Windows. El proceso de restauraci\u00F3n continuar\u00E1 pero no estar\u00E1 completo hasta importar el certificado en el almac\u00E9n de Windows.
RestoreConfigWindows.22=INFO: Eliminando certificados anteriores del almac\u00E9n de Windows...
RestoreConfigWindows.24=INFO: Restaurando la configuraci\u00F3n del protocolo afirma en el registro de Windows...
RestoreConfigWindows.25=ERROR: No se ha podido restaurar el protocolo "afirma". Ejecute Autofirma con privilegios de administrador para realizar esta tarea.
RestoreConfigWindows.26=INFO: El certificado ra\u00EDz ya se encontraba instalado en el almac\u00E9n de Windows.
RestoreConfigWindows.27=ERROR: No ha podido cargarse el certificado ra\u00EDz para su instalaci\u00F3n.
RestoreConfigWindows.3=INFO: Directorio de aplicaci\u00F3n: %0
RestoreConfigWindows.31=ERROR: No se ha podido instalar el certificado de confianza en el almac\u00E9n de Firefox.
RestoreConfigWindows.32=ERROR: Se ha cancelado la instalaci\u00F3n del certificado en el almac\u00E9n de Windows.
RestoreConfigWindows.33=ERROR: No se han podido generar y copiar a disco los certificados SSL para la conexi\u00F3n con los navegadores. Se omite su configuraci\u003Fn.
RestoreConfigWindows.34=ADVERTENCIA: No se ha podido eliminar alguna importaci\u00F3n previa del certificado ra\u00EDz del almac\u00E9n de Windows
RestoreConfigWindows.35=INFO: Eliminando certificado anterior del almac\u00E9n de Windows. Compruebe si se ha abierto un di\u00E1logo en segundo plano pidiendo confirmaci\u00F3n...
RestoreConfigWindows.36=INFO: Copiando el almacen SSL para la conexi\u00F3n con Autofirma WebStart...
RestoreConfigWindows.37=ADVERTENCIA: No se ha podido copiar el almacen SSL para la conexi\u00F3n con Autofirma WebStart.
RestoreConfigWindows.38=INFO: Se crear\u00E1n nuevos certificados SSL.
RestoreConfigWindows.39=INFO: Se reutilizar\u00E1n los certificados del directorio de instalaci\u00F3n.
RestoreConfigWindows.4=ERROR: No se cargar el certificado raiz del directorio de instalacion.
RestoreConfigWindows.41=INFO: Configuramos Firefox para que conf\u00EDe en los certificados ra\u00EDz del almac\u00E9n de confianza del sistema.
RestoreConfigWindows.42=INFO: Se restaura la configuraci\u00F3n de Firefox para que s\u00F3lo conf\u00EDe en los certificados de su almac\u00E9n.
RestoreConfigWindows.43=ERROR: No se ha podido cambiar la confianza de Firefox en el almac\u00E9n de certificados del sistema.
RestoreConfigWindows.44=INFO: No se han detectado perfiles de Mozilla Firefox en los que configurar la confianza en el almac\u00E9n del sistema.
RestoreConfigWindows.45=ADVERTENCIA: No se ha cerrado Firefox. Es posible que no pueda ejecutar Autofirma en todos los despliegues desde este navegador.
RestoreConfigWindows.5=INFO: Generando certificados para la comunicaci\u00F3n con el navegador web...

ConfiguratorConsole.0=Configurador

RestoreConfigLinux.1=ERROR: No se ha podido identificar un directorio de aplicaci\u00F3n al que copiar los certificados. Se aborta la restauraci\u00F3n.
RestoreConfigLinux.10=ERROR: No se ha podido instalar el certificado de confianza SSL en el almac\u00E9n del sistema.
RestoreConfigLinux.11=INFO: Guardando almac\u00E9n de claves...
RestoreConfigLinux.12=ADVERTENCIA: No se ha detectado un perfil de Mozilla Firefox en el que instalar el certificado.
RestoreConfigLinux.13=INFO: Instalando el certificado de confianza SSL en el almac\u00E9n de Mozilla Firefox...
RestoreConfigLinux.14=INFO: El certificado para la configuraci\u00F3n del canal seguro ya se encuentra generado.
RestoreConfigLinux.15=INFO: Restaurando la configuraci\u00F3n del protocolo "afirma" en Mozilla Firefox... (Puede que se le soliciten permisos de administrador)
RestoreConfigLinux.16=ERROR: No se ha podido restaurar la configuraci\u00F3n del protocolo "afirma".
RestoreConfigLinux.17=ERROR: No se han podido copiar las herramientas de instalaci\u00F3n de certificados. Se aborta la restauraci\u00F3n de los certificados SSL.
RestoreConfigLinux.18=ADVERTENCIA: No se ha podido instalar el certificado de confianza SSL en todos los perfiles de Mozilla Firefox.
RestoreConfigLinux.19=INFO: Operaci\u00F3n cancelada por el usuario.
RestoreConfigLinux.2=ERROR: No se han podido generar los certificados de confianza SSL. Se aborta la restauraci\u00F3n de los certificados SSL.
RestoreConfigLinux.3=INFO: Directorio de aplicaci\u00F3n: %0.
RestoreConfigLinux.4=ERROR: No se han podido copiar los certificados de confianza SSL a disco.
RestoreConfigLinux.5=INFO: Generando certificado para la comunicaci\u00F3n con el navegador web...
RestoreConfigLinux.6=ERROR: No se han podido localizar los directorios de usuario del sistema. Se aborta la restauraci\u00F3n de los certificados SSL.
RestoreConfigLinux.9=INFO: Instalando el certificado en el almac\u00E9n del sistema...

RestoreConfigMacOSX.1=ERROR: No se tienen permisos sobre el directorio de aplicacion. Conc\u00E9dalos manualmente repita la restauraci\u00F3n.
RestoreConfigMacOSX.10=ERROR: No se tienen permisos para instalar los certificados SSL en el almacen de confianza del sistema. Se aborta la restauraci\u00F3n de los certificados SSL.
RestoreConfigMacOSX.11=ERROR: No se pudieron instalar los certificados SSL en el almacen de confianza. Se aborta la restauraci\u00F3n de los certificados SSL.
RestoreConfigMacOSX.12=ADVERTENCIA: No se ha detectado un perfil de Mozilla Firefox en el que instalar el certificado
RestoreConfigMacOSX.13=INFO: Instalando el certificado en el almac\u00E9n de Mozilla Firefox...
RestoreConfigMacOSX.14=INFO: Ya se encuentra generado el certificado para la configuraci\u00F3n del canal seguro.
RestoreConfigMacOSX.15=ERROR: No se pudo crear el script temporal para la ejecuci\u00F3n de las operaciones
RestoreConfigMacOSX.17=INFO: Copiando el almacen SSL para la conexi\u00F3n con Autofirma WebStart...
RestoreConfigMacOSX.18=ADVERTENCIA: No se ha podido copiar el almacen SSL para la conexi\u00F3n con Autofirma WebStart.
RestoreConfigMacOSX.19=ADVERTENCIA: No se ha podido instalar el certificado de confianza SSL en todos los perfiles de Mozilla Firefox.
RestoreConfigMacOSX.20=ERROR: No se ha podido instalar el certificado de confianza SSL en el llavero del sistema.
RestoreConfigMacOSX.21=INFO: Configuramos Firefox para que conf\u00EDe en los certificados ra\u00EDz del almac\u00E9n de confianza del sistema.
RestoreConfigMacOSX.22=INFO: Se restaura la configuraci\u00F3n de Firefox para que s\u00F3lo conf\u00EDe en los certificados de su almac\u00E9n.
RestoreConfigMacOSX.23=ERROR: No se ha podido cambiar la confianza de Firefox en el almac\u00E9n de certificados del sistema.
RestoreConfigMacOSX.24=INFO: No se han detectado perfiles de Mozilla Firefox en los que configurar la confianza en el almac\u00E9n del sistema.
RestoreConfigMacOSX.25=INFO: Certificado de CA importado.
RestoreConfigMacOSX.26=INFO: Certificado SSL importado.
RestoreConfigMacOSX.27=<html><p>No se han podido importar los certificados SSL en el Llavero. Deber\u00E1 instalar manualmente los siguientes\ncertificados para permitir el uso de Autofirma desde el navegador:</p>&nbsp;- %0<br>&nbsp;- %1</html>
RestoreConfigMacOSX.28=Error en la importaci\u00F3n
RestoreConfigMacOSX.29=Inserte la contrase\u00F1a del administrador para la importaci\u00F3n de los certificados
RestoreConfigMacOSX.3=INFO: Directorio de aplicaci\u00F3n: %0 
RestoreConfigMacOSX.30=Contrase\u00F1a incorrecta. Inserte la contrase\u00F1a del administrador para la importaci\u00F3n de los certificados
RestoreConfigMacOSX.31=Si cancela la importaci\u00F3n de los certificados no podr\u00E1 utilizar Autofirma desde el\nnavegador del sistema. \u00BFDesea cancelar la instalacion?
RestoreConfigMacOSX.32=Cancelar importacion
RestoreConfigMacOSX.33=INFO: El usuario cancelo la importacion de los certificados SSL en el llavero.
RestoreConfigMacOSX.35=ADVERTENCIA: No se pudo configurar "certutil" por lo que no se podran instalar los certificados en el almacen de Firefox.
RestoreConfigMacOSX.36=INFO: Restauramos los certificados en el perfil de Firefox: %0
RestoreConfigMacOSX.37=ADVERTENCIA: No se ha pudieron restaurar los certificados en el perfil '%0'. Es posible que el usuario no posea permisos sobre el mismo.
RestoreConfigMacOSX.38=INFO: Editamos la confianza de Firefox en el almac\u00E9n del sistema para el perfil: %0
RestoreConfigMacOSX.39=ADVERTENCIA: No se pudo editar la confianza de Firefox en el almac\u00E9n del sistema para el perfil '%0'. Es posible que el usuario no posea permisos sobre el mismo.
RestoreConfigMacOSX.5=INFO: Generando certificado para la comunicaci\u00F3n con el navegador web...
RestoreConfigMacOSX.6=INFO: Importando certificado en el almac\u00E9n de confianza del sistema...
RestoreConfigMacOSX.7=ERROR: No se pudieron copiar a disco los certificados SSL generados. Se aborta la restauraci\u00F3n de los certificados SSL.
RestoreConfigMacOSX.9=ERROR: No se pudieron generar los certificados SSL. Se aborta la restauraci\u00F3n de los certificados SSL.

ConfiguratorWindows.15=No se pudo configurar Chrome para el usuario: %1s
ConfiguratorWindows.16=Se va a instalar el esquema "afirma" como protocolo seguro en Chrome

ConfiguratorGeneral.0=No se ha podido iniciar el proceso de restauraci\u00F3n de la configuraci\u00F3n. Debe cerrar todos los navegadores antes de comenzar.

PluginsManagementPanel.0=Plugins instalados
PluginsManagementPanel.1=Agregar
PluginsManagementPanel.2=Eliminar
PluginsManagementPanel.3=Informaci\u00F3n del plugin
PluginsManagementPanel.4=Configurar
PluginsManagementPanel.5=Cerrar
PluginsManagementPanel.6=Cierra el panel de gesti\u00E3n de plugins
PluginsManagementPanel.7=Instala un nuevo plugin 
PluginsManagementPanel.8=Elimina el plugin seleccionado

PluginsManagementHandler.0=El plugin no es v\u00E1lido y no se cargar\u00E1.
PluginsManagementHandler.1=Ya existe una versi\u00F3n instalada del plugin "%1s".\n\u00BFDesea sustituirla por la nueva versi\u00F3n?
PluginsManagementHandler.2=Ocurri\u00F3 un error al instalar el plugin
PluginsManagementHandler.3=Cargar plugin
PluginsManagementHandler.4=Plugin de Autofirma
PluginsManagementHandler.5=Se va a desinstalar el plugin "%1s". \u00BFDesea continuar?
PluginsManagementHandler.6=Ocurri\u00F3 un error desinstalar el plugin.
PluginsManagementHandler.7=Error
PluginsManagementHandler.8=No se ha podido cargar la lista de plugins.
PluginsManagementHandler.9=Versi\u00F3n:
PluginsManagementHandler.10=Autores:
PluginsManagementHandler.11=Contacto:
PluginsManagementHandler.12=Descripci\u00F3n:
PluginsManagementHandler.13=El di\u00E1logo de configuraci\u00F3n del plugin devolvi\u00F3 un error. Consulte\ncon el desarrollador como resolver el problema.
PluginsManagementHandler.14=Desinstalar plugin
PluginsManagementHandler.15=No se pudo desinstalar la version anterior del plugin. Elimine manualmente el\ndirectorio del plugin del directorio de instalacion de Autofirma. 
PluginsManagementHandler.16=Instalar plugin
PluginsManagementHandler.17=La operaci\u00F3n ha finalizado correctamente. Reinicie la aplicaci\u00F3n para que los cambios\nsurtan efecto.
PluginsManagementHandler.18=Reiniciar Autofirma
PluginsManagementHandler.19=La operaci\u00F3n ha finalizado correctamente, pero es necesario reiniciar la aplicaci\u00F3n para\nque los cambios surtan efecto. \u00BFDesea que se reinicie la aplicaci\u00F3n?
PluginsManagementHandler.20=El plugin no est\u00E1 firmado o no est\u00E1 completamente firmado. Inst\u00E1lelo s\u00F3lo si conf\u00EDa en su origen.\n\u00BFDesea continuar con la instalaci\u00F3n?
PluginsManagementHandler.21=Plugin sin firmar
PluginsManagementHandler.22=La firma del plugin no es v\u00E1lida. Inst\u00E1lelo s\u00F3lo si conf\u00EDa en su origen.\n\u00BFDesea continuar con la instalaci\u00F3n?
PluginsManagementHandler.23=La firma del plugin contiene errores
PluginsManagementHandler.24=Ocurri\u00F3 un error durante la lectura del fichero de plugin.
PluginsManagementHandler.25=Certificado de firma

PluginConfigurationDialog.0=Aceptar
PluginConfigurationDialog.1=Cancelar

CertificateConfirmPanel.0=El plugin se encuentra firmado por:
CertificateConfirmPanel.1=Descargar certificado
CertificateConfirmPanel.2=Descargar certificado de %0
CertificateConfirmPanel.3=\u00BFDesea continuar con la instalaci\u00F3n?
CertificateConfirmPanel.4=Error al guardar el certificado
CertificateConfirmPanel.5=Error
CertificateConfirmPanel.6=Certificado
CertificateConfirmPanel.7=Guardar certificado
CertificateConfirmPanel.8=certificado_plugin.cer
CertificateConfirmPanel.9=caducado
CertificateConfirmPanel.10=Descargar certificado de %0 (caducado)

PermissionsDialog.0=Informaci\u00F3n del plugin
PermissionsDialog.1=Di\u00E1logo de informaci\u00F3n del plugin
PermissionsDialog.2=Permisos requeridos por el plugin
PermissionsDialog.3=Conceder permisos
PermissionsDialog.4=Cancelar

permission.INSTALL=Instalaci\u00F3n
permission.INSTALL.desc=Permiso para hacer cambios en el equipo durante la instalaci\u00F3n del plugin.
permission.UNINSTALL=Desinstalaci\u00F3n
permission.UNINSTALL.desc=Permiso para hacer cambios en el equipo durante la desinstalaci\u00F3n del plugin.
permission.RESET=Reinicio
permission.RESET.desc=Permiso para reiniciar la aplicaci\u00F3n.
permission.PRESIGN=Preprocesado
permission.PRESIGN.desc=Permiso para procesar los datos antes de las operaciones de firma. 
permission.POSTSIGN=Postprocesado
permission.POSTSIGN.desc=Permiso para procesar las firmas despu\u00E9s de su generaci\u00F3n.
permission.BUTTONS=Nuevos botones
permission.BUTTONS.desc=Permisos para agregar botones a la interfaz de la aplicaci\u00F3n.
permission.MENU=Nuevo men\u00FA
permission.MENU.desc=Permisos para agregar un men\u00FA a la interfaz de la aplicaci\u00F3n.
permission.COMMANDS=Nuevos comandos
permission.COMMANDS.desc=Permisos para agregar nuevos comandos ejecutables por l\u00EDnea de comandos.
permission.INLINE_PROCESS=Firma en l\u00EDnea
permission.INLINE_PROCESS.desc=Permisos para modificar el proceso de firma cuando se solicite desde el navegador.


# Cadenas de solicitud dinamica de datos al usuario
signingLts=La firma contiene sellos de archivo y quedar\u00E1 invalidada al agregar la nueva firma. \u00BFDesea continuar?
signingLtsPossible=La firma contiene sellos de archivo y podr\u00EDa quedar invalidada al agregar la nueva firma. \u00BFDesea continuar?
agePolicyIncompatibilitySign=La firma que desea generar no es compatible con la Pol\u00EDtica de firma de la AGE, ni ser\u00E1 validada por los sistemas de validaci\u00F3n de firma de la AGE.\n\u00BFDesea completar la operaci\u00F3n sin agregar la pol\u00EDtica de firma?
agePolicyIncompatibilityCosign=La firma que desea cofirmar no es compatible con la Pol\u00EDtica de firma de la AGE, ni ser\u00E1 validada por los sistemas de validaci\u00F3n de firma de la AGE.\n\u00BFDesea completar la operaci\u00F3n sin agregar la pol\u00EDtica de firma? 
agePolicyIncompatibilityCounterSign=La firma que desea contrafirmar no es compatible con la Pol\u00EDtica de firma de la AGE, ni ser\u00E1 validada por los sistemas de validaci\u00F3n de firma de la AGE.\n\u00BFDesea completar la operaci\u00F3n sin agregar la pol\u00EDtica de firma? 
signingCertifiedPdf=El PDF que desea firmar est\u00E1 certificado y no admite nuevas firmas. Agregar nuevas firmas invalidar\u00E1 la firma anterior.\n\u00BFDesea continuar?
signingPdfWithUnregisteredSigns=El PDF que desea firmar contiene firmas previas en un formato antiguo. Agregar nuevas firmas podr\u00EDa invalidar las ya existentes.\n\u00BFDesea continuar?
signingModifiedPdfForm=El documento PDF contiene un formulario del cual se han modificado los campos despu\u00E9s de haberse firmado.\n\u00BFDesea continuar?
pdfShadowAttackSuspect=El PDF es sospechoso de haber sido modificado tras la \u00FAltima firma. \u00BFDesea continuar?
pdfpasswordprotected=El PDF est\u00E1 protegido por contrase\u00F1a. Introduzca de la contrase\u00F1a del PDF.
pdfbadpassword=La contrase\u00F1a introducida es incorrecta. Introduzca de la contrase\u00F1a del PDF.
