CertificateInfo.0=Certificado gen\u00E9rico X.509v3
CertificateInfo.1=Titular del certificado
CertificateInfo.2=Emisor del certificado
CertificateInfo.3=Certificado X.509v3 generico
ClosePanel.0=No volver a mostrar este mensaje
DnieCertAnalyzer.0=de
DnieCertAnalyzer.2=Certificado de firma de DNIe
DnieCertAnalyzer.4=Certificado de DNI electr\u00F3nico
DNIePasswordCallback.1=Introduzca el PIN de su DNIe
DNIePasswordCallback.3=DNI electr\u00F3nico
DNIeWaitPanel.0=No deseo usar DNIe
DNIeWaitPanel.1=Si no desea usar DNI electr\u00F3nico pulse este bot\u00F3n o la tecla escape para poder seleccionar un certificado cualquiera desde el almac\u00E9n de claves y certificados del sistema operativo
DNIeWaitPanel.2=Bot\u00F3n de omisi\u00F3n de espera para inserci\u00F3n de DNIe
DNIeWaitPanel.3=Inserte su DNIe en el lector de tarjetas y pulse el bot\u00F3n "Continuar con DNIe"
DNIeWaitPanel.4=Continuar con DNIe
DNIeWaitPanel.5=Pulse este bot\u00F3n para usar su DNIe en las operaciones posteriores de firma
DNIeWaitPanel.6=Bot\u00F3n de confirmacion de uso de DNIe
MainMenu.0=Archivo
MainMenu.1=Men\u00FA con operaciones de apertura y firma de archivos
MainMenu.10=Men\u00FA con operaciones relacionadas con la ayuda de la aplicaci\u00F3n
MainMenu.11=Ayuda de "Firma f\u00E1cil con @firma"
MainMenu.12=Preferencias
MainMenu.13=Carga la ayuda de la aplicaci\u00F3n en una nueva ventana
MainMenu.14=<html><p align="center">"Firma f&aacute;cil con @firma" 1.3<br/>&copy; 2011-2014 Gobierno de Espa&ntilde;a</p><br/><p>Firma f\u00E1cil es Software Libre; puedes redistribuirlo y/o modificarlo bajo los t&eacute;rminos de al menos<br>una de estas dos licencias: <ul><li>La "GNU General Public License" tal como es publicada por la Free Software Foundation;<br>versi&oacute;n 2 de la Licencia, o (a su elecci&oacute;n) cualquier versi&oacute;n posterior.</li><li>La "European Software License"; versi&oacute;n 1.1 de la Licencia, o (a su elecci&oacute;n) cualquier<br>versi&oacute;n posterior.</li></ul><p>Versi&oacute;n de Java actualmente en uso: %0</p></html>
MainMenu.15=Acerca de "Firma f\u00E1cil con @firma"
MainMenu.16=Preferencias generales de la aplicaci\u00F3n
MainMenu.17=Muestra informaci\u00F3n adicional acerca de "Firma f\u00E1cil con @firma"
MainMenu.18=Opciones
MainMenu.19=Men\u00FA con las opciones configurables de la aplicaci\u00F3n
MainMenu.2=Abrir archivo
MainMenu.20=Idiomas
MainMenu.21=Listado de idiomas disponibles
MainMenu.22=Seleccione el idioma para la aplicaci\u00F3n
MainMenu.23=Preferencias de idioma
MainMenu.24=Preferencias de configuraci\u00F3n de firma electr\u00F3nica
MainMenu.3=Abre un fichero para permitir su posterior firma
MainMenu.4=Seleccione el fichero a firmar
MainMenu.5=Firmar archivo
MainMenu.6=Firma el fichero seleccionado para su firma
MainMenu.7=Salir
MainMenu.8=Cierra la aplicaci\u00F3n
MainMenu.9=Ayuda
PreferencesPanel.0=Aplicar ahora
PreferencesPanel.1=Incluir una copia de los datos firmados en la propia firma
PreferencesPanel.10=C\u00F3digo postal del lugar en el que se realiza la firma
PreferencesPanel.11=Ciudad en la que se realiza la firma
PreferencesPanel.12=Pa\u00EDs en el que se realiza la firma
PreferencesPanel.13=Cargo atribuido al firmante
PreferencesPanel.14=Cargo del firmante
PreferencesPanel.15=Formato de las firmas XAdES
PreferencesPanel.16=Opciones de firma
PreferencesPanel.17=Opciones generales de firma
PreferencesPanel.18=Algoritmo de firma
PreferencesPanel.19=Metadatos de las firmas PAdES
PreferencesPanel.2=General
PreferencesPanel.20=Raz\u00F3n por la que se firma el documento
PreferencesPanel.21=Ciudad en la que se realiza la firma
PreferencesPanel.22=Contacto del firmante (usualmente una direcci\u00F3n de correo electr\u00F3nico)
PreferencesPanel.23=Pol\u00EDtica de firma
PreferencesPanel.24=Ninguna pol\u00EDtica
PreferencesPanel.25=Pol\u00EDtica de firma de la AGE 1.8
PreferencesPanel.26=Pol\u00EDtica a medida
PreferencesPanel.CAdES.27=Identificador de la pol\u00EDtica (debe ser una OID)
PreferencesPanel.XAdES.27=Identificador de la pol\u00EDtica (debe ser una URI)
PreferencesPanel.PAdES.27=Identificador de la pol\u00EDtica (debe ser un OID)
PreferencesPanel.28=Huella digital del identificador de la pol\u00EDtica (en Base64)
PreferencesPanel.29=Algoritmo de la huella digital del identificador de la pol\u00EDtica
PreferencesPanel.3=Firmas PAdES (PDF)
PreferencesPanel.30=Calificador de la pol\u00EDtica (URL)
PreferencesPanel.31=Cancelar
PreferencesPanel.32=Cancela el establecimiento de preferencias descartando los cambios realizados desde la \u00FAltima vez que se guardaron
PreferencesPanel.33=Aceptar
PreferencesPanel.34=Guarda los valores establecidos para las preferencias y finaliza el proceso de establecimiento de estas cerrando la ventana
PreferencesPanel.35=Guarda los valores establecidos para las preferencias permitiendo continuar con el proceso de establecimiento de estas
PreferencesPanel.36=No pedir confirmaci\u00F3n al cerrar la aplicaci\u00F3n
PreferencesPanel.37=Preferencias generales
PreferencesPanel.38=Los datos de la política de firma CAdES son inválidos
PreferencesPanel.4=Firmas CAdES (binarias)
PreferencesPanel.40=Opciones generales de configuración
PreferencesPanel.41=Opciones de configuración para las firmas PAdES de documentos PDF
PreferencesPanel.42=Opciones de configuración para las firmas CAdES de ficheros binarios
PreferencesPanel.43=Opciones de configuración para las firmas XAdES de documentos XML
PreferencesPanel.44=Establece si debe omitirse la solicitud de confirmaci\u00F3n al usuario cuando se intente cerrar la aplicaci\u00F3n
PreferencesPanel.45=Establece si las firmas CAdES generadas deben ser impl\u00EDcitas
PreferencesPanel.46=Algoritmo que se utilizar\u00E1 en todas las firmas electr\u00F3nicas que permitan su configuraci\u00F3n
PreferencesPanel.47=Configuraci\u00F3n de pol\u00EDtica de firma para firmas XAdES
PreferencesPanel.48=Configuraci\u00F3n de pol&iacute;tica de firma para firmas PAdES
PreferencesPanel.49=Configuraci\u00F3n de pol&iacute;tica de firma para firmas CAdES
PreferencesPanel.5=Firmas XAdES (XML)
PreferencesPanel.50=Algoritmo utilizado para el c\u00E1lculo de la huella digital del identificador de la politica de firma para firmas XAdES
PreferencesPanel.51=Algoritmo utilizado para el c\u00E1lculo de la huella digital del identificador de la politica de firma para firmas CAdES
PreferencesPanel.52=Algoritmo utilizado para el c\u00E1lculo de la huella digital del identificador de la politica de firma para firmas PAdES
PreferencesPanel.53=Formato utilizado en la generaci\u00F3n de las firmas XAdES
PreferencesPanel.54=URI identificadora de la pol\u00EDtica de firma para firmas XAdES
PreferencesPanel.55=Huella digital del identificador de la pol\u00EDtica de firma para firmas XAdES
PreferencesPanel.56=URL calificadora de la pol\u00EDtica de firma para firmas XAdES
PreferencesPanel.57=OID identificador de la pol\u00EDtica de firma para firmas CAdES
PreferencesPanel.58=Huella digital del identificador de la pol\u00EDtica de firma para firmas CAdES
PreferencesPanel.59=URL calificadora de la pol\u00EDtica de firma para firmas CAdES
PreferencesPanel.6=Los datos de la pol\u00EDtica de firma XAdES son inv\u00E1lidos
PreferencesPanel.60=OID identificador de la pol\u00EDtica de firma para firmas PAdES
PreferencesPanel.61=Huella digital del identificador de la pol\u00EDtica de firma para firmas PAdES
PreferencesPanel.62=URL calificadora de la pol\u00EDtica de firma para firmas PAdES
PreferencesPanel.63=Raz\u00F3n de firma de los documentos PDF
PreferencesPanel.64=Ciudad en la que se realiza la firma PDF
PreferencesPanel.65=Informaci\u00F3n de contacto que se agrega a las firmas PDF. Com\u00FAnmente una direcci\u00F3n de correo electr\u00F3nico
PreferencesPanel.66=Ciudad en la que se realiza la firma XAdES
PreferencesPanel.67=Pa\u00EDs en la que se realiza la firma XAdES
PreferencesPanel.68=Cargo del firmante
PreferencesPanel.69=Formato b\u00E1sico de firma
PreferencesPanel.7=Los datos de la política de firma PAdES son inválidos
PreferencesPanel.70=Formato b\u00E1sico de las firmas PAdES
PreferencesPanel.71=PAdES B\u00E1sico
PreferencesPanel.72=PAdES-BES
PreferencesPanel.73=Pol\u00EDtica de firma de la AGE 1.9
PreferencesPanel.8=Metadatos de las firmas XAdES
PreferencesPanel.9=Provincia o regi\u00F3n en la que se realiza la firma
ShowFileLinkAction.1=Guardar datos
ShowFileLinkAction.2=No se ha podido abrir el fichero,\ncompruebe que dispone de una aplicaci\u00F3n instalada para visualizar ficheros
ShowFileLinkAction.3=No se ha podido guardar el fichero
ShowFileLinkAction.4=Error
SignDataPanel.0=Fichero de firma
SignDataPanel.1=Ruta del fichero de firma analizado
SignDataPanel.10=Fichero de tipo Factura Electr\u00F3nica (XML) firmada
SignDataPanel.11=No se ha podido comprobar la validez del certificado
SignDataPanel.12=Pulse en la descripci\u00F3n del certificado para obtener informaci\u00F3n adicional sobre \u00E9l o a\u00F1adirlo al almacen de certificados de su sistema operativo
SignDataPanel.13=Descripci\u00F3n del certificado
SignDataPanel.14=Informaci\u00F3n resumida del certificado, pulse sobre esta para abrir una nueva ventana con informaci\u00F3n adicional
SignDataPanel.15=Comprobar validez
SignDataPanel.16=Comprueba la validez del certificado contra el OCSP del su autoridad de certificaci\u00F3n
SignDataPanel.17=Bot\u00F3n para validar el certificado
SignDataPanel.18=Comprueba la validez del certificado contra el OCSP de su autoridad de certificaci&oacute;n
SignDataPanel.19=El certificado es v\u00E1lido
SignDataPanel.2=Fichero firmado:
SignDataPanel.20=Respuesta del servidor de validaci\u00F3n
SignDataPanel.21=Certificado de firma utilizado:
SignDataPanel.22=Datos de la firma:
SignDataPanel.23=No se ha podido abrir el fichero,\ncompruebe que dispone de una aplicaci\u00F3n instalada para visualizar Certificados X.509
SignDataPanel.24=Datos en memoria
SignDataPanel.25=Formato de firma
SignDataPanel.26=Datos firmados
SignDataPanel.27=La firma no contiene los datos firmados
SignDataPanel.28=Ver datos firmados
SignDataPanel.29=\u00C1rbol de firmas del documento
SignDataPanel.3=Ver fichero
SignDataPanel.30=Copiar la ruta del fichero
SignDataPanel.31=Firma electr\u00F3nica
SignDataPanel.32=El certificado est\u00E1 caducado
SignDataPanel.33=El certificado est\u00E1 revocado
SignDataPanel.34=El certificado aun no es v\u00E1lido
SignDataPanel.35=Autoridad de certificaci\u00F3n no soportada
SignDataPanel.36=El certificado est\u00E1 corrupto
SignDataPanel.37=El servicio de validaci\u00F3n devolvi\u00F3 un error
SignDataPanel.38=Se desconoce el estado del certificado
SignDataPanel.39=Estado de su certificado
SignDataPanel.4=Abre el fichero firmado con la aplicaci\u00F3n configurada en su sistema operativo
SignDataPanel.5=Bot\u00F3n para abrir los datos firmados
SignDataPanel.6=Abre el documento firmado con la aplicaci\u00F3n configurada en el sistema
SignDataPanel.7=No se ha podido abrir el fichero,\ncompruebe que no ha sido manipulado mientras se ejecutaba esta aplicaci\u00F3n\ny que dispone de una aplicaci\u00F3n instalada para visualizarlo
SignDataPanel.9=Fichero de tipo Portable Document Format (PDF)
SignDetailPanel.0=Firmar otro fichero
SignPanel.0=Fichero de tipo Portable Document Format (PDF)
SignPanel.1=El fichero es demasiado grande y no se puede firmar por falta de memoria
SignPanel.10=Documento XML
SignPanel.11=Documento binario gen\u00E9rico
SignPanel.12=Fichero binario gen\u00E9rico
SignPanel.13=Por favor, espere mientras se inicializa el almac\u00E9n de claves
SignPanel.14=Bienvenido a
SignPanel.15=Firmando electr\u00F3nicamente el fichero
SignPanel.16=A\u00F1adir firma
SignPanel.17=Fichero de tipo Factura-e (Factura Electr\u00F3nica)
SignPanel.18=Ha arrastrado varios ficheros a la vez, pero solo se soporta la firma individual de archivos.\nS\u00F3lo se firmar\u00E1 el primero
SignPanel.19=No se ha podido completar la selecci\u00F3n de certificados.
SignPanel.2=<p><b>Importante</b>: No inserte ni retire ninguna tarjeta del lector de tarjetas inteligentes hasta finalizar la ejecuci&oacute;n de este programa.</p></html>
SignPanel.20=Factura-e (Factura Electr\u00F3nica)
SignPanel.21=No se permite la firma de directorios,\n\u00FAnicamente de ficheros individuales.
SignPanel.22=Se intenta cargar una factura electr\u00F3nica ya firmada. No se permite agregar nuevas firmas a\r\nuna factura electr\u00F3nica. Se cancelar\u00E1 la operaci\u00F3n.
SignPanel.23=La contraseña proporcionada para firmar el PDF no es v\u00E1lida.
SignPanel.24=No se soporta la firma de ficheros remotos con esta aplicaci\u00F3n,\nseleccione un fichero local para firmarlo
SignPanel.26=El fichero es demasiado grande.\nSu sistema no puede firmar ficheros tan grandes por falta de memoria.
SignPanel.27=El PDF est\u00E1 certificado y no admite firmas electr\u00F3nicas adicionales.
SignPanel.28=El PDF contiene firmas previas en un formato antiguo que no permite agregar firmas adicionales.
SignPanel.3=El fichero seleccionado no existe, y por lo tanto no puede firmarse.
SignPanel.32=Seleccionar fichero a firmar
SignPanel.33=Pulse este bot\u00F3n o arrastre un fichero al \u00E1rea inferior para iniciar el proceso de selecci\u00F3n de fichero a firmar
SignPanel.34=Bot\u00F3n de selecci\u00F3n de fichero a firmar
SignPanel.35=Seleccione el fichero a firmar
SignPanel.36=No se ha podido leer el contenido del fichero a firmar,\ncompruebe que no esta abierto por otra aplicaci\u00F3n y\nsi est\u00E1 en almacenamiento extraible pruebe a expulsarlo\ne insertarlo de nuevo
SignPanel.39="Firma electr\u00F3nica f\u00E1cil con @Firma"
SignPanel.4=<p><b>Importante</b>: No inserte ni retire tarjetas de ninguno de los lectores de tarjetas inteligentes hasta finalizar la ejecuci&oacute;n de este programa.</p></html>
SignPanel.40=<html><p>En esta pantalla puede firmar electr&oacute;nicamente un fichero que se encuentre en su disco duro.<br>Cuando firma electr&oacute;nicamente un fichero pueden incorporarse a este ciertos datos personales, entre los que pueden encontrarse su n\u00FAmero de DNI, su nombre y apellidos o incluso informaci&oacute;n sobre su situaci&oacute;n laboral si utiliza un certificado profesional. Consulte las pol&iacute;ticas de seguridad y protecci&oacute;n de datos de los receptores de los ficheros firmados antes de enviarlos o distribuirlos.</p><br>
SignPanel.41=Pulse el bot\u00F3n o arrastre un fichero en este \u00E1rea
SignPanel.42=Arrastre un fichero a este \u00E1rea para seleccionarlo y poder firmarlo electr\u00F3nicamente
SignPanel.43=Panel de arrastre de fichero
SignPanel.45=Firmar fichero
SignPanel.46=Tipo de fichero: 
SignPanel.47=Fecha \u00FAltima modificaci\u00F3n: 
SignPanel.49=Tama\u00F1o: 
SignPanel.5=El fichero seleccionado est\u00E1 vac\u00EDo.\nNo es posible firmar ficheros vac\u00EDos.
SignPanel.51=Ver Fichero
SignPanel.53=No se ha podido abrir el fichero.\nCompruebe que dispone de una aplicaci\u00F3n instalada para ver este tipo de ficheros\ny que este no ha sido manipulado mientras se ejecutaba esta aplicaci\u00F3n
SignPanel.55=No se ha encontrado ning\u00FAn certificado para firmar,\nCompruebe su almac\u00E9n de claves e importe uno si es necesario
SignPanel.56=Se encontr\u00F3 un error durante la operaci\u00F3n con el certificado seleccionado.
SignPanel.6=Fichero de firma 
SignPanel.65=Ocurri\u00F3 un problema durante el proceso de firma, pruebe a reintentar\nla firma reiniciando la aplicaci\u00F3n
SignPanel.7=No se tienen permisos de lectura para el fichero seleccionado.\nSeleccione otro fichero o habilite los permisos de lectura para este.
SignPanel.72=Documentos Adobe PDF (*.pdf)
SignPanel.76=Firmas XML (*.xml, *.xsig)
SignPanel.8=Fichero de tipo XML
SignPanel.80=Firmas binarias (*.csig, *.p7s)
SignPanel.81=Guardar fichero firmado
SignPanel.84=Ya existe un fichero con ese nombre,\n\u00BFDesea sobreescribirlo?
SignPanel.88=No se ha podido guardar el resultado de la firma, asegures\u00E9 de\nque el fichero seleccionado no est\u00E1 abierto por otra aplicaci\u00F3n y\nde que cuenta con los permisos adecuados y reintente la operaci\u00F3n
SignPanel.89=No se ha podido guardar los datos, asegures\u00E9 de\nque el fichero seleccionado no est\u00E1 abierto por otra aplicaci\u00F3n y\nde que cuenta con los permisos adecuados y reintente la operaci\u00F3n
SignPanel.9=Documento Adobe PDF
SignResultPanel.0=No ha sido posible recuperar la informaci\u00F3n adicional,\npruebe a abrir la siguiente URL desde un navegador Web:\n
SignResultPanel.10=La firma electr\u00F3nica es v\u00E1lida en cuanto a estructura
SignResultPanel.11=No se ha podido completar la validaci\u00F3n
SignResultPanel.12=Ha ocurrido un error que ha impedido la validaci\u00F3n de la firma electr\u00F3nica.
SignResultPanel.13=Se desconoce la validez de la firma
SignResultPanel.14=Firma electr\u00F3nica corrupta.
SignResultPanel.15=No se dispone de los datos originales para la validaci\u00F3n de la firma electr\u00F3nica.
SignResultPanel.16=Alguno de los certificados de firma est\u00E1 caducado.
SignResultPanel.17=Alguno de los certificados de firma aun no es v\u00E1lido.
SignResultPanel.18=No se ha podido extraer el certificado de firma o \u00E9ste est\u00E1 corrupto.
SignResultPanel.19=La firma no se corresponde con los datos contenidos en la misma o indicados de forma externa.
SignResultPanel.2=Proceso de firma completado satisfactoriamente
SignResultPanel.21=Ha ocurrido un problema procesando las listas de certificados revocados.
SignResultPanel.20=Se detect\u00F3 un error en las CRL de la firma.
SignResultPanel.22=Se ha encontrado un algoritmo no reconocido o no soportado.
SignResultPanel.23.0=http://www.atos.net/
SignResultPanel.24=Compruebe la validez de la firma en su aplicaci&oacute;n de lectura de PDF.
SignResultPanel.3=<html><p>La firma es correcta en cuanto a estructura, pero para determinar su completa validez legal debe comprobar adem\u00E1s la validez de los certificados usados. Para ello, puede validar esta u otras firmas electr\u00F3nicas en: <a href="https://valide.redsara.es">https://valide.redsara.es/</a>.</p></html>
SignResultPanel.4=Se ha generado correctamente una firma electr\u00F3nica
SignResultPanel.5=La firma no es v\u00E1lida o no est\u00E1 soportada
SignResultPanel.6=La firma electr\u00F3nica seleccionada no es v\u00E1lida o no es compatible con @firma.
SignResultPanel.8=Firma electr\u00F3nica v\u00E1lida
SignResultPanel.9=<html><p>La firma es correcta en cuanto a estructura, pero para determinar su completa validez legal debe comprobar adem\u00E1s la validez de los certificados usados.<br>Adicionalmente, puede validar esta u otras firmas electr\u00F3nicas en: <a href="https://valide.redsara.es/">https://valide.redsara.es/</a>.</p></html>
SimpleAfirma.0=No se ha podido leer el contenido del fichero a firmar,\ncompruebe que no esta abierto por otra aplicaci\u00F3n y\nsi est\u00E1 en almacenamiento extraible pruebe a expulsarlo\ne insertarlo de nuevo
SimpleAfirma.10=Firma electr\u00F3nica f\u00E1cil con @firma
SimpleAfirma.2=El fichero no existe o no es accesible para lectura
SimpleAfirma.3=La aplicaci\u00F3n ya se est\u00E1 ejecutando en otra ventana.\n\u00DAnicamente se permite una instancia activa.
SimpleAfirma.42=No se ha podido inicializar ni su DNIe ni el almac\u00E9n de claves de su sistema operativo.\nSe cerrar\u00E1 la aplicaci\u00F3n
SimpleAfirma.47=\u00BFDesea cerrar la aplicaci\u00F3n de firma?
SimpleAfirma.48=Advertencia
SimpleAfirma.5=Est\u00E1 usando una versi\u00F3n de Java de 64 bits demasiado antigua,\npor favor, actualice a la \u00FAltima versi\u00F3n o use un Java de 32 bits.
SimpleAfirma.6=No se ha podido inicializar el almacen de claves.\nSe cerrar\u00E1 la aplicaci\u00F3n.
SimpleAfirma.7=Error
SimpleAfirma.9=No se ha podido inicializar ni su DNIe ni el almac\u00E9n de claves de su sistema operativo.\nSe cerrar\u00E1 la aplicaci\u00F3n
SimpleKeyStoreManager.0=Introduzca la contrase\u00F1a maestra de Mozilla Firefox
SimpleKeyStoreManager.1=No se ha detectado un DNIe insertado \u00BFDesea reintentar?
SimpleKeyStoreManager.2=No hay tarjeta en el lector
SimpleKeyStoreManager.3=La tarjeta detectada en el lector no es un DNIe.\nPor favor, ret\u00EDrela e inserte un DNIe.
SimpleKeyStoreManager.4=Detectada tarjeta incorrecta
SimpleKeyStoreManager.5=Su DNIe est\u00E1 da\u00F1ado, debe acudir a una comisar\u00EDa de polic\u00EDa para renovarlo.\nSe continuar\u00E1 con el almac\u00E9n por defecto del sistema.
SimpleKeyStoreManager.6=Detectado DNIe da\u00F1ado
SimpleKeyStoreManager.7=No ha sido posible inicializar su DNIe.\nSe continuar\u00E1 con el almac\u00E9n por defecto del sistema.
SimpleKeyStoreManager.8=Error en la iniciaizaci\u00F3n del DNIe
VisorFirma.0=Visor de firmas electr\u00F3nicas CAdES y XAdES
VisorFirma.1=Abrir
VisorPanel.0=Cerrar visor
VisorPanel.1=Ver otra firma
