<!DOCTYPE html>
<html>
 <head>
  <title>Configuraci&oacute;n de <i>proxy</i></title>
  <meta http-equiv="Content-type" content="text/html;charset=UTF-8">
  <meta name="KEYWORDS" content="preferencias, configurar, proxy, red">
  <meta name="description" content="Men&uacute; preferencias.">
 </head>
 <body> 
  <h2>Configuraci&oacute;n de <i>proxy</i></h2>
  <p>
    Autofirma debe acceder a Internet por distintos motivos y, de ser necesario, se deber&aacute;
    configurar un <i>proxy</i> de red para permit&iacute;rselo. Los prop&oacute;sitos para los que
    Autofirma puede requerir el acceso a la red son:
  </p>
  <ul>
  	 <li>Comunicarse con las p&aacute;ginas web en las que se realizan tr&aacute;mites de firma.</li>
     <li>Buscar actualizaciones (S&oacute;lo si se encuentra habilitada la opci&oacute;n).</li>
     <li>Enviar estad&iacute;sticas (S&oacute;lo si se encuentra habilitada la opci&oacute;n).</li>
  </ul>
  <p>
    Todas las conexi&oacute;nes de red realizadas por Autofirma aplicar&aacute;n la configuraci&oacute;n
    de <i>proxy</i> aqu&iacute; establecida.</p>
  <p>
  <p align="center">
  	<img src="../gfx/menugproxy_mini.png" alt="Pantalla para la configuraci&oacute;n del proxy de red">
  </p>
  Las opciones de configuraci&oacute;n de <i>proxy</i> son:
  </p>
  <ul>
  	 <li><b>Sin proxy:</b> Las conexiones de red se har&aacute;n de forma directa.</li>
     <li><b>Configuración de proxy del sistema:</b> La aplicaci&oacute;n identificar&aacute; la
     configuraci&oacute;n que debe aplicar para cada URL seg&uacute;n la configuraci&oacute;n
     establecida en el sistema operativo y/o navegador. Esta configuraci&oacute;n puede no ser
     exactamente igual a la establecida en Windows.</li>
     <li><b>Configuraci&oacute;n manual de proxy:</b> Permite establecer la configuraci&oacute;n
     espec&iacute;fica de proxy a utilizar. Las opciones configurables son:</li>
       <ul>
       	 <li><b>Host:</b> Nombre de dominio o IP del proxy.</li>
       	 <li><b>Puerto:</b> N&uacute;mero de puerto de acceso al proxy.</li>
       	 <li><b>Usuario:</b> Nombre de usuario a utilizar cuando el proxy requiera autenticaci&oacute;n. Opcional.</li>
       	 <li><b>Contraseña:</b> Contrase&ntilde;a de usuario a utilizar cuando el proxy requiera autenticaci&oacute;n. Opcional.</li>
       	 <li><b>No usar proxy para las siguientes direcciones IP y direcciones de dominio:</b> Listado de direcciones IP
       	 y nombres de dominio a los que se debe acceder de forma directa (sin pasar por el proxy configurado manualmente).
       	 Com&uacute;nmente, se configurar&aacute;n aqu&iacute; las direcciones de la intranet en la que se trabaje cuando se realicen
       	 operaciones de firma desde aplicaciones web situadas tanto dentro como fuera de su intranet.<br>
       	 Las direcciones se escribir&aacute;n separadas por comas (,) y se pueden escribir asteriscos (*) al principio o final
       	 de cada una a modo de comod&iacute;n para identificar subdominios o subredes completas. Opcional.</li>
       </ul>
       <p>Adicionalmente, se proporcionan los siguientes opciones:</p>
       <ul>
         <li><b>Autodetectar:</b> Extrae de la configuraci&oacute;n del sistema el host y el puerto a utilizar para una
         direcci&oacute;n gen&eacute;rica.</li>
         <li><b>Verificar conexi&oacute;n:</b> Comprueba la configuraci&oacute;n manual de proxy para el acceso a una
         direcci&oacute;n gen&eacute;rica.</li>
       </ul>
  </ul>
  <p>La configuraci&oacute;n establecida se aplicar&aacute; al pulsar sobre el bot&oacute;n <b>OK</b>. Si se pulsa el bot&oacute;n
  <b>Cancelar</b>, se cerrar&aacute; la ventana sin aplicar la configuraci&oacute;n.</p>
  <p>
 </body>
</html>