<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
 <head>
  <title>Firmas visibles PDF</title>
  <meta name="AppleTitle" content="Ayuda de AutoFirma">
  <meta name="AppleIcon" content="AutoFirmaHelpIcon.png">
  <meta http-equiv="Content-type" content="text/html;charset=UTF-8">
 </head>
 <body>
  <h2>Firmas visibles PDF</h2>
  <p>Al habilitar la creaci&oacute;n de firmas visibles PDF en el <a href="MenuPreferencias.html">Men&uacute;n de
  preferencias</a> de la aplicaci&oacute;n, se dar&aacute; al usuario la posibilidad de seleccionar un &aacute;rea
  de firma cada vez que se realice una firma PDF.</p>
  <p align="center">
   <img src="../gfx/menufirmaspadesvisible_mini.png" alt="Ventana de selecci&oacute;n de posici&oacute;n de firma">
  </p>
  <p>
  Este menu permite utilizar el rat&oacute;n para seleccionar un área rectanguar de una de las p&aacute;ginas del
  PDF.
  </p>
  <ul>
  	<li>X: Número de pixeles en el eje X en la que se encuentra el cursor del ratón con respecto a la imagen
  	escalada de la p&aacute;gina del PDF.</li>
  	<li>Y: Número de pixeles en el eje Y en la que se encuentra el cursor del ratón con respecto a la imagen
  	escalada de la p&aacute;gina del PDF.</li>
  	<li>(Previsualizaci&oacute;n de la p&aacute;gina del PDF): El usuario debe hacer clic sostenido y arrastrar
  	el rat&oacute;n sobre este &aacute;rea para seleccionar el &aacute;rea visible de firma.</li>
  	<li>&lt;&lt;: Bot&oacute;n para desplazar la visualizaci&oacute;n a la primera p&aacute;gina del PDF.</li>
  	<li>&lt;: Bot&oacute;n para desplazar la visualizaci&oacute;n a la p&aacute;gina anterior del PDF. Puede
  	reproducirse este comportamiento pulsando la tecla "cursor izquierdo" de su teclado.</li>
  	<li>&gt;: Bot&oacute;n para desplazar la visualizaci&oacute;n a la siguiente p&aacute;gina del PDF. Puede
  	reproducirse este comportamiento pulsando la tecla "cursor derecho" de su teclado.</li>
  	<li>&gt;&gt;: Bot&oacute;n para desplazar la visualizaci&oacute;n a la &uacute;ltima p&aacute;gina del PDF.</li>
  </ul>
  <p>
  El &aacute;rea de firma desaparecera al cambiar de pantalla del PDF. Seleccione el &aacute;re para la firma visible
  del PDF y a continuaci&oacute;n, pulse el bot&oacute;n "Aceptar". 
  </p>
  <p>
  Si no se desea agregar una firma visible al PDF en cuesti&oacute;n, pulse el bot&oacute;n "Cancelar" o cierre
  la ventana para continuar con el proceso normal y firmar el PDF sin agregar un &aacute;rea visible de firma. 
  </p>
 </body>
</html>