<html>
<head>
	<title>Desensobrado digital</title>
</head>
<body>
<h2><a name="_Toc275937517">Desensobrado digital</a></h2>

<p>Desde la ventana de "Desensobrado" es posible extraer el fichero contenido en un sobre digital. Para ello s&oacute;lo ser&aacute; necesario 
seleccionar uno de los certificados designados como destinatarios del sobre.</p>

<p align="center">
	<img src="images/image078.png" width="650" height="370"/>
</p>

<p>Las opciones de configuraci&oacute;n en esta pantalla son:</p>

<ul>
	<li><a name="desensobrado.sobre">Sobre digital:</a></li>
	<ul type="circle">
		<li>Permite seleccionar el sobre digital. Es posible pulsar el bot&oacute;n "Examinar" para buscar un fichero en disco o escribir 
		directamente su ruta en la caja de texto asociada.</li>
		<li>Tecla de acceso r&aacute;pido: o</li>
	</ul><br/>
	<li><a name="desensobrado.almacen">Almac&eacute;n / repositorio de certificados:</a></li>
	<ul type="circle">
		<li>Permite seleccionar el almac&eacute;n en donde se encuentra el certificado del destinatario del sobre. Las opciones 
		disponibles son:</li>
		<ul type="square">
			<li>Windows / Internet Explorer: Para tomar el certificado del almac&eacute;n de Windows o un dispositivo externo (por ejemplo, 
			el DNIe) instalado en el sistema.</li>
			<li>Mozilla Firefox (unificado): Para tomar el certificado del almac&eacute;n de Firefox o un dispositivo externo (por ejemplo, 
			el DNIe) configurado en este almac&eacute;n.</li>
			<li>PKCS#12 / PFX: Para tomar el certificado de un almac&eacute;n en disco en formato P12 o PFX.</li>
		</ul>
		<li>Tecla de acceso r&aacute;pido: a</li>
	</ul><br/>
	<li><a name="desensobrado.iniciar">Opciones de apertura de sobre digital:</a></li>
	<ul type="circle">
		<li> Iniciar contenido del sobre tras la apertura: Si se marcar esta casilla, una vez extra&iacute;do el contenido del sobre se abrir&aacute; 
		con la aplicaci&oacute;n por defecto para la extensi&oacute;n de fichero con el que se almacenes.:</li>
		<li>Tecla de acceso r&aacute;pido: r</li>
	</ul>
</ul>

<p>Al pulsar el icono de ayuda se muestra la ventana de ayuda para el men&uacute; "Desensobrado".</p>
<ul>
	<li>Tecla de acceso r&aacute;pido para el bot&oacute;n de Ayuda: h</li>
</ul>

<p>Al pulsar el bot&oacute;n "Extraer" se mostrar&aacute; un di&aacute;logo modal con los certificados del repositorio seleccionado. El usuario deber&aacute; 
seleccionar el certificado de uno de los destinatarios del sobre. Si el certificado no perteneciese a uno de los destinatarios o se
produjese un error durante la extracci&oacute;n del contenido del sobre, se notificar&aacute;; mientras que, si el proceso finaliza correctamente, 
se mostrar&aacute; un di&aacute;logo para el guardado del documento extra&iacute;do del sobre. Una vez extra&iacute;do el documento, este se abrir&aacute; si se 
marc&oacute; la casilla "Iniciar contenido del sobre tras la apertura".</p>
<ul>
	<li>Tecla de acceso r&aacute;pido para el bot&oacute;n "Extraer": x</li>
</ul>

</body>
</html>