<html>
<head>
	<title>A&ntilde;adir remitentes</title>
</head>
<body>
<h3>A&ntilde;adir remitentes</h3>

<p>Si se ha marcado en la ventana de de "Ensobrado" el checkbox "A&ntilde;adir nuevos remitentes al sobre", al pulsar el bot&oacute;n "Generar" se muestra 
el asistente para a&ntilde;adir nuevos remitentes al sobre seleccionado en la ventana de de "Ensobrado".</p>

<p align="center">
	<img src="images/image072.png" width="670" height="585"/>
</p>

<p>Al pulsar el bot&oacute;n "Siguiente &gt;" pasaremos al paso para a&ntilde;adir un remitente al sobre electr&oacute;nico.</p>

<p align="center">
	<img src="images/image076.png" width="670" height="585"/>
</p>

<p>Las opciones disponibles en esta pantalla son:</p>
<ul>
	<li><a name="ensobrado.wizard.repositorio.remitente">A&ntilde;adir remitente desde el repositorio / almac&eacute;n de certificados.</a></li>
	<ul type="circle">
		<li>Este listado contiene los posibles almacenes que pueden contener el certificado de quien genera el sobre digital. Los 
		almacenes concretos disponibles son:</li>
		<ul type="square">
			<li>Windows / Internet Explorer: Para tomar el certificado del almac&eacute;n de Windows o un dispositivo externo (por ejemplo, 
			el DNIe) instalado en el sistema.</li>
			<li>Mozilla Firefox (unificado): Para tomar el certificado del almac&eacute;n de Firefox o un dispositivo externo (por ejemplo, 
			el DNIe) configurado en este almac&eacute;n.</li>
			<li>PKCS#12 / PFX: Para tomar el certificado de un almac&eacute;n en disco en formato P12 o PFX.</li>
		</ul>
	</ul><br/>
	<li>A&ntilde;adir</li>
	<ul type="circle">
		<li>Abre un di&aacute;logo para la selecci&oacute;n de un certificado del almac&eacute;n seleccionado. Si el almac&eacute;n est&aacute; protegido con contrase&ntilde;a 
		ser&aacute; necesario introducirla. Al seleccionar un certificado, este se agrega al listado de remitentes. Actualmente la Interfaz 
		de Escritorio del Cliente @firma s&oacute;lo soporta la configuraci&oacute;n de un remitente para el sobre electr&oacute;nico.</li>
	</ul><br/>
	<li>Eliminar remitente</li>
	<ul type="circle">
		<li>Permite eliminar el remitente seleccionado de la lista de remitentes.</li>
	</ul>
</ul>

<p>Al pulsar el bot&oacute;n "Siguiente &gt;" se lleva a cabo el proceso de a&ntilde;adir el remitente al sobre electr&oacute;nico. Si ocurriese un error durante 
el proceso, se mostrar&aacute; el mensaje correspondiente, y si finaliza el proceso correctamente se nos mostrar&aacute; un di&aacute;logo para almacenar 
el sobre electr&oacute;nico generado.</p>

</body>
</html>