<html>
<head>
	<title>Firma electr&oacute;nica</title>
</head>
<body>

<h2><a name="_Toc275937503">Firma electr&oacute;nica</a></h2>

<p>Desde la ventana de "<i>Firma</i>" es posible realizar firmas electr&oacute;nicas sobre un documento local o remoto en diversos formatos.</p>

<p align="center">
	<img src="images/image014.png" width="650" height="370"/>
</p>

<p>Las opciones disponibles son:</p>
<ul>
	<li><a name="firma.fichero">Fichero a firmar digitalmente:</a></li>
	<ul type="circle">
		<li>Permite seleccionar el fichero que se desea firmar. Es posible pulsar el bot&oacute;n "Examinar" para buscar un fichero en disco o 
		escribir directamente su ruta (local o remota) en la caja de texto asociada.</li>
		<li>Tecla de acceso r&aacute;pido: g</li>
		<li>Tecla de acceso r&aacute;pido al bot&oacute;n Examinar: e</li>
	</ul><br/>
	<li><a name="firma.almacen">Almac&eacute;n certificados:</a></li>
	<ul type="circle">
		<li>Permite seleccionar el almac&eacute;n en donde se encuentra el certificado que deseamos utilizar para realizar la firma. Las opciones 
		disponibles son:</li>
		<ul type="square">
			<li>Windows / Internet Explorer: Para tomar el certificado del almac&eacute;n de Windows o un dispositivo externo (por ejemplo, el DNIe) 
			instalado en el sistema.</li>
			<li>Mozilla Firefox (unificado): Para tomar el certificado del almac&eacute;n de Firefox o un dispositivo externo (por ejemplo, el DNIe) 
			configurado en este almac&eacute;n.</li>
			<li>PKCS#12 / PFX: Para tomar el certificado de un almac&eacute;n en disco en formato P12 o PFX.</li>
		</ul>
		<li>Tecla de acceso r&aacute;pido: a</li>
	</ul><br/>
	<li><a name="firma.formato">Formato:</a></li>
	<ul type="circle">
		<li>Permite seleccionar el formato de firma electr&oacute;nica. Los formatos disponibles son:</li>
		<ul type="square">
			<li>Firma est&aacute;ndar (XAdES Detached): Principal formato de firma avanzada XML utilizado en la Administraci&oacute;n P&uacute;blica.</li>
			<li>XAdES enveloping: S&oacute;lo disponible en la vista avanzada. Formato de firma avanzada XML.</li>
			<li>XAdES enveloped: S&oacute;lo disponible en la vista avanzada. Formato de firma avanzada XML. S&oacute;lo permite firmar ficheros XML.</li>
			<li>CAdES: Formato de firma avanzada binaria. Permite decidir si se deben incluir los datos firmados dentro del fichero de firma.</li>
			<li>PAdES: Formato de firma avanzada para documentos PDF. S&oacute;lo permite firmar este tipo de documentos.</li>
		</ul>
		<li>Tecla de acceso r&aacute;pido: o</li>
	</ul>
</ul>

<p>Al pulsar el icono de ayuda se muestra la ventana de ayuda para el men&uacute; "Firma".</p>
<ul>
	<li>Tecla de acceso r&aacute;pido para el bot&oacute;n de Ayuda: h</li>
</ul>

<p>Para ejecutar la operaci&oacute;n pulse el bot&oacute;n "Firmar". A continuaci&oacute;n se le mostrar&aacute; un di&aacute;logo modal para la selecci&oacute;n del certificado que 
desea utilizar para la firma.</p>

<p>Si la operaci&oacute;n finaliz&oacute; correctamente, se le mostrar&aacute; un di&aacute;logo para el guardado de la firma electr&oacute;nica generada.</p>

<p>Tenga en cuenta que si el almac&eacute;n de certificados seleccionado est&aacute; protegido con contrase&ntilde;a, se le solicitar&aacute; esta antes de poder 
acceder al listado de certificados.</p>

<p align="center">
	<img src="images/image016.png" width="505" height="210"/>
</p>

<p>Todas las firmas generadas a trav&eacute;s de esta interfaz incluyen los datos firmados dentro del fichero de firma (firma impl&iacute;cita), 
a excepci&oacute;n de la firmas en formato CAdES en donde se da a elegir esta caracter&iacute;stica a trav&eacute;s del di&aacute;logo:</p>

<p align="center">
	<img src="images/image018.png" width="505" height="210"/>
</p>

<ul>
	<li>Tecla de acceso r&aacute;pido para el bot&oacute;n "Firmar": r</li>
</ul>


</body>
</html>