<html>
<head>
	<title>Multifirma Masiva</title>
</head>
<body>
<h2><a name="_Toc275937507">Multifirma Masiva</a></h2>

<p>Desde la ventana de <i>"Firma masiva"</i> es posible realizar firmas y multifirmas en bloque. Esto implica ordenar 
una operaci&oacute;n de firma que afectar&aacute; a m&uacute;ltiples ficheros y generar&aacute; un nuevo fichero de firma para cada uno de ellos.</p>

<p>Esta opci&oacute;n s&oacute;lo est&aacute; disponible en el modo de vista avanzada.</p>

<p><b>IMPORTANTE:</b> El DNIe exige que el usuario acepte individualmente toda y cada una de las firmas individuales del
proceso de firma masiva.</p>

<p align="center">
	<img src="images/image032.png" width="650" height="370"/>
</p>

<p>Las opciones que se muestran en esta pantalla son:</p>

<ul>
	<li><a name="multifirma.masiva.almacen">Alm&aacute;cen de certificados.</a></li>
	<ul type="circle">
		<li>Permite seleccionar el almac&eacute;n en donde se encuentra el certificado que deseamos utilizar para realizar la 
		firma. Las opciones disponibles son:</li>
		<ul type="square">
			<li>Windows / Internet Explorer: Para tomar el certificado del almac&eacute;n de Windows o un dispositivo externo 
			(por ejemplo, el DNIe) instalado en el sistema.</li>
			<li>Mozilla Firefox (unificado): Para tomar el certificado del almac&eacute;n de Firefox o un dispositivo externo 
			(por ejemplo, el DNIe) configurado en este almac&eacute;n.</li>
			<li>PKCS#12 / PFX: Para tomar el certificado de un almac&eacute;n en disco en formato P12 o PFX.</li>
		</ul>
		<li>Tecla de acceso r&aacute;pido: a</li>
	</ul><br/>
	<li><a name="multifirma.masiva.alerta">Opciones de la firma por lotes.</a></li>
	<ul type="circle">
		<li>Alerta sonora al finalizar el proceso: Utiliza el beep del sistema para emitir un sonido una vez finaliza el 
		proceso de firma masiva.</li>
		<li>Tecla de acceso r&aacute;pido: l</li>
	</ul><br/>
</ul>

<p>Al pulsar el icono de ayuda se muestra la ventana de ayuda para el men&uacute; "Firma Masiva".</p>
<ul>
	<li>Tecla de acceso r&aacute;pido para el bot&oacute;n de Ayuda: h</li>
</ul>

<p>Al pulsar el bot&oacute;n "Firmar" se abrir&aacute; el asistente para finalizar la configuraci&oacute;n de la operaci&oacute;n de multifirma masiva.</p>
<ul>
	<li>Tecla de acceso r&aacute;pido para el bot&oacute;n "Firmar": r</li>
</ul>

<p align="center">
	<img src="images/image034.png" width="670" height="585"/>
</p>

<p>Al pulsa el bot&oacute;n "Siguiente &gt;", nos aparece una nueva ventana donde se nos explica el proceso seg&uacute;n la operaci&oacute;n 
de firma seleccionada y se nos permite configurar tanto esta como el formato de firma.</p>

<p align="center">
	<img src="images/image036.png" width="670" height="585"/>
</p>

<p>Las opciones de configuraci&oacute;n son:</p>
<ul>
	<li><a name="multifirma.masiva.wizard.operacion">Operaci&oacute;n predeterminada:</a></li>
	<ul type="circle">
		<li><b>Firma:</b> Firma cada uno de los ficheros del lote usando el formato de firma seleccionado.</li>
		<ul>
			<li>Tecla de acceso r&aacute;pido: f</li>
		</ul>
		<li><b>Cofirma:</b> Cofirma todos los ficheros de firma del lote y firmar&aacute; con el formato seleccionado todos 
		aquellos que no sean.</li>
		<ul>
			<li>Tecla de acceso r&aacute;pido: o</li>
		</ul>
		<li><b>Contrafirma:</b> Contrafirmar&aacute; todos los ficheros de firma del lote.</li>
		<ul>
			<li>Tecla de acceso r&aacute;pido: n</li>
		</ul>
	</ul>
	<li><a name="multifirma.masiva.wizard.formato"><b>Formato:</b></a>
	Formato de firma utilizado cuando se solicita la operaci&oacute;n de firma, o cuando se 
	solicita la operaci&oacute;n de cofirma y se encuentran documentos de datos.</li>
	<ul>
		<li>Tecla de acceso r&aacute;pido: t</li>
	</ul>
	<li><b><a name="multifirma.masiva.wizard.formato.modo">Incluir los documentos en las firmas:</a></b> Selecciona el modo en el que se va a firmar un documento cuando se selecciona el formato CAdES.</li>
	<ul>
		<li>Tecla de acceso r&aacute;pido: i</li>
	</ul>
		
	</ul>
</ul>

<p>Cuando se pulsa el bot&oacute;n "Siguiente &gt;" nos desplazamos a una nueva pantalla del asistente. Desde esta nos es posible
establecer configuraciones adicionales sobre el formato de firma y los nodos que deben contrafirmarse. Si se seleccion&oacute; la 
operaci&oacute;n de firma, no se mostrar&aacute; la pantalla mostrada a continuaci&oacute;n, sino la siguiente, y si se seleccion&oacute; la operaci&oacute;n 
de cofirma no se mostrar&aacute;n las opciones para la configuraci&oacute;n de la contrafirma s&oacute;lo parecer&aacute; cuando se seleccione esta
operaci&oacute;n.</p>

<p align="center">
	<img src="images/image038.png" width="670" height="585"/>
</p>

<p>Las opciones configurables en esta pantalla son:</p>
<ul>
	<li><a name="multifirma.masiva.wizard.contrafirma.respetar">Respetar el formato de firma</a></li>
	<ul type="circle">
		<li>Si no se activa esta casilla, se considerar&aacute; que cualquier fichero del lote no acorde al formato de firma indicado 
		en el paso anterior es un fichero de datos. En caso de marcarla y cuando la operaci&oacute;n seleccionada sea cofirma o 
		contrafirma, se comprobar&aacute; para cada fichero del lote si es un formato de firma soportado y, en caso de serlo, se 
		multifirmar&aacute; en el formato correspondiente.</li>
		<li>Tecla de acceso r&aacute;pido: r</li>
	</ul><br/>
	<li><a name="multifirma.masiva.wizard.contrafirma.opciones">Opciones de contrafirma:</a></li>
	<ul type="circle">
		<li>Nos permite indicar que firmas del fichero deben contrafirmarse. Las opciones son:</li>
		<ul type="square">
			<li>Contrafirmar todas las firmas: Agrega una contrafirma a cada firma del fichero.</li>
			<ul>
				<li>Tecla de acceso r&aacute;pido: o</li>
			</ul>
			<li>Contrafirmar &uacute;nicamente los &uacute;ltimos firmantes: Agrega una contrafirma a todas aquellas firmas que no tuvieran 
			una previamente.</li>
			<ul>
				<li>Tecla de acceso r&aacute;pido: n</li>
			</ul>
		</ul>
	</ul>
</ul>

<p>Al pulsar el bot&oacute;n "Siguiente &gt;" accederemos a una nueva ventana desde la que podemos configurar los ficheros que pertenecer&aacute;n 
al lote de firma.</p>

<p align="center">
	<img src="images/image040.png" width="670" height="585"/>
</p>

<p>Las opciones de configuraci&oacute;n son:</p>
<ul>
	<li><a name="multifirma.masiva.wizard.firma.directorios">Directorio con los ficheros de datos.</a></li>
	<ul type="circle">
		<li>Aqu&iacute; podemos indicar el directorio en donde se encuentran los ficheros con los que queremos operar. Podemos introducir la ruta 
		en la caja de texto correspondiente o pulsar el bot&oacute;n "Examinar" para buscar el directorio en el sistema del usuario.</li>
		<li>Tecla de acceso r&aacute;pido: d</li>
		<li>Tecla de acceso r&aacute;pido al bot&oacute;n Examinar: e</li>
	</ul><br/>
	<li><a name="multifirma.masiva.wizard.firma.incluir">Incluir subdirectorios de forma recursiva.</a></li>
	<ul type="circle">
		<li>Al seleccionar esta casilla se incluir&aacute;n en el lote de firma todos los ficheros de los subdirectorios de aquel que hemos 
		seleccionado.</li>
		<li>Tecla de acceso r&aacute;pido: i</li>
	</ul><br/>
	<li><a name="multifirma.masiva.wizard.firma.extension">Aplicar s&oacute;lo a los ficheros con extensi&oacute;n:</a></li>
	<ul type="circle">
		<li>En esta caja de texto podemos introducir las extensiones, separadas por comas (','), de los ficheros que deseamos que se incluyan 
		en el lote de firma. Por ejemplo, con la cadena "txt,pdf" s&oacute;lo entrar&iacute;an en el lote los ficheros "txt" y "pdf" del 
		directorio seleccionado.</li>
		<li>Tecla de acceso r&aacute;pido: p</li>
	</ul>
</ul>

<p>Al pulsar el bot&oacute;n "Siguiente &gt;" se nos mostrar&aacute; una nueva ventana desde la que podremos seleccionar el directorio en donde se 
almacenar&aacute;n las firmas generadas.</p>

<p align="center">
	<img src="images/image042.png" width="670" height="585"/>
</p>

<p>Las opciones configurables en esta pantalla son:</p>
<ul>
	<li><a name="multifirma.masiva.wizard.firma.directoriofirmas">Directorio de firmas.</a></li>
	<ul type="circle">
		<li>Aqu&iacute; podemos indicar el directorio en donde se encuentran los ficheros con los que queremos operar. Podemos introducir la ruta en 
		la caja de texto correspondiente o pulsar el bot&oacute;n "Examinar" para buscar el directorio en el sistema del usuario</li>
		<li>Tecla de acceso r&aacute;pido: d</li>
		<li>Tecla de acceso r&aacute;pido al bot&oacute;n Examinar: e</li>
	</ul><br/>
	<li><a name="multifirma.masiva.wizard.firma.sobreescribir">Sobrescribir ficheros si ya existen.</a></li>
	<ul type="circle">
		<li>Si marcamos esta casilla se sobrescribir&aacute; cualquier fichero que exista en el directorio de salida con el mismo nombre que alguno de 
		los ficheros que ya existen. Si no se marca la casilla se agregar&aacute; un n&uacute;mero en serie al nombre del fichero. Si por ejemplo: se fuese 
		a generar el fichero "firma.csig" y ya existiese uno con este nombre, se crear&iacute;a "firma(1).csig"; si este tambi&eacute;n existiera se crear&iacute;a 
		"firma(2).csig" y as&iacute; sucesivamente.</li>
		<li>Tecla de acceso r&aacute;pido: o</li>
	</ul><br/>
	<li><a name="multifirma.masiva.wizard.firma.ficheroLog"><a name="multifirma.masiva.wizard.firma.abrir">Fichero de log.</a></a></li>
	<ul type="circle">
		<li>Este es el fichero que se crear&aacute; y mostrar&aacute; el resultado de la operaci&oacute;n masiva. Todos los errores que se hayan producido durante el 
		proceso vendr&aacute;n listados en este fichero. Podemos introducir la ruta en 
		la caja de texto correspondiente o pulsar el bot&oacute;n &quot;Examinar&quot; para buscar el fichero en el sistema del usuario.</li>
		<li>Tecla de acceso r&aacute;pido: f</li>
		<li>Tecla de acceso r&aacute;pido al bot&oacute;n Examinar: x</li>
	</ul>
</ul>

<p>Al pulsar el bot&oacute;n "Siguiente &gt;" se dar&aacute; a elegir el certificado de firma y se ejecutar&aacute; la operaci&oacute;n.
Una vez finalizada se mostrar&aacute; la siguiente ventana.</p>

<p align="center">
	<img src="images/image044.png" width="670" height="585"/>
</p>

<p>Pulse el bot&oacute;n "Finalizar" para volver a la pantalla principal de la aplicaci&oacuyte;n.</p>

<p>Teclas de acceso r&aacute;pido para los botones: </p>
<ul>
	<li>Maximizar ventana: m</li>
	<li>Anterior: a</li>
	<li>Siguiente: s</li>
	<li>Cancelar: c</li>
	<li>Finalizar: f</li>
</ul>

</body>
</html>