AOKeyStoreDialog.2=Pot ser que el certificat haja caducat. S'ha usat l'hora local del seu ordinador, per la qual cosa la comprovaci\u00F3 pot no ser precisa. Potser la signatura generada no t\u00E9 validesa legal. Desitja continuar amb l'operaci\u00F3?
AOKeyStoreDialog.3=Pot ser que el certificat encara no siga v\u00E0lid. S'ha usat l'hora local del seu ordinador, per la qual cosa la comprovaci\u00F3 pot no ser precisa. Potser la signatura generada no t\u00E9 validesa legal. Desitja continuar amb l'operaci\u00F3?
AOKeyStoreDialog.4=No s'ha pogut validar el certificat. Potser la signatura generada no t\u00E9 validesa legal. Desitja continuar amb l'operaci\u00F3?
AOKeyStoreDialog.5=Advertiment
AOKeyStoreDialog.6=Selecci\u00F3 de magatzem local
AOKeyStoreDialog.7=Magatzems de claus
AOKeyStoreDialog.8=Error al resfrescar el magatzem de claus.
AOKeyStoreDialog.9=Error
AOKeyStoreDialog.10=Error en carregar el nou magatzem de claus.
AOKeyStoreDialog.11=Contrasenya incorrecta.

AOKeyStore.0=Introdu\u00EFsca la contrasenya del certificat dins del fitxer PKCS\\#12.
AOKeyStore.1=Introdu\u00EFsca la contrasenya del magatzem PKCS\\#12.
AOKeyStore.10=Introdu\u00EFsca el PIN del DNIe.
AOKeyStore.11=Introdu\u00EFsca el PIN de la seua targeta CERES.
AOKeyStore.12=Introdu\u00EFsca el PIN del seu carnet professional del CNP.
AOKeyStore.13=Introdu\u00EFsca la contrasenya del magatzem de claus del sistema.
AOKeyStore.14=Introdu\u00EFsca el PIN de la seua Targeta del Ministeri de Defensa.
AOKeyStore.15=Introdu\u00EFsca la contrasenya del magatzem %0.
AOKeyStore.2=Introdu\u00EFsca la contrasenya del certificat dins del magatzem Java.
AOKeyStore.3=Introdu\u00EFsca la contrasenya del magatzem Java.
AOKeyStore.4=Introdu\u00EFsca la contrasenya del magatzem PKCS\\#11.
AOKeyStore.5=Introdu\u00EFsca la contrasenya del magatzem de claus de Mozilla Firefox.
AOKeyStore.6=Introdu\u00EFsca la contrasenya del certificat dins del magatzem Java.
AOKeyStore.7=Introdu\u00EFsca la contrasenya del magatzem Java.
AOKeyStore.8=Introdu\u00EFsca la contrasenya del certificat dins del magatzem Java.
AOKeyStore.9=Introdu\u00EFsca la contrasenya del magatzem Java.

AOKeyStoreManagerFactory.0=Magatzems PKCS\\#12 (*.p12, *.pfx)
AOKeyStoreManagerFactory.1=Java KeyStore (*.jks)
AOKeyStoreManagerFactory.2=Certificats PKCS\\#7 / X.509 (*.cer, *.p7b)
AOKeyStoreManagerFactory.3=Java Cryptography Extension KeyStore (*.jceks, *.jks)
AOKeyStoreManagerFactory.4=Obrir repositori
AOKeyStoreManagerFactory.6=Biblioteques PKCS\\#11
AOKeyStoreManagerFactory.7=Seleccionar biblioteca PKCS\\#11

AOKeyStoreManager.0=Introdu\u00EFsca el PIN del seu DNI Electr\u00F2nic

KeyStoreUtilities.0=Informaci\u00F3 del magatzem de claus
KeyStoreUtilities.1=Error del magatzem de claus
KeyStoreUtilities.2=Advertiment del magatzem de claus
KeyStoreUtilities.3=Per favor, introdu\u00EFsca el nom d'usuari del magatzem de claus.
KeyStoreUtilities.4=Nom d'usuari del dispositiu criptogr\u00E0fic
KeyStoreUtilities.5=La contrasenya introdu\u00EFda no \u00E9s correcta.
KeyStoreUtilities.6=Error en carregar el magatzem de claus
KeyStoreUtilities.7=El seu magatzem de claus esta bloquejat.
KeyStoreUtilities.8=La longitud de la contrasenya introdu\u00EFda no \u00E9s v\u00E0lida.

CAPIKeyStoreManager.0=Per favor, introdu\u00EFsca la contrasenya del seu dispositiu criptogr\u00E0fic

SmartCardUnifiedKeyStoreManager.0=Per favor, introdu\u00EFsca la contrasenya de la targeta %0
