<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd"> 
<html>
 <head>
  <meta http-equiv="Content-type" content="text/html;charset=UTF-8">
  <title>
   Valores aceptados como par&aacute;metros adicionales para las firmas XAdES
  </title>
 </head>
 <body>
 <p>Valores aceptados como par&aacute;metros adicionales para las firmas XAdES:</p>
 <dl>
  <dt><b><i>includeOnlySignningCertificate</i></b></dt>
   <dd>
    Indica, mediante un {@code true} o {@code false}, que debe
    incluirse en la firma &uacute;nicamente el certificado utilizado
	para firmar y no su cadena de certificaci&oacute;n completa.
	Por defecto, se incluir&aacute; toda la cadena de certificaci&oacute;n.
   </dd>
  <dt><b><i>signerClaimedRole</i></b></dt>
   <dd>Cargo del firmante</dd>
  <dt><b><i>signatureProductionCity</i></b></dt>
   <dd>Ciudad en la que se realiza la firma</dd>
  <dt><b><i>signatureProductionProvince</i></b></dt>
   <dd>Provincia en la que se realiza la firma</dd>
  <dt><b><i>signatureProductionPostalCode</i></b></dt>
   <dd>C&oacute;digo postal en el que se realiza la firma</dd>
  <dt><b><i>signatureProductionCountry</i></b></dt>
   <dd>Pa&iacute;s en el que se realiza la firma</dd>
  <dt><b><i>signatureComments</i></b></dt>
   <dd>Comentarios sobre la firma (normalmente la raz&oacute;n de la firma).</dd>
  <dt><b><i>signatureAddress1</i></b></dt>
   <dd>Primera l&iacute;nea de la direcci&oacute;n en la que se ha realizado la firma.</dd>
  <dt><b><i>signatureAddress2</i></b></dt>
   <dd>Segunda l&iacute;nea de la direcci&oacute;n en la que se ha realizado la firma.</dd>
  <dt><b><i>commitmentTypeIndications</i></b> (propiedad compartida con CAdES)</dt>
   <dd>
    N&uacute;mero de <i>CommitmentTypeIndications</i> a a&ntilde;adir a la firma XAdES.<br>
    En los par&aacute;metros siguientes, los <i>CommitmentTypeIndications</i> se numeran a partir de 0 (cero).
   </dd>
  <dt><b><i>commitmentTypeIndication</i>n<i>Identifier</i></b> (propiedad compartida con CAdES)</dt>  
    <dd>
    Tipo de <i>CommitmentTypeIndication</i> (atributo obligatorio, se debe usar el ordinal, nunca la URL o el OID directamente):
    <ul>
     <li><i>1</i> = Prueba de origen</li>
     <li><i>2</i> = Prueba de recepci&oacute;n</li>
     <li><i>3</i> = Prueba de entrega</li>
     <li><i>4</i> = Prueba de env&iacute;o</li>
     <li><i>5</i> = Prueba de aprobaci&oacute;n</li>
     <li><i>6</i> = Prueba de creaci&oacute;n</li>
    </ul> 
   </dd>
  <dt><b><i>commitmentTypeIndication</i>n<i>Description</i></b></dt>
   <dd>
    Descripci&oacute;n textual del <i>CommitmentTypeIndication</i> n&uacute;mero <i>n</i> (atributo opcional). 
   </dd>
     <dt><b><i>commitmentTypeIndication</i>n<i>CommitmentTypeQualifiers</i></b></dt>
   <dd>
    Lista de indicadores textuales separados por el car&aacute;cter '<i>|</i>' que se aportan como calificadores adicionales del 
    <i>CommitmentTypeIndication</i> n&uacute;mero <i>n</i> (atributo opcional). Normalmente son OID.<br>
    Los elementos de la lista no pueden contener el car&aacute;cter '<i>|</i>' (ya que este se usa como separador). 
   </dd>
 </dl>
 </body>
</html>