CertificateInfo.0=Certificado xen\u00E9rico X.509v3
CertificateInfo.1=Titular do certificado:  
CertificateInfo.2=Emisor do certificado: 
CertificateInfo.3=Certificado X.509v3 xen\u00E9rico

CertificationLevelResources.0=Firma ordinaria non certificada
CertificationLevelResources.1=Sinatura de autor
CertificationLevelResources.2=Sinatura de autor certificada
CertificationLevelResources.3=Firma certificada
CertificationLevelResources.4=Preguntar sempre antes de asinar

TimeStampPdfTypeResource.0=S\u00F3 selo a nivel de firma
TimeStampPdfTypeResource.1=S\u00F3 selo a nivel de documento
TimeStampPdfTypeResource.2=Dous selos, un a nivel de firma e outro a nivel de documento

CipherDialog.0=Cifrado de ficheiros
CipherDialog.1=Di\u00E1logo para o cifrado de ficheiros
CipherDialog.2=Algoritmo de cifrado
CipherDialog.3=Ficheiro a cifrar
CipherDialog.4=Cancelar
CipherDialog.5=Cifrar
CipherDialog.6=Seleccionar ficheiro a cifrar
CipherDialog.7=Pulse este bot\u00F3n para buscar o arquivo a cifrar
CipherDialog.8=Contrasinal
CipherDialog.9=Pulse este bot\u00F3n para cifrar o arquivo
CipherDialog.10=Pulse este bot\u00F3n para pechar o di\u00E1logo
CipherDialog.11=Todos os arquivos (*.*)

ClosePanel.0=Non volver mostrar esta mensaxe

ConfirmSignatureDialog.0=Autorizar firma
ConfirmSignatureDialog.1=Vaise a realizar a firma electr\u00F3nica dun documento.
ConfirmSignatureDialog.2=Vaise a realizar a firma electr\u00F3nica de %0 documentos.
ConfirmSignatureDialog.4=<html>Pulse "Aceptar" para dar fe de entender as implicaci&oacute;ns legais de asinar e<br>autorizar a sinatura dos documentos seleccionados. En caso contrario, pulse<br>"Cancelar".</html>
ConfirmSignatureDialog.5=Omitir esta confirmaci\u00F3n en futuras operaci\u00F3ns de firma.
ConfirmSignatureDialog.6=Aceptar
ConfirmSignatureDialog.7=Cancelar

DataDebugDialog.0=Binario
DataDebugDialog.1=Tipo dos datos a asinar: %0
DataDebugDialog.2=Tama\u00F1o dos datos a asinar: %0 octetos
DataDebugDialog.3=Contido dos datos a asinar:
DataDebugDialog.4=Datos a asinar
DataDebugDialog.5=Fallou a carga de datos desde ficheiro
DataDebugDialog.6=Ficheiro de datos
DataDebugDialog.7=Seleccione o ficheiro cos datos a asinar
DataDebugDialog.8=Continuar
DataDebugDialog.9=Pulse este bot\u00F3n para continuar co proceso de firma

DataFileInfoDialog.0=Gardar
DataFileInfoDialog.1=Abrir
DataFileInfoDialog.2=Cancelar
DataFileInfoDialog.3=Datos asinados
DataFileInfoDialog.4=Tipo de documento:
DataFileInfoDialog.5=Desco\u00F1ecido
DataFileInfoDialog.6=Extensi\u00F3n:
DataFileInfoDialog.7=Desco\u00F1ecida
DataFileInfoDialog.8=Tama\u00F1o:

DnieCertAnalyzer.0=de
DnieCertAnalyzer.2=Certificado de sinatura de DNIe
DnieCertAnalyzer.4=Certificado de DNI electr\u00F3nico

DNIePasswordCallback.1=Introduza o PIN do seu DNIe
DNIePasswordCallback.3=DNI electr\u00F3nico

DNIeWaitPanel.0=Usar almac\u00E9n por defecto
DNIeWaitPanel.1=Se non desexa usar DNI electr\u00F3nico pulse este bot\u00F3n ou a tecla escape para poder seleccionar un certificado calquera desde o almac\u00E9n de claves e certificados do sistema operativo
DNIeWaitPanel.2=Bot\u00F3n de omisi\u00F3n de espera para inserci\u00F3n de DNIe
DNIeWaitPanel.3=Insira o seu DNIe no lector de cart\u00F3ns e pulse o bot\u00F3n "Continuar con DNIe"
DNIeWaitPanel.4=Continuar con DNIe
DNIeWaitPanel.5=Pulse este bot\u00F3n para usar o seu DNIe nas operaci\u00F3ns posteriores de firma
DNIeWaitPanel.6=Bot\u00F3n de confirmaci\u00F3n de uso de DNIe
DNIeWaitPanel.7=Unha vez inserido, non extraia o DNIe nin o lector de cart\u00F3ns durante toda a execuci\u00F3n deste programa
DNIeWaitPanel.8=Non volver mostrar esta pantalla inicial e traballar sempre co almac\u00E9n por defecto

MainMenu.0=Arquivo
MainMenu.1=Men\u00FA con operaci\u00F3ns de apertura e sinatura de arquivos
MainMenu.10=Men\u00FA con operaci\u00F3ns relacionadas coa axuda da aplicaci\u00F3n
MainMenu.11=Axuda de Autofirma
MainMenu.12=Preferencias
MainMenu.13=Carga a axuda da aplicaci\u00F3n nunha nova xanela
MainMenu.14=<html><p align="center">Autofirma %0<br>&copy; 2011-2025 Goberno de Espa&ntilde;a</p><br><p>Autofirma &eacute; Software Libre; podes redistribu&iacute;r e/ou modificar baixo os termos de polo menos<br>unha destas d&uacute;as licenzas: <ul><li>A "GNU Xeneral Public License" tal como &eacute; publicada pola Free Software Foundation;<br>versi&oacute;n 2 da Licenza, ou (&aacute; s&uacute;a elecci&oacute;n) calquera versi&oacute;n posterior.</li><li>A "European Software License"; versi&oacute;n 1.1 da Licenza, ou (&aacute; s&uacute;a elecci&oacute;n) calquera<br>versi&oacute;n posterior.</li></ul><p>Autofirma cont&eacute;n, entre outros, os seguintes compo\u00F1entes de software libre:<br>iText 2.1.7 (MPL 1.1/LGPL), jMimeMagic (Apache License 2.0), JUniversalCharDet (MPL 1.1),<br>jXAdES (EUPL 1.1/GPLv3), SpongyCastle (MIT), Java WebSockets (MIT), Proxy Vole (Apache License 2.0), etc.</p><p><br>Versi&oacute;n de Java actualmente en uso: %1 (%2bits)</p></html>
MainMenu.15=Acerca de Autofirma
MainMenu.16=Preferencias xerais da aplicaci\u00F3n
MainMenu.17=Mostra informaci\u00F3n adicional acerca de Autofirma
MainMenu.18=Opci\u00F3ns
MainMenu.19=Men\u00FA coas opci\u00F3ns configurables da aplicaci\u00F3n
MainMenu.20=Restaurar instalaci\u00F3n
MainMenu.21=Ferramenta para restaurar a configuraci\u00F3n dos navegadores
MainMenu.2=Abrir arquivo a asinar
MainMenu.24=Preferencias de configuraci\u00F3n de firma electr\u00F3nica
MainMenu.25=Pegadas dixitais
MainMenu.26=Calcular pegada dixital
MainMenu.27=Comprobar pegada dixital
MainMenu.28=Calcular pegada dixital de directorio
MainMenu.29=Comprobar pegada dixital de directorio
MainMenu.30=Ficheiro
MainMenu.31=Directorio
MainMenu.32=Ferramentas
MainMenu.33=Men\u00FA con ferramentas complementarias
MainMenu.34=Ver firma
MainMenu.35=Abrir firma
MainMenu.36=Firmas electr\u00F3nicas
MainMenu.37=Xestionar plugins
MainMenu.38=Lingua
MainMenu.39=Espa\u00F1ol
MainMenu.40=English
MainMenu.41=Catal\u00e1
MainMenu.42=Galego
MainMenu.43=Euskera
MainMenu.44=Valenci\u00E0
MainMenu.45=Importar idioma
MainMenu.46=Abrir ficheiro para importar idioma
MainMenu.47=Arquivo comprimido
MainMenu.48=Erro ao importar idioma
MainMenu.49=Reinicie a operaci\u00F3n para que os cambios fornezan efecto.
MainMenu.50=Reiniciar Autofirma
MainMenu.51=\u00C9 necesario reiniciar a aplicaci\u00F3n para que os cambios fornezan efecto. Desexa que se reinicie a aplicaci\u00F3n?
MainMenu.52=O idioma importouse correctamente
MainMenu.3=Abre un ficheiro para permitir a s\u00FAa posterior firma
MainMenu.4=Seleccione o ficheiro a asinar
MainMenu.5=Asinar arquivo
MainMenu.6=Firma o ficheiro seleccionado para a s\u00FAa firma
MainMenu.7=Sa\u00EDr
MainMenu.8=Pecha a aplicaci\u00F3n
MainMenu.9=Axuda

MenuValidation.0=Validaci\u00F3n
MenuValidation.1=Validar certificado
MenuValidation.10=Certificado inv\u00E1lido
MenuValidation.11=O certificado non \u00E9 v\u00E1lido ou non se puido validar:
MenuValidation.12=Validar firma electr\u00F3nica
MenuValidation.13=Validaci\u00F3n de firmas electr\u00F3nicas en canto a estrutura e pegadas dixitais
MenuValidation.14=<html>O certificado emitido por:<br><i>&nbsp;&nbsp;%0</i><br>A nome de:<br><i>&nbsp;&nbsp;%1</i><br>&eacute; v&aacute;lido.<br>Esta comprobaci&oacute;n pode ser parcial, para unha comprobaci&oacute;n completa<br>use a Plataforma @asina.</html>
MenuValidation.15=Certificado v\u00E1lido
MenuValidation.16=Seleccione a firma a validar
MenuValidation.17=Firmas electr\u00F3nicas (*.*)
MenuValidation.2=Validaci\u00F3n de certificados (per\u00EDodo de validez, revogaci\u00F3n, etc.)
MenuValidation.3=Seleccione o certificado a validar
MenuValidation.4=Certificados dixitais (*.cer, *.cert, *.crt, *.pem)
MenuValidation.5=Erro
MenuValidation.6=Non se te\u00F1en permisos para ler o ficheiro
MenuValidation.7=Erro lendo o ficheiro de certificado
MenuValidation.8=O certificado est\u00E1 corrupto e non pode ser validado
MenuValidation.9=Non se co\u00F1ecen mecanismos de validaci\u00F3n para este certificado

PreferencesPanel.0=Aplicar agora
PreferencesPanel.1=Inclu\u00EDr unha copia dos datos asinados na propia firma
PreferencesPanel.10=C\u00F3digo postal do lugar no que se realiza a firma
PreferencesPanel.11=Cidade na que se realiza a firma
PreferencesPanel.12=Pa\u00EDs no que se realiza a firma
PreferencesPanel.13=Cargo atribu\u00EDdo ao asinante
PreferencesPanel.14=Provincia na que se realiza a firma
PreferencesPanel.15=Formato de firma:
PreferencesPanel.16=Opci\u00F3ns de firma
PreferencesPanel.17=Opci\u00F3ns de firma
PreferencesPanel.18=Algoritmo de pegada para a firma:
PreferencesPanel.19=Metadatos das firmas
PreferencesPanel.2=Xeneral
PreferencesPanel.20=Raz\u00F3n pola que se asina o documento
PreferencesPanel.21=Cidade na que se realiza a firma
PreferencesPanel.22=Contacto do asinante (usualmente unha direcci\u00F3n de correo electr\u00F3nico)
PreferencesPanel.23=Pol\u00EDtica de firma:
PreferencesPanel.24=Ningunha pol\u00EDtica
PreferencesPanel.25=Pol\u00EDtica de sinatura da AGE 1.8
PreferencesPanel.26=Pol\u00EDtica de firma a medida
PreferencesPanel.CAdES.27=Identificador da pol\u00EDtica (debe ser un OID)
PreferencesPanel.XAdES.27=Identificador da pol\u00EDtica (debe ser un URI)
PreferencesPanel.PAdES.27=Identificador da pol\u00EDtica (debe ser un OID)
PreferencesPanel.Facturae.27=Identificador da pol\u00EDtica (debe ser un URI)
PreferencesPanel.28=Pegada dixital do identificador da pol\u00EDtica (en Base64)
PreferencesPanel.29=Algoritmo da pegada dixital do identificador da pol\u00EDtica
PreferencesPanel.3=Firmas PAdES (PDF)
PreferencesPanel.30=Calificador da pol\u00EDtica (URL)
PreferencesPanel.31=Cancelar
PreferencesPanel.32=Cancela o establecemento de preferencias descartando os cambios realizados desde a \u00FAltima vez que se gardaron
PreferencesPanel.33=Aceptar
PreferencesPanel.34=Garda os valores establecidos para as preferencias e finaliza o proceso de establecemento destas pechando a xanela
PreferencesPanel.35=Garda os valores establecidos para as preferencias permitindo continuar co proceso de establecemento destas
PreferencesPanel.36=Non pedir confirmaci\u00F3n ao pechar a aplicaci\u00F3n
PreferencesPanel.37=Preferencias xerais
PreferencesPanel.38=Os datos da pol\u00EDtica de firma CAdES son inv\u00E1lidos
PreferencesPanel.4=Firmas CAdES
PreferencesPanel.40=Opci\u00F3ns xerais de configuraci\u00F3n
PreferencesPanel.41=Opci\u00F3ns de configuraci\u00F3n para as firmas PAdES de documentos PDF
PreferencesPanel.42=Opci\u00F3ns de configuraci\u00F3n para as firmas CAdES de ficheiros binarios
PreferencesPanel.43=Opci\u00F3ns de configuraci\u00F3n para as firmas XAdES de documentos XML
PreferencesPanel.44=Establece se debe omitirse a solicitude de confirmaci\u00F3n ao usuario cando se tente pechar a aplicaci\u00F3n
PreferencesPanel.45=Establece se as firmas CAdES xeradas deben ser impl\u00EDcitas
PreferencesPanel.46=Algoritmo que se utilizar\u00E1 en todas as firmas electr\u00F3nicas que permitan a s\u00FAa configuraci\u00F3n
PreferencesPanel.47=Configuraci\u00F3n de pol\u00EDtica de firma para firmas XAdES
PreferencesPanel.48=Configuraci\u00F3n de pol\u00EDtica de firma para firmas PAdES
PreferencesPanel.49=Configuraci\u00F3n de pol\u00EDtica de firma para firmas CAdES
PreferencesPanel.5=Firmas XAdES
PreferencesPanel.50=Algoritmo utilizado para o c\u00E1lculo da pegada dixital do identificador da pol\u00EDtica de firma para firmas XAdES
PreferencesPanel.51=Algoritmo utilizado para o c\u00E1lculo da pegada dixital do identificador da pol\u00EDtica de firma para firmas CAdES
PreferencesPanel.52=Algoritmo utilizado para o c\u00E1lculo da pegada dixital do identificador da pol\u00EDtica de firma para firmas PAdES
PreferencesPanel.53=Formato utilizado na xeraci\u00F3n das firmas XAdES
PreferencesPanel.54=URI identificadora da pol\u00EDtica de firma para firmas XAdES
PreferencesPanel.55=Pegada dixital do identificador da pol\u00EDtica de firma para firmas XAdES
PreferencesPanel.56=URL calificadora da pol\u00EDtica de firma para firmas XAdES
PreferencesPanel.57=OID identificador da pol\u00EDtica de firma para firmas CAdES
PreferencesPanel.58=Pegada dixital do identificador da pol\u00EDtica de firma para firmas CAdES
PreferencesPanel.59=URL calificadora da pol\u00EDtica de firma para firmas CAdES
PreferencesPanel.6=Os datos da pol\u00EDtica de firma XAdES son inv\u00E1lidos
PreferencesPanel.60=OID identificador da pol\u00EDtica de firma para firmas PAdES
PreferencesPanel.61=Pegada dixital do identificador da pol\u00EDtica de firma para firmas PAdES
PreferencesPanel.62=URL calificadora da pol\u00EDtica de firma para firmas PAdES
PreferencesPanel.63=Raz\u00EDn de sinatura dos documentos PDF
PreferencesPanel.64=Cidade na que se realiza as\u00EDnaa PDF
PreferencesPanel.65=Informaci\u00F3n de contacto que se agrega \u00E1s firmas PDF. Comunmente unha direcci\u00F3n de correo electr\u00F3nico
PreferencesPanel.66=Cidade na que se realiza a firma
PreferencesPanel.67=Pa\u00EDs no que se realiza a firma
PreferencesPanel.68=Provincia na que se realiza a firma
PreferencesPanel.69=Opci\u00F3ns de firma
PreferencesPanel.7=Os datos da pol\u00EDtica de firma PAdES son inv\u00E1lidos
PreferencesPanel.70=Formato b\u00E1sico das firmas PAdES
PreferencesPanel.71=PAdES B\u00E1sico
PreferencesPanel.72=PAdES-BES
PreferencesPanel.73=Pol\u00EDtica de sinatura da AGE 1.9
PreferencesPanel.79=Realizar por defecto firmas visibles PDF
PreferencesPanel.8=Metadatos das firmas
PreferencesPanel.80=Firma visible
PreferencesPanel.81=Omitir pantalla inicial de DNIe.
PreferencesPanel.82=Establece se debe mostrarse ou non a pantalla inicial que pregunta ao usuario se desexa usar s\u00F3 DNIe ou calquera certificado
PreferencesPanel.84=Almac\u00E9ns de claves
PreferencesPanel.85=Opci\u00F3ns de configuraci\u00F3n para os almac\u00E9ns de claves e certificados
PreferencesPanel.86=Seleccione o ficheiro de configuraci\u00F3n
PreferencesPanel.87=Buscar actualizaci\u00F3ns ao comezo
PreferencesPanel.88=Nesta casa pode seleccionar se desexa ou non que o programa busque automaticamente actualizaci\u00F3ns ao iniciarse
PreferencesPanel.9=Provincia ou rexi\u00F3n na que se realiza a firma
PreferencesPanel.100=Factura Electr\u00F3nica
PreferencesPanel.101=Opci\u00F3ns de configuraci\u00F3n para a Factura Electr\u00F3nica de documentos
PreferencesPanel.102=C\u00F3digo postal do lugar no que se realiza a firma
PreferencesPanel.104=Formato 1
PreferencesPanel.105=Formato 2
PreferencesPanel.106=Formato b\u00E1sico da Firma Electr\u00F3nica
PreferencesPanel.107=Importar configuraci\u00F3n
PreferencesPanel.108=Opci\u00F3ns xerais
PreferencesPanel.109=Seleccione o URL para descarga do ficheiro de preferencias
PreferencesPanel.110=Importar configuraci\u00F3n desde rede
PreferencesPanel.111=Configuraci\u00F3ns de Autofirma (*.afconfig)
PreferencesPanel.112=Pulse este bot\u00F3n para seleccionar un ficheiro coas opci\u00F3ns de configuraci\u00F3n para todo o programa
PreferencesPanel.113=Mostrar icona na \u00E1rea de notificaci\u00F3ns e executar automaticamente ao comezo (necesita reiniciar)
PreferencesPanel.114=Establece a icona na \u00E1rea de notificaci\u00F3ns e executar automaticamente ao comezo
PreferencesPanel.115=Formato avanzado de firma:
PreferencesPanel.116=Erro importando a configuraci\u00F3n desde rede
PreferencesPanel.117=Erro
PreferencesPanel.118=Personalizar formato de selo de tempo
PreferencesPanel.119=Configurar
PreferencesPanel.120=Pulse este bot\u00F3n para personalizar o formato de selos de tempo
PreferencesPanel.121=Selo de tempo
PreferencesPanel.122=Aplicar selos de tempo ao documento asinado
PreferencesPanel.123=Nivel de certificaci\u00F3n da firma
PreferencesPanel.124=Selos de tempo
PreferencesPanel.125=Configuraci\u00F3n de rede
PreferencesPanel.126=Configurar proxy
PreferencesPanel.127=Pulse este bot\u00F3n para configurar as opci\u00F3ns de proxy
PreferencesPanel.128=Cambiar configuraci\u00F3n de proxy para as conexi\u00F3ns de rede:
PreferencesPanel.129=Erro
PreferencesPanel.130=Non se puido instalar a icona no \u00E1rearea de notificaci\u00F3ns
PreferencesPanel.131=Non se puido desinstalar a icona do \u00E1rearea de notificaci\u00F3ns
PreferencesPanel.132=<html>Instalouse correctamente a icona no &aacute;rearea de notificaci&oacute;ns. A aplicaci&oacute;n execut&aacute;sese automaticamente a partir do pr&oacute;ximo reinicio</html>
PreferencesPanel.133=<html>Hase desinstalado correctamente a icona do &aacute;rearea de notificaci&oacute;ns. A aplicaci&oacute;n deixar&aacute; de executarse automaticamente a partir do pr&oacute;ximo reinicio</html>
PreferencesPanel.134=Icona no \u00E1rearea de notificaci\u00F3ns
PreferencesPanel.135=Restaurar configuraci\u00F3n
PreferencesPanel.136=Pulse este bot\u00F3n para restaurar as opci\u00F3ns de configuraci\u00F3n para todo o programa.
PreferencesPanel.137=Cifrado
PreferencesPanel.138=Opci\u00F3ns de configuraci\u00F3n para o cifrado
PreferencesPanel.139=Restaurar configuraci\u00F3n
PreferencesPanel.140=Queres restaurar a configuraci\u00F3n xeral da aplicaci\u00F3n?
PreferencesPanel.141=Ocorreu un erro eliminando as preferencias da aplicaci\u00F3n
PreferencesPanel.142=A configuraci\u00F3n importouse correctamente.
PreferencesPanel.143=Importaci\u00F3n da configuraci\u00F3n
PreferencesPanel.144=Restaurar valores
PreferencesPanel.145=Restaura os valores por defecto das preferencias
PreferencesPanel.146=Faga clic no seguinte bot\u00F3n para restaurar a configuraci\u00F3n de firmas PAdES.
PreferencesPanel.147=Restaurar configuraci\u00F3n
PreferencesPanel.148=Faga clic no seguinte bot\u00F3n para restaurar a configuraci\u00F3n de firmas XAdES.
PreferencesPanel.149=Faga clic no seguinte bot\u00F3n para restaurar a configuraci\u00F3n de firmas Facturae.
PreferencesPanel.150=Configurar pol\u00EDtica
PreferencesPanel.151=Pulse este bot\u00F3n para configurar a pol\u00EDtica de firma
PreferencesPanel.152=Faga clic no seguinte bot\u00F3n para configurar a pol\u00EDtica de firma.
PreferencesPanel.153=Configuraci\u00F3n da pol\u00EDtica de firma
PreferencesPanel.154=Faga clic no seguinte bot\u00F3n para restaurar a configuraci\u00F3n de firmas CAdES.
PreferencesPanel.155=Queres restaurar a configuraci\u00F3n das firmas PAdES?
PreferencesPanel.156=Queres restaurar a configuraci\u00F3n das firmas XAdES?
PreferencesPanel.157=Queres restaurar a configuraci\u00F3n das firmas CAdES?
PreferencesPanel.158=Queres restaurar a configuraci\u00F3n das Facturas Electr\u00F3nicas?
PreferencesPanel.160=Sobreescribir ficheiros no directorio de sa\u00EDda nas firmas masivas 
PreferencesPanel.161=Cambiar formato de firma para cada tipo de ficheiro:
PreferencesPanel.162=Configurar formatos
PreferencesPanel.163=Pulse este bot\u00F3n para configurar o formato de firma que debe aplicarse a cada tipo de ficheiro
PreferencesPanel.164=Formatos de firma
PreferencesPanel.165=Habilitar JMulticard para o uso de cart\u00F3ns da FNMT e DNIe (require reiniciar Autofirma)
PreferencesPanel.166=Habilita o uso de DNIe e cart\u00F3ns CES mediante JMulticard (require reiniciar)
PreferencesPanel.167=Operaci\u00F3n en multisinaturas
PreferencesPanel.168=Cofirma
PreferencesPanel.169=Contrafirma (unicamente dos nodos folla)
PreferencesPanel.170=Contrafirma (de toda a \u00E1rbore)
PreferencesPanel.171=Pol\u00EDtica de firma:
PreferencesPanel.172=Aplicar marca visible a documentos PDF
PreferencesPanel.173=Aceptar s\u00F3 conexi\u00F3ns con sitios seguros (Recomendado)
PreferencesPanel.174=S\u00F3 se aceptar\u00E1n conexi\u00F3ns con direcci\u00F3ns HTTPS cando o certificado sexa de confianza
PreferencesPanel.175=Ofuscar identificadores de usuario dos certificados das firmas visibles
PreferencesPanel.176=Permitir o uso de certificados caducados
PreferencesPanel.177=Permitir seleccionar certificados caducados para asinar
PreferencesPanel.178=Permitir agregar novas firmas a documentos con firmas non v\u00E1lidas
PreferencesPanel.179=Solicitar confirmaci\u00F3n para asinar
PreferencesPanel.180=Pide confirmaci\u00F3n ao usuario antes de executar unha operaci\u00F3n de firma
PreferencesPanel.181=Caixa para introducir texto
PreferencesPanel.182=Casa de verificaci\u00F3n para activar ou desactivar 
PreferencesPanel.183=Desplegable con opci\u00F3ns de 
PreferencesPanel.184=Bot\u00F3n de opci\u00F3n para 
PreferencesPanel.185=Dominios seguros
PreferencesPanel.186=Bot\u00F3n para abrir listaxe de dominios seguros
PreferencesPanel.187=Comprobar PDF Xadow Attack
PreferencesPanel.188=Bot\u00F3n para activar a comprobaci\u00F3nn de PDF Xadow Attacks
PreferencesPanel.189=Ao activar esta opci\u00F3n, o proceso de validaci\u00F3n para PDF pode atrasarse.
PreferencesPanel.190=Funcionamento optimizado para VDI. Non recomendado noutras contornas.
PreferencesPanel.191=Adapta a comunicaci\u00F3n co navegador para un mellor desempe\u00F1o sobre contornas VDI.
PreferencesPanel.192=Almac\u00E9ns de claves
PreferencesPanel.193=Opci\u00F3ns de configuraci\u00F3n de certificados
PreferencesPanel.194=Certificados de confianza
PreferencesPanel.195=Pulse este bot\u00F3n para configurar os certificados de confianza
PreferencesPanel.196=Exportar configuraci\u00F3n
PreferencesPanel.197=Pulse este bot\u00F3n para exportar a un ficheiro as opci\u00F3ns de configuraci\u00F3n para todo o programa
PreferencesPanel.198=Seleccione unha ruta onde exportar o arquivo de configuraci\u00F3n
PreferencesPanel.199=A configuraci\u00F3n exportouse correctamente.
PreferencesPanel.200=Exportaci\u00F3n da configuraci\u00F3n
PreferencesPanel.201=exported_config.afconfig
PreferencesPanel.203=Tipo por defecto:
PreferencesPanel.204=Permitir xerar PDF certificado.
PreferencesPanel.205=Bot\u00F3n para activar a generaci\u00F3nn de PDF certificado
PreferencesPanel.206=Sen certificar
PreferencesPanel.207=Certificada de autor
PreferencesPanel.208=Certificada de autor para formularios
PreferencesPanel.209=Certificada com\u00FAn
PreferencesPanel.210=Xerar asina PDF certificado

DefaultFormatPanel.1=Seleccione o formato de firma que se utilizar\u00E1 para asinar cada tipo de ficheiro.
DefaultFormatPanel.2=Restablecer
DefaultFormatPanel.3=Establece os valores por defecto orixinais nos campos do di\u00E1logo
DefaultFormatPanel.5=Documentos PDF
DefaultFormatPanel.6=Documentos OOXML de Microsoft Office
DefaultFormatPanel.7=Facturas electr\u00F3nicas
DefaultFormatPanel.8=Ficheiros XML xen\u00E9ricos
DefaultFormatPanel.9=Ficheiros ODF de LibreOffice ou OpenOffice
DefaultFormatPanel.10=Resto de ficheiros

PreferencesPanelCiperment.0=Panel para configurar as opci\u00F3ns de cifrado.
PreferencesPanelCiperment.1=Opci\u00F3ns de cifrado
PreferencesPanelCiperment.10=encipherOnly
PreferencesPanelCiperment.11=decipherOnly
PreferencesPanelCiperment.12=Algoritmo de cifrado
PreferencesPanelCiperment.13=Repositorio de certificados de usuarios destinatarios
PreferencesPanelCiperment.14=URI do Repositorio
PreferencesPanelCiperment.15=M\u00E9todo de acceso
PreferencesPanelCiperment.16=Comprobar
PreferencesPanelCiperment.17=Pulse este bot\u00F3n para comprobar que a URI introducida \u00E9 correcta.
PreferencesPanelCiperment.18=O URI introducida non \u00E9 correcta.
PreferencesPanelCiperment.19=Erro
PreferencesPanelCiperment.2=Usos de clave permitidos
PreferencesPanelCiperment.20=A URI introducida \u00E9 correcta.
PreferencesPanelCiperment.3=digitalSignature
PreferencesPanelCiperment.4=nonRepudiation
PreferencesPanelCiperment.5=keyEncipherment
PreferencesPanelCiperment.6=dataEncipherment
PreferencesPanelCiperment.7=keyAgreement
PreferencesPanelCiperment.8=keyCertSign
PreferencesPanelCiperment.9=cRLSign

PreferencesPanelXades.0=Cargo atribu\u00EDdo ao asinante

PreferencesPlistHandler.0=Non foi posible ler o ficheiro de preferencias, non se fixo ning\u00FAn cambio na configuraci\u00F3n
PreferencesPlistHandler.1=Erro
PreferencesPlistHandler.2=O ficheiro de preferencias non foi asinado.
PreferencesPlistHandler.3=O ficheiro de preferencias non esta asinado, non se fixo ning\u00FAn cambio na configuraci\u00F3n
PreferencesPlistHandler.4=O ficheiro de preferencias non esta asinado correctamente, non se fixo ning\u00FAn cambio na configuraci\u00F3n
PreferencesPlistHandler.5=O ficheiro de preferencias esta asinado dixitalmente por: %0
PreferencesPlistHandler.6=<html>O asinante das preferencias non esta autorizado ('%0').<br>Non se fixo ning&uacute;n cambio na configuraci&oacute;n.</html>
PreferencesPlistHandler.7=Non se puido extraer a informaci\u00F3n do sinatura do ficheiro de preferencias, non se fixo ning\u00FAn cambio na configuraci\u00F3n
PreferencesPlistHandler.8=O ficheiro de preferencias \u00E9 inv\u00E1lido, non se fixo ning\u00FAn cambio na configuraci\u00F3n
PreferencesPlistHandler.109=<html><p>Se continua, substituirase a configuraci&oacute;n actual coa indicada no ficheiro, &iquest;Desexa continuar?<br>Se cancela a importaci&oacute;n, non se aplicar&aacute; ningunha configuraci&oacute;n do ficheiro seleccionado.</p><p>%0</p></html>
PreferencesPlistHandler.110=Importar configuraci\u00F3n de firma

PreferencesPanelFacturaE.0=Versi\u00F3n da pol\u00EDtica de sinatura de factura electr\u00F3nica
PreferencesPanelFacturaE.1=Pol\u00EDtica de Factura Electr\u00F3nica 3.0
PreferencesPanelFacturaE.2=Pol\u00EDtica de Factura Electr\u00F3nica 3.1
PreferencesPanelFacturaE.3=Papel do asinante da factura electr\u00F3nica:
PreferencesPanelFacturaE.4=Metadatos das firmas
PreferencesPanelFacturaE.5=Emisor
PreferencesPanelFacturaE.6=Receptor
PreferencesPanelFacturaE.7=Terceiro

PreferencesPanelKeyStores.1=Almac\u00E9n por defecto
PreferencesPanelKeyStores.2=Ver contido
PreferencesPanelKeyStores.3=Usar tam\u00E9n nas chamadas a Autofirma desde o navegador
PreferencesPanelKeyStores.4=Filtros de certificados
PreferencesPanelKeyStores.5=Mostrar pantalla inicial de selecci\u00F3n de DNIe ou calquera outro certificado
PreferencesPanelKeyStores.6=Permitir o uso de certificados caducados
PreferencesPanelKeyStores.7=Usar s\u00F3 certificados espec\u00EDficos para firma nas firmas electr\u00F3nicas (atributo de non repudio)
PreferencesPanelKeyStores.8=Usar exclusivamente certificados de pseud\u00F3nimo
PreferencesPanelKeyStores.9=Cart\u00F3ns intelixentes
PreferencesPanelKeyStores.10=Conectar
PreferencesPanelKeyStores.11=Agregar cart\u00F3n
PreferencesPanelKeyStores.12=Selecci\u00F3n de almac\u00E9n local
PreferencesPanelKeyStores.13=Almac\u00E9ns de claves
PreferencesPanelKeyStores.14=Non se puido cargar o DNIe
PreferencesPanelKeyStores.15=Queres restaurar a configuraci\u00F3n para os almac\u00E9ns de claves?
PreferencesPanelKeyStores.16=Erro ao obter almac\u00E9n
PreferencesPanelKeyStores.17=Permite utilizar o almac\u00E9n por defecto en caso de realizar chamadas \u00E1 aplicaci\u00F3n desde o navegador.
PreferencesPanelKeyStores.18=Contido do almac\u00E9n '%0'
PreferencesPanelKeyStores.19=\u00E9 posible que non todos os certificados mostrados estean dispo\u00F1ibles para asinar electronicamente.
PreferencesPanelKeyStores.20=Erro ao recuperar o almac\u00E9n por defecto seleccionado
PreferencesPanelKeyStores.21=Erro ao rexistrar cart\u00F3n intelixente no sistema
PreferencesPanelKeyStores.22=Erro ao obter os rexistros de cart\u00F3ns intelixentes
PreferencesPanelKeyStores.23=Modificar
PreferencesPanelKeyStores.24=Eliminar
PreferencesPanelKeyStores.25=Queres eliminar o cart\u00F3n seleccionado?
PreferencesPanelKeyStores.26=Erro ao eliminar cart\u00F3n intelixente do sistema
PreferencesPanelKeyStores.27=Encha todos os campos
PreferencesPanelKeyStores.28=Erro ao conectar con cart\u00F3n intelixente
PreferencesPanelKeyStores.29=Conexi\u00F3n correcta con cart\u00F3n intelixente.
PreferencesPanelKeyStores.30=Informaci\u00F3n
PreferencesPanelKeyStores.31=Seleccione un cart\u00F3n
PreferencesPanelKeyStores.32=Omitir certificado de autenticaci\u00F3n de DNIe
PreferencesPanelKeyStores.33=<html>Agregue cart&oacute;ns intelixentes por medio dos seus PKCS#11 para poder acceder directamente <br> aos seus certificados.</html>
PreferencesPanelKeyStores.34=O nome de cart\u00F3n introducido xa se atopa rexistrado. Por favor, introduza un distinto.
PreferencesPanelKeyStores.35=O controlador introducido xa se atopa rexistrado. Por favor, introduza un distinto.
PreferencesPanelKeyStores.36=Non se ha identificar o tipo de almac\u00E9n.

PreferencesPanelTimeStamps.0=Configuraci\u00F3n dos par\u00E1metros de selos de tempo
PreferencesPanelTimeStamps.1=Di\u00E1logo para configurar os par\u00E1metros de selos de tempo
PreferencesPanelTimeStamps.2=Aceptar
PreferencesPanelTimeStamps.3=Tipo de selo de tempo a aplicar
PreferencesPanelTimeStamps.4=URL da autoridade de selo de tempo
PreferencesPanelTimeStamps.5=Pol\u00EDtica de selaxe de tempo
PreferencesPanelTimeStamps.6=Algoritmo de pegada dixital
PreferencesPanelTimeStamps.7=Certificado da TSA requirido
PreferencesPanelTimeStamps.8=Nome de usuario da TSA
PreferencesPanelTimeStamps.9=Contrasinal do usuario da TSA
PreferencesPanelTimeStamps.10=OID da extensi\u00F3n a engadir ao pedimento ao servidor de selo de tempo (opcional)
PreferencesPanelTimeStamps.11=Valor, en binario convertido a Base64, da extensi\u00F3n a engadir ao pedimento ao servidor de selo de tempo
PreferencesPanelTimeStamps.12=O OID da extensi\u00F3n indicada anteriormente \u00E9 cr\u00EDtica
PreferencesPanelTimeStamps.13=O formato de URL introducido \u00E9 err\u00F3neo ou baleiro
PreferencesPanelTimeStamps.14=Erro URL
PreferencesPanelTimeStamps.15=O formato de OID introducido \u00E9 err\u00F3neo
PreferencesPanelTimeStamps.16=Erro OID
PreferencesPanelTimeStamps.17=Cancelar
PreferencesPanelTimeStamps.18=Pulse este bot\u00F3n para cancelar os cambios e volver \u00E1 pantalla anterior

PreferencesPanelTrustedSites.0=Configuraci\u00F3n das pol\u00EDticas de certificaci\u00F3n permitidas
PreferencesPanelTrustedSites.1=Di\u00E1logo para configurar que pol\u00EDticas de certificaci\u00F3n estar\u00E1n permitidas para as operaci\u00F3ns de firma
PreferencesPanelTrustedSites.10=Pulse este bot\u00F3n para aceptar os cambios e volver \u00E1 pantalla anterior
PreferencesPanelTrustedSites.11=Cancelar
PreferencesPanelTrustedSites.12=Pulse este bot\u00F3n para cancelar os cambios e volver \u00E1 pantalla anterior
PreferencesPanelTrustedSites.13=Erro
PreferencesPanelTrustedSites.14=Necesita engadir polo menos un OID para habilitar o filtro.
PreferencesPanelTrustedSites.2=<html>Agregue ou quite os OID das pol&iacute;ticas que desexe admitir en firmas electr&oacute;nicas.</html>
PreferencesPanelTrustedSites.3=Engadir OID:
PreferencesPanelTrustedSites.4=Agregar
PreferencesPanelTrustedSites.5=Pulse este bot\u00F3n para engadir o sitio seleccionado
PreferencesPanelTrustedSites.6=OID de pol\u00EDticas admitidas para firma:
PreferencesPanelTrustedSites.7=Quitar
PreferencesPanelTrustedSites.8=Pulse este bot\u00F3n para quitar o sitio seleccionado
PreferencesPanelTrustedSites.9=Aceptar

PreferencesPanelPolicy.0 = Ocorreu un erro configurando a pol\u00edtica
PreferencesPanelPolicy.1 = O identificador de pol\u00edtica non pode ser nulo nin baleiro
PreferencesPanelPolicy.2 = O identificador debe ser un URI v\u00e1lida
PreferencesPanelPolicy.3 = Se se indica a pegada dixital \u00e9 obrigatorio indicar tam\u00e9n o algoritmo
PreferencesPanelPolicy.4 = Se non se especifica a pegada dixital, o identificador debe ser unha URI accesible
PreferencesPanelPolicy.5 = A pegada dixital debe estar en formato Base64
PreferencesPanelPolicy.6 = O calificador debe ser un URI v\u00e1lida
PreferencesPanelPolicy.7 = O identificador debe ter un formato OID v\u00e1lido
PreferencesPanelPolicy.8 = A pegada dixital non pode estar baleira
PreferencesPanelPolicy.9 = O calificador debe ser un URL v\u00e1lida

ProxyDialog.0=Configuraci\u00F3n de proxy
ProxyDialog.1=O host non \u00E9 v\u00E1lido
ProxyDialog.10=<html>Conexi&oacute;n <i>incorrecta</i></html>
ProxyDialog.11=Autodetectar
ProxyDialog.12=Panel para configurar un servidor de proxy
ProxyDialog.13=Pulse este bot\u00F3n para autodetectar se hai proxys no sistema
ProxyDialog.14=Non se detectaron proxies no sistema
ProxyDialog.15=A configuraci\u00F3n de proxy apl\u00EDcase a HTTP, HTTPS, FTP e SOCKS.
ProxyDialog.16=Usuario:
ProxyDialog.17=Contrasinal:
ProxyDialog.18=Non se puido cargar o contrasinal do proxy. Se omitir\u00E1 o valor actual.
ProxyDialog.19=Non se puido gardar o contrasinal do proxy. Ignorarase a contrase\u00F1 establecida.
ProxyDialog.2=Erro
ProxyDialog.20=Non usar proxy para as seguintes IP e direcci\u00F3ns de dominio:
ProxyDialog.21=<html>As direcci&oacute;ns sep&aacute;ranse con comas (,) e p&oacute;dese utilizar asterisco (*) ao principio<br>e fin das direcci&oacute;ns como comod&iacute;n.</html>
ProxyDialog.22=Sen proxy
ProxyDialog.23=Usar a configuraci\u00F3n de proxy do sistema
ProxyDialog.24=Configuraci\u00F3n manual do proxy
ProxyDialog.3=O porto non \u00E9 v\u00E1lido
ProxyDialog.4=Usar un servidor proxy para as conexi\u00F3ns de rede.
ProxyDialog.5=Host: 
ProxyDialog.6=Pulse este bot\u00F3n para comprobar a conexi\u00F3n dos datos introducidos
ProxyDialog.7=Porto:
ProxyDialog.8=Verificar conexi\u00F3n
ProxyDialog.9=<html>Conexi&oacute;n <i>correcta</i></html>

SecureDomainsDialog.0=Listaxe de dominios seguros
SecureDomainsDialog.1=Erro
SecureDomainsDialog.2=<html>Consid&eacute;ranse dominios seguros todos aqueles nos que a conexi&oacute;n est&aacute; cifrada<br>cun certificado SSL reco\u00F1ecido internacionalmente, vixente e emitido para o dominio<br>en cuesti&oacute;n. Adicionalmente, consideraranse dominios seguros todos aqueles<br>recollidos nesta listaxe.</html>
SecureDomainsDialog.3=<html>As direcci&oacute;ns sep&aacute;ranse por comas (,) ou saltos de li\u00F1a e p&oacute;dense utilizar<br>asteriscos (*) ao principio e final de cada unha delas como comod&iacute;n.</html>
SecureDomainsDialog.4=Introduza s\u00F3 un tipo de separador entre direcci\u00F3ns. Comas ou saltos de li\u00F1a.
SecureDomainsDialog.5=Introduza polo menos un dominio.

TrustedCertificatesDialog.0=Certificados de confianza
TrustedCertificatesDialog.1=Certificados importados
TrustedCertificatesDialog.2=Importar...
TrustedCertificatesDialog.3=Ver certificado
TrustedCertificatesDialog.5=Eliminar
TrustedCertificatesDialog.6=Importar certificados
TrustedCertificatesDialog.7=<html>Agregue novos certificados ao seu almac&eacute;n de confianza para permitir a conexi&oacute;n aos sitios <br>web que os utilicen.</html>
TrustedCertificatesDialog.8=Importar certificado local
TrustedCertificatesDialog.9=Carga un certificado en disco para revisar e importar no almac\u00E9n de confianza.
TrustedCertificatesDialog.10=Importar certificado desde URL
TrustedCertificatesDialog.11=URL
TrustedCertificatesDialog.12=Obter certificado
TrustedCertificatesDialog.13=Examinar
TrustedCertificatesDialog.14=Confirmar importaci\u00F3n do certificado
TrustedCertificatesDialog.15=Carg\u00E1ronse os seguintes certificados:
TrustedCertificatesDialog.17=Ver certificado
TrustedCertificatesDialog.18=Omitir
TrustedCertificatesDialog.19=Importar certificados
TrustedCertificatesDialog.20=Seleccione o certificado a importar
TrustedCertificatesDialog.21=Certificados dixitais (*.cer, *.cert, *.crt)
TrustedCertificatesDialog.22=Verificaci\u00F3n de dominio
TrustedCertificatesDialog.23=<html>Tratouse de conectar co dominio<br> %0 que presenta un certificado SSL que non &eacute; de confianza. <br>Desexa importar este certificado ao seu almac&eacute;n de confianza?</html>
TrustedCertificatesDialog.24=Paso 1: Verifique o seu certificado.
TrustedCertificatesDialog.25=Paso 2: Importe o certificado se o considera de confianza.
TrustedCertificatesDialog.26=Erro ao crear almac\u00E9n de confianza.
TrustedCertificatesDialog.27=Erro ao obter o certificado.
TrustedCertificatesDialog.28=Pechar
TrustedCertificatesDialog.29=\u00BFEst\u00E1 seguro de que quere eliminar o certificado '%0'?
TrustedCertificatesDialog.30=Erro ao eliminar certificado de confianza.
TrustedCertificatesDialog.31=Non se indicou un URL v\u00E1lida.
TrustedCertificatesDialog.32=Non se puido cargar o almac\u00E9n de confianza de Autofirma. Queres rexenerar?
TrustedCertificatesDialog.33=Nome
TrustedCertificatesDialog.34=Emitido por
TrustedCertificatesDialog.35=Data de expiraci\u00F3n

PolicyDialog.0=Configuraci\u00F3n da pol\u00EDtica de firma
PolicyDialog.1=O identificador da pol\u00EDtica non \u00E9 v\u00E1lido 
PolicyDialog.2=Erro

SmartCardDialog.0=Agregar cart\u00F3n como almac\u00E9n de claves
SmartCardDialog.1=Nome do cart\u00F3n
SmartCardDialog.2=Controlador PKCS#11
SmartCardDialog.3=Examinar
SmartCardDialog.4=Conectar
SmartCardDialog.5=Introducir un nome para o cart\u00F3n que se quere engadir
SmartCardDialog.6=Ruta do controlador PKCS#11 correspondente ao cart\u00F3n
SmartCardDialog.7=Seleccionar controlador
SmartCardDialog.8=Controladores PKCS\#11
SmartCardDialog.9=Modificar cart\u00F3n
SmartCardDialog.10=Eliminar cart\u00F3n

ShowFileLinkAction.1=Gardar datos
ShowFileLinkAction.2=Non se puido abrir o ficheiro,\ncompruebe que disp\u00F3n dunha aplicaci\u00F3n instalada para visualizar ficheiros '%0'
ShowFileLinkAction.3=Non se puido gardar o ficheiro
ShowFileLinkAction.4=Erro
ShowFileLinkAction.5=documento

SignatureAttributesDialog.0=Atributos de firma
SignatureAttributesDialog.1=<html>Ademais dos datos, a data e hora e o certificado de firma que seleccione,<br>a firma electr&oacute;nica do documento incluir&aacute; os seguintes atributos:</html>
SignatureAttributesDialog.2=Pol\u00EDtica de firma:
SignatureAttributesDialog.3=Identificador:
SignatureAttributesDialog.4=Pegada dixital: 
SignatureAttributesDialog.5=Algoritmo de pegada: 
SignatureAttributesDialog.6=Descrici\u00F3n: 
SignatureAttributesDialog.7=Referencia: 
SignatureAttributesDialog.8=Lugar de firma:
SignatureAttributesDialog.9=Direcci\u00F3n: 
SignatureAttributesDialog.10=Cidade: 
SignatureAttributesDialog.11=Provincia: 
SignatureAttributesDialog.12=C\u00F3digo postal: 
SignatureAttributesDialog.13=Pa\u00EDs: 
SignatureAttributesDialog.14=Rol de firma:
SignatureAttributesDialog.15=Roles declarados: 
SignatureAttributesDialog.16=<html>A firma realizarase sobre os datos do documento, a data e hora e o certificado de firma que seleccione.<br>Non se definiron atributos de firma adicionais.</html>
SignatureAttributesDialog.17=Raz\u00F3n de firma:
SignatureAttributesDialog.18=Informaci\u00F3n de contacto:
SignatureAttributesDialog.19=Informaci\u00F3n adicional:

ChangeFormatDialog.0=Configuraci\u00F3n de firma
ChangeFormatDialog.1=Seleccione o formato de firma que se utilizar\u00E1 para o ficheiro:
ChangeFormatDialog.2=(Recomendado)

SignDataPanel.0=Ficheiro de firma
SignDataPanel.1=Ruta do ficheiro de firma analizado
SignDataPanel.10=Ficheiro de tipo Factura Electr\u00F3nica (XML) asinada
SignDataPanel.12=Pulse na descrici\u00F3n do certificado para obter informaci\u00F3n adicional sobre el ou engadilo ao almac\u00E9n de certificados do seu sistema operativo
SignDataPanel.13=Descrici\u00F3n do certificado
SignDataPanel.14=Informaci\u00F3n resumida do certificado, pulse sobre esta para abrir unha nova xanela con informaci\u00F3n adicional
SignDataPanel.15=Comprobar validez
SignDataPanel.16=Comproba a validez do certificado contra o OCSP da s\u00FAa autoridade de certificaci\u00F3n
SignDataPanel.17=Bot\u00F3n para validar o certificado
SignDataPanel.18=Comproba a validez do certificado contra o OCSP da s\u00FAa autoridade de certificaci\u00F3n
SignDataPanel.2=Ficheiro asinado:
SignDataPanel.21=Certificado de firma utilizado:
SignDataPanel.22=Datos da firma:
SignDataPanel.23=Non se puido abrir o ficheiro,\ncompruebe que disp\u00F3n dunha aplicaci\u00F3n instalada para visualizar Certificados X.509
SignDataPanel.24=Datos en memoria
SignDataPanel.25=Formato de firma
SignDataPanel.26=Datos asinados
SignDataPanel.27=A firma non cont\u00E9n os datos asinados
SignDataPanel.28=Ver datos asinados
SignDataPanel.29=\u00C1rbol de firmas do documento
SignDataPanel.3=Ver ficheiro
SignDataPanel.30=Copiar a ruta do ficheiro
SignDataPanel.31=Firma electr\u00F3nica
SignDataPanel.32=Non se atoparon asinantes
SignDataPanel.4=Abre o ficheiro asinado coa aplicaci\u00F3n configurada no seu sistema operativo
SignDataPanel.40=Ficheiro de tipo Microsoft Office (OOXML)
SignDataPanel.41=Ficheiro de tipo OpenDocument (ODF)
SignDataPanel.42=Selos de tempo
SignDataPanel.43=Ficheiro
SignDataPanel.44=Formato
SignDataPanel.45=Tama\u00F1o
SignDataPanel.46=Ligaz\u00F3n a 
SignDataPanel.47=Lista de arquivos a asinar 
SignDataPanel.5=Bot\u00F3n para abrir os datos asinados
SignDataPanel.6=Abre o documento asinado coa aplicaci\u00F3n configurada no sistema
SignDataPanel.7=Non se puido abrir o ficheiro,\ncompruebe que non foi manipulado mentres se executaba esta aplicaci\u00F3n\n e que disp\u00F3n dunha aplicaci\u00F3n instalada para visualizalo
SignDataPanel.9=Ficheiro de tipo Portable Document Format (PDF)
SignDetailPanel.0=Asinar m\u00E1is ficheiros

MassiveResultProcessPanel.0=Directorio de sa\u00EDda
MassiveResultProcessPanel.1=Ruta do directorio no que se almacenaron as firmas
MassiveResultProcessPanel.10=Tama\u00F1o
MassiveResultProcessPanel.11=Estado
MassiveResultProcessPanel.12=Lista de documentos asinados 
MassiveResultProcessPanel.13=Firma correcta 
MassiveResultProcessPanel.14=Firma incorrecta  
MassiveResultProcessPanel.2=Copiar a ruta do directorio
MassiveResultProcessPanel.3=Directorio de firmas:
MassiveResultProcessPanel.4=Abrir directorio
MassiveResultProcessPanel.5=Abre o directorio coas firmas xeradas no seu explorador de arquivos
MassiveResultProcessPanel.6=Bot\u00F3n para abrir o directorio
MassiveResultProcessPanel.7=Abre o directorio coas firmas xeradas no seu explorador de arquivos
MassiveResultProcessPanel.8=Non se puido abrir o ficheiro,\ncompruebe que non foi manipulado mentres se executaba esta aplicaci\u00F3n
MassiveResultProcessPanel.9=Ficheiro

SignPanel.0=Ficheiro de tipo Portable Document Format (PDF)
SignPanel.1=O ficheiro \u00E9 demasiado grande e non se pode asinar por falta de memoria
SignPanel.10=Documento XML
SignPanel.11=Documento binario xen\u00E9rico
SignPanel.12=Ficheiro binario xen\u00E9rico
SignPanel.13=Por favor, espere mentres se inicializa o almac\u00E9n de claves
SignPanel.14=Benvido a Autofirma
SignPanel.15=Asinando electronicamente o ficheiro
SignPanel.16=Engadir firma
SignPanel.17=Ficheiro de tipo Factura-e (Factura Electr\u00F3nica)
SignPanel.19=Non se puido completar a selecci\u00F3n de certificados.
SignPanel.20=Factura-e (Factura Electr\u00F3nica)
SignPanel.21=Non se permite a sinatura de directorios,\n\u00FAnicamente de ficheiros individuais.
SignPanel.22=T\u00E9ntase cargar unha factura electr\u00F3nica xa asinada. Non se permite agregar novas firmas a\r\nuna factura electr\u00F3nica. Cancelarase a operaci\u00F3n.
SignPanel.23=O contrasinal proporcionado para asinar o PDF non \u00E9 v\u00E1lida.
SignPanel.24=Non se soporta a sinatura de ficheiros remotos con esta aplicaci\u00F3n,\nseleccione un ficheiro local para asinar
SignPanel.25=Asinando...
SignPanel.26=O ficheiro \u00E9 demasiado grande.\nSu sistema non pode asinar ficheiros tan grandes por falta de memoria.
SignPanel.29=O almac\u00E9n non cont\u00E9n ning\u00FAn certificado que se poida usar para asinar.
SignPanel.3=O ficheiro seleccionado non existe, e por tanto non pode asinarse.
SignPanel.30=Documento OpenDocument (ODF)
SignPanel.31=Ficheiro ODF (Open Document Format)
SignPanel.32=Seleccionar ficheiros a asinar
SignPanel.33=Pulse este bot\u00F3n ou arrastre un ficheiro \u00E1 \u00E1rea inferior para iniciar o proceso de selecci\u00F3n de ficheiro a asinar
SignPanel.34=Bot\u00F3n de selecci\u00F3n de ficheiro a asinar
SignPanel.35=Seleccione o ficheiro a asinar
SignPanel.36=Non se puido ler o contido do ficheiro a asinar,\ncompruebe que non esta aberto por outra aplicaci\u00F3n e\nsi est\u00E1 en almacenamento extraible probe a expulsar\ne inserir de novo
SignPanel.37=Documento Microsoft Office (OOXML)
SignPanel.38=Ficheiro OOXML (Office Open XML)
SignPanel.39=Documento de firma
SignPanel.40=<html><p>Nesta pantalla pode asinar electronicamente ficheiros que se atopen no seu disco duro.<br>Cando firma electronicamente un ficheiro poden incorporarse a estes certos datos persoais, entre os que poden atoparse o seu n&uacute;mero de DNI, o seu nome e apelidos ou mesmo informaci&oacute;n sobre a s&uacute;a situaci&oacute;n laboral se utiliza un certificado profesional. Consulte as pol&iacute;ticas de seguridade e protecci&oacute;n de datos dos receptores dos ficheiros asinados antes de envialos ou distribu&iacute;los.</p>A partir deste punto, se insere ou extrae un cart&oacute;n intelixente ou dispositivo criptogr&aacute;fico USB deber&aacute; seleccionar o almac&eacute;n de claves apropiado desde o di&aacute;logo de selecci&oacute;n de certificados ou pulsar o bot&oacute;n Actualizar para recargar o almac&eacute;n seleccionado.</html>
SignPanel.41=Pulse o bot\u00F3n ou arrastre ficheiros ou directorios a esta \u00E1rea
SignPanel.42=Arrastre un ficheiro a esta \u00E1rea para seleccionalo e poder asinar electronicamente
SignPanel.43=Panel de arrastre de ficheiro
SignPanel.44=Facer a firma visible dentro do PDF
SignPanel.45=Asinar
SignPanel.46=Tipo de ficheiro: %0
SignPanel.47=Data \u00FAltima modificaci\u00F3n: %0
SignPanel.48=<html>Realizando a firma electr&oacute;nica...<br>Esta tarefa pode tardar varios minutos.</html>
SignPanel.49=Tama\u00F1o: 
SignPanel.5=O ficheiro seleccionado est\u00E1 baleiro.\nNo \u00E9 posible asinar ficheiros baleiros.
SignPanel.50=Proceso de firma electr\u00F3nica
SignPanel.51=Ver Ficheiro
SignPanel.52=Bot\u00F3n de ver ficheiro
SignPanel.53=Non se puido abrir o ficheiro.\nCompruebe que disp\u00F3n dunha aplicaci\u00F3n instalada para ver este tipo de ficheiros\ny que este non foi manipulado mentres se executaba esta aplicaci\u00F3n
SignPanel.55=Non se atopou ning\u00FAn certificado para asinar,\nCompruebe o seu almac\u00E9n de claves e importe un se \u00E9 necesario
SignPanel.56=Atopouse un erro durante a operaci\u00F3n co certificado seleccionado.
SignPanel.6=Ficheiro de firma 
SignPanel.65=Ocorreu un problema durante o proceso de firma, probe a reintentar\nla firma reiniciando a aplicaci\u00F3n
SignPanel.7=Non se te\u00F1en permisos de lectura para o ficheiro seleccionado.\nSeleccione outro ficheiro ou habilite os permisos de lectura para este.
SignPanel.72=Documentos Adobe PDF (*.pdf)
SignPanel.76=Firmas XML (*.xml, *.xsig)
SignPanel.8=Ficheiro de tipo XML
SignPanel.80=Firmas binarias (*.csig, *.p7s)
SignPanel.81=Gardar ficheiro asinado
SignPanel.84=Xa existe un ficheiro con ese nome,\nQueres sobreescribirlo?
SignPanel.88=Non se puido gardar o resultado da firma, asegures\u00E9 de\nque o ficheiro seleccionado non est\u00E1 aberto por outra aplicaci\u00F3n e\nde que conta cos permisos adecuados e reintente a operaci\u00F3n
SignPanel.89=Non se puido gardar os datos, asegures\u00E9 de\nque o ficheiro seleccionado non est\u00E1 aberto por outra aplicaci\u00F3n e\nde que conta cos permisos adecuados e reintente a operaci\u00F3n
SignPanel.9=Documento Adobe PDF
SignPanel.91=Documentos Microsoft Word (*.docx)
SignPanel.92=Documentos Microsoft PowerPoint (*.pptx)
SignPanel.93=Documentos Microsoft Excel (*.xslx)
SignPanel.94=Documentos Microsoft Office (*.ooxml)
SignPanel.96=Textos de OpenDocument (*.odt)
SignPanel.97=Presentaci\u00F3ns de OpenDocument (*.odp)
SignPanel.98=Follas de c\u00E1lculo de OpenDocument (*.ods)
SignPanel.99=Documentos OpenDocument (*.odf)
SignPanel.100=Non se puideron gardar os par\u00E1metros da firma visible
SignPanel.101=O arquivo non \u00E9 un formato de im\u00E1gen valido
SignPanel.102=O documento indicado non permite que se lle agreguen firmas
SignPanel.103=Formato: %0 
SignPanel.104=Firma PDF
SignPanel.105=Sinatura de Facturae
SignPanel.106=Firma XAdES
SignPanel.107=Firma CAdES
SignPanel.108=Firma ODF
SignPanel.109=Firma OOXML
SignPanel.110=Formato desco\u00F1ecido
SignPanel.111=O plugin %0 devolveu un erro ao procesar os datos de entrada: %1
SignPanel.112=O plugin %0 devolveu un erro ao procesar a firma xerada: %1
SignPanel.113=Non se puido cargar a listaxe de plugins. Non se usasen para o procesado dos datos.
SignPanel.114=Non se puido cargar a listaxe de plugins. Non se usasen para o procesado da firma.
SignPanel.115=O plugin %0 devolveu un erro ao reiniciarse para permitir novas firmas: %1
SignPanel.116=Cofirma
SignPanel.117=Contrafirma (unicamente dos nodos folla)
SignPanel.118=Contrafirma (de toda a \u00E1rbore)
SignPanel.119=Opci\u00F3ns Avanzadas
SignPanel.120=Inserir unha marca visible dentro do PDF
SignPanel.121=Non se poden aplicar marcas visibles a documentos xa asinados
SignPanel.123=Non se puido cargar o ficheiro seleccionado.
SignPanel.124=Tipo de certificado non soportado: %0
SignPanel.125=Non se atopan os datos asinados
SignPanel.126=Informaci\u00F3n corrupta
SignPanel.127=A firma non se corresponde cos datos asinados
SignPanel.128=Non se atopa a sinatura dentro do documento
SignPanel.129=Non se pode extraer un certificado ou non \u00E9 v\u00E1lido
SignPanel.130=Certificado de firma caducado
SignPanel.131=Certificado de firma que a\u00EDnda non \u00E9 v\u00E1lido
SignPanel.132=Algoritmo non reco\u00F1ecido ou non soportado
SignPanel.133=Non se soporta o CA de expedici\u00F3n
SignPanel.134=CRLs de firma err\u00F3neas
SignPanel.135=Non se pode comprobar a validez da firma PDF
SignPanel.136=Non se pode comprobar a validez da firma OOXML
SignPanel.137=Non se pode comprobar a validez da firma ODF
SignPanel.138=Non se pode comprobar a validez da firma
SignPanel.139=Formato de firma non reco\u00F1ecido
SignPanel.140=Firma inv\u00E1lida
SignPanel.141=Non se pode completar a validaci\u00F3n
SignPanel.142=Configuraci\u00F3n de firma:
SignPanel.143=Atributos de firma:
SignPanel.144=Roles do asinante: %0
SignPanel.145=Informaci\u00F3n do documento:
SignPanel.146=Ver todos os atributos...
SignPanel.147=(Firma inv\u00E1lida)
SignPanel.148=Ver atributos de firma
SignPanel.149=Lugar de firma
SignPanel.150=Non se pode asinar con formato Facturae a factura xa asinada
SignPanel.151=\u00E9 posible que o documento se modificase despues de asinarse
SignPanel.152=Posible solapamiento entre firmas visibles
SignPanel.153=Confirmaci\u00F3n requirida
SignPanel.154=Non se puido completar a firma: %0
SignPanel.155=Resultado de validaci\u00F3n:
SignPanel.156=Firma v\u00E1lida
SignPanel.157=(Cambiar)
SignPanel.158=Non se poden agregar firmas certificadas a un documento xa asinado
SignPanel.159=O documento certificado non permit\u00EDa novas firmas

SignPanelSignTask.0=<html>Creando previsualizaci&oacute;n do PDF.<br>Esta tarefa pode tardar varios minutos.</html>
SignPanelSignTask.1=Selecci\u00F3n de campo PDF para firma visible
SignPanelSignTask.3=Seleccione o directorio de sa\u00EDda
SignPanelSignTask.4=Confirmaci\u00F3n requirida

SignResultPanel.0=Non foi posible recuperar a informaci\u00F3n adicional,\npruebe a abrir a seguinte URL desde un navegador Web:\n
SignResultPanel.10=A firma electr\u00F3nica \u00E9 v\u00E1lida en canto a estrutura
SignResultPanel.11=Non se puido completar a validaci\u00F3n
SignResultPanel.12=Ocorreu un erro que impediu a validaci\u00F3n da firma electr\u00F3nica.
SignResultPanel.13=Desco\u00F1\u00E9cese a validez da firma
SignResultPanel.14=Firma electr\u00F3nica corrupta.
SignResultPanel.15=Non se disp\u00F3n dos datos orixinais para a validaci\u00F3n da firma electr\u00F3nica.
SignResultPanel.16=Alg\u00FAn dos certificados de firma est\u00E1 caducado.
SignResultPanel.17=Alg\u00FAn dos certificados de firma a\u00EDnda non \u00E9 v\u00E1lido.
SignResultPanel.18=Non se puido extraer o certificado de firma ou este est\u00E1 corrupto.
SignResultPanel.19=Os datos contidos ou referenciados na firma non se corresponden cos datos asinados.
SignResultPanel.2=Proceso de firma completado satisfactoriamente
SignResultPanel.21=Ocorreu un problema procesando as listas de certificados revogados.
SignResultPanel.20=Detectouse un erro no CRL da firma.
SignResultPanel.22=Atopouse un algoritmo non reco\u00F1ecido ou non soportado.
SignResultPanel.23=Produc\u00EDronse erros ao asinar un ou varios dos documentos seleccionados. 
SignResultPanel.24=Comprobe a validez da firma na s\u00FAa aplicaci\u00F3n de lectura de PDF.
SignResultPanel.25=Comprobe a validez da firma coa \u00FAltima versi\u00F3n dispo\u00F1ible de Microsoft Office.
SignResultPanel.26=Comprobe a validez da firma coa \u00FAltima versi\u00F3n dispo\u00F1ible do seu programa compatible con OpenDocument (LibreOffice, Apache OpenOffice, etc.)
SignResultPanel.27=Proceso finalizado correctamente
SignResultPanel.28=Todas as firmas xer\u00E1ronse correctamente. Pode validar estas ou outras firmas electr\u00F3nicas en:
SignResultPanel.29=Todas as firmas do lote xer\u00E1ronse correctamente.
SignResultPanel.30=Proceso finalizado con erros
SignResultPanel.31=Ocorreu un erro ao asinar un ou varios dos documentos seleccionados. Comprobe que estes documentos existen e poden lerse. Firme os documentos individualmente se persiste o problema. Pode validar as firmas xeradas correctamente en:
SignResultPanel.32=Ocorreu un erro ao asinar alg\u00FAn dos documentos seleccionados.
SignResultPanel.33=https://valide.redsara.es/
SignResultPanel.34=Non se puido aplicar a firma visible correctamente aos seguintes documentos, \nya que a posici\u00F3n ou p\u00E1xinas onde introducir a mesma atop\u00E1base f\u00F3ra de rango:\n
SignResultPanel.35=Atop\u00E1ronse cambios nun formulario do PDF posteriores \u00E1 firma.
SignResultPanel.36=\u00E9 probable que o documento fose modificado despois da \u00FAltima firma.
SignResultPanel.37=Hai firmas solapadas no documento, o cal pode ocultar informaci\u00F3n do mesmo.
SignResultPanel.38=Detalles da firma
SignResultPanel.39=Non se permite a validaci\u00F3n de firmas con referencias externas.
SignResultPanel.40=A firma cont\u00E9n atributos lonxevos que Autofirma non pode validar. Para unha validaci\u00F3n completa acuda a VALIDe.
SignResultPanel.3=A firma \u00E9 correcta en canto a estrutura, pero para determinar a s\u00FAa completa validez legal debe comprobar ademais a validez dos certificados usados. Para iso, pode validar esta ou outras firmas electr\u00F3nicas en:
SignResultPanel.4=Xerouse correctamente unha firma electr\u00F3nica
SignResultPanel.5=A firma non \u00E9 v\u00E1lida ou non est\u00E1 soportada
SignResultPanel.6=A firma electr\u00F3nica seleccionada non \u00E9 v\u00E1lida
SignResultPanel.8=Firma electr\u00F3nica v\u00E1lida
SignResultPanel.9=A firma \u00E9 correcta en canto a estrutura, pero para determinar a s\u00FAa completa validez legal debe comprobar ademais a validez dos certificados usados. Pode validar esta ou outras firmas electr\u00F3nicas en:

ValidationInfoDialog.0=Detalles da firma e erros de validaci\u00F3n
ValidationInfoDialog.1=Informaci\u00F3n sobre a firma:
ValidationInfoDialog.2=Certificado caducado.
ValidationInfoDialog.3=Certificado non v\u00E1lido a\u00EDnda.
ValidationInfoDialog.4=Non se puido verificar a informacion do asinante.
ValidationInfoDialog.5=A clave de firma non \u00E9 v\u00E1lida ou non \u00E9 compatible co algoritmo de sinatura declarado.
ValidationInfoDialog.6=Cidade
ValidationInfoDialog.7=Estado ou provincia
ValidationInfoDialog.8=C\u00F3digo postal
ValidationInfoDialog.9=Pa\u00EDs
ValidationInfoDialog.10=Papel do asinante
ValidationInfoDialog.11=R\u00FAa
ValidationInfoDialog.12=A firma at\u00F3pase dentro do XML asinado.
ValidationInfoDialog.14=Datos anexos \u00E1 firma.
ValidationInfoDialog.16=Relaci\u00F3n interna de datos.
ValidationInfoDialog.17=Non se puido ler correctamente o ficheiro de firma.
ValidationInfoDialog.18=Raz\u00F3n de firma
ValidationInfoDialog.19=Localizaci\u00F3n
ValidationInfoDialog.20=Informaci\u00F3n de contacto
ValidationInfoDialog.21=A firma cont\u00E9n os datos.
ValidationInfoDialog.22=A firma non cont\u00E9n os datos.
ValidationInfoDialog.23=Localidade
ValidationInfoDialog.24=Datos binarios
ValidationInfoDialog.25=PDF
ValidationInfoDialog.26=XML
ValidationInfoDialog.27=PostScript
ValidationInfoDialog.28=HTML
ValidationInfoDialog.29=TIFF
ValidationInfoDialog.30=GIF
ValidationInfoDialog.31=JPEG
ValidationInfoDialog.32=PNG
ValidationInfoDialog.33=MPEG
ValidationInfoDialog.34=SGML
ValidationInfoDialog.35=Microsoft Word
ValidationInfoDialog.36=Microsoft Excel
ValidationInfoDialog.37=Microsoft Project
ValidationInfoDialog.38=Microsoft Powerpoint
ValidationInfoDialog.38=Microsoft Works
ValidationInfoDialog.39=JPG
ValidationInfoDialog.40=Correcta. Non se realizou a comprobaci\u00F3n de revogaci\u00F3n do certificado.
ValidationInfoDialog.41=Non se admiten cambios.
ValidationInfoDialog.42=S\u00F3 perm\u00EDtense acci\u00F3ns de enchido de formularios, firma e adici\u00F3n de p\u00E1xinas.
ValidationInfoDialog.43=S\u00F3 perm\u00EDtense acci\u00F3ns de comentarios, enchido de formularios, firma e adici\u00F3n de p\u00E1xinas.
ValidationInfoDialog.44=Formato
ValidationInfoDialog.45=Localizaci&oacute;n dos datos
ValidationInfoDialog.46=Informaci&oacute;n sobre datos asinados
ValidationInfoDialog.47=Descrici&oacute;n
ValidationInfoDialog.48=Tipo de documento
ValidationInfoDialog.49=&Aacute;rbore de asinantes
ValidationInfoDialog.50=Resultado da validaci&oacute;n
ValidationInfoDialog.51=Firma
ValidationInfoDialog.52=Perfil de firma
ValidationInfoDialog.53=PDF certificado
ValidationInfoDialog.54=Algoritmo de firma
ValidationInfoDialog.55=Data e hora de firma
ValidationInfoDialog.56=Pol&iacute;tica de firma
ValidationInfoDialog.57=Identificador
ValidationInfoDialog.58=Hash
ValidationInfoDialog.59=Algoritmo
ValidationInfoDialog.60=Calificador
ValidationInfoDialog.61=Metadatos
ValidationInfoDialog.62=Roles
ValidationInfoDialog.63=Certificado
ValidationInfoDialog.64=Nome
ValidationInfoDialog.65=Emisor
ValidationInfoDialog.66=Data de caducidade
ValidationInfoDialog.67=Encoding
ValidationInfoDialog.68=Validaci&oacute;n

RestoreConfigPanel.1=Iniciar restauraci\u00F3n
RestoreConfigPanel.2=Pulse este bot\u00F3n para iniciar a restauraci\u00F3n da configuraci\u00F3n en navegadores e conexi\u00F3ns de Autofirma.
RestoreConfigPanel.3=Bot\u00F3n para iniciar o proceso de restauraci\u00F3 da configuraci\u00F3n de navegadores e conexi\u00F3ns de Autofirma.
RestoreConfigPanel.4=<html><p>Autofirma permite xerar firmas electr\u00F3nicas como parte dun tr\u00E1mite web compatible de administraci\u00F3n electr\u00F3nica. Para iso \u00E9 necesario que o seu sistema se atope correctamente configurado. Se instala un novo navegador web, d\u00E1se de alta un novo usuario no sistema ou tes problemas ao asinar nun tr\u00E1mite web, utilice esta funci\u00F3n para restaurar a comunicaci\u00F3n entre Autofirma e os seus navegadores web.</p>
RestoreConfigPanel.5=Pechar
RestoreConfigPanel.6=Pecha o di\u00E1logo de restauraci\u00F3n
RestoreConfigPanel.7=Configurar Firefox para que conf\u00EDe na certificados ra\u00EDz do sistema.
RestoreConfigPanel.8=Ao activar, config\u00FArase Firefox para que conf\u00FDe nos certificados das entidades de certificaci\u00F3n ra\u00FDz de confianza do sistema. Se non se activa, desactivarase esta opci\u00F3n de Firefox. 
RestoreConfigPanel.9=Casa de verificaci\u00F3n para activar ou desactivar 

SimpleAfirma.0=Non se puido ler o contido do ficheiro a asinar,\ncompruebe que non esta aberto por outra aplicaci\u00F3n e\nsi est\u00E1 en almacenamento extraible probe a expulsar\ne inserir de novo
SimpleAfirma.10=Autofirma v%0
SimpleAfirma.11=Non se puido aplicar a configuraci\u00F3n de proxy configurada. Isto pode afectar o seu uso desde aplicaci\u00F3ns web. 
SimpleAfirma.2=O ficheiro non existe ou non \u00E9 accesible para lectura
SimpleAfirma.3=A aplicaci\u00F3n xa se est\u00E1 executando noutra xanela.\n\u00DAnicamente perm\u00EDtese unha instancia activa.
SimpleAfirma.4=Non se puideron cargar os plugins na aplicaci\u00F3n.
SimpleAfirma.42=Non se puido inicializar nin o seu DNIe nin o almac\u00E9n de claves do seu sistema operativo.\nNo poder\u00E1 realizar firmas electr\u00F3nicas.
SimpleAfirma.47=Queres pechar a aplicaci\u00F3n de firma?
SimpleAfirma.48=Advertencia
SimpleAfirma.49=Autofirma est\u00E1 a executarse con Java %0. Esta versi\u00F3n non est\u00E1 oficialmente soportada e poden producirse erros durante a s\u00FAa execuci\u00F3n.
SimpleAfirma.50=Versi\u00F3n de Java non soportada
SimpleAfirma.51=Non volver mostrar
SimpleAfirma.52=Ocorreu un erro inesperado ao executar a acci\u00F3n.
SimpleAfirma.53=Erro ao ler o arquivo de axuda.
SimpleAfirma.54=Erro ao seleccionar o almac\u00E9n configurado. Cargarase o do sistema.
SimpleAfirma.56=Erro ao ler almac\u00E9n. Cargarase o do sistema.
SimpleAfirma.57=Operaci\u00F3n cancelada. Cargarase o almac\u00E9n de claves do sistema.
SimpleAfirma.58=Non se puido cargar a axuda correctamente.
SimpleAfirma.6=Non se puido inicializar o almac\u00E9n de claves.\nNo poder\u00E1 realizar firmas electr\u00F3nicas.
SimpleAfirma.7=Erro
SimpleAfirma.8=Problema na operaci\u00F3n
SimpleAfirma.9=Non se permite agregar novas firmas a documentos con firmas non v\u00E1lidas. 

SimpleKeyStoreManager.0=Introduza o contrasinal mestre de Mozilla Firefox
SimpleKeyStoreManager.1=Non se detectou un DNIe inserido Queres reintentar?
SimpleKeyStoreManager.9=O seu DNIe est\u00E1 bloqueado, debe acudir a unha comisar\u00EDa de polic\u00EDa para desbloquear.\nSe continuar\u00E1 co almac\u00E9n por defecto do sistema.
SimpleKeyStoreManager.10=Detectado DNIe bloqueado
SimpleKeyStoreManager.11=Non se puido obter o almac\u00E9n de claves por defecto: %0 . Cargarase o do sistema.
SimpleKeyStoreManager.12=Contrasinal incorrecto
SimpleKeyStoreManager.13=Operaci\u00F3n cancelada. Cargarase o almac\u00E9n de claves do sistema.
SimpleKeyStoreManager.2=Non hai cart\u00F3n no lector
SimpleKeyStoreManager.3=O cart\u00F3n detectado no lector non \u00E9 un DNIe.\nQueres reintentar?
SimpleKeyStoreManager.4=Detectado cart\u00F3n incorrecta
SimpleKeyStoreManager.5=O seu DNIe est\u00E1 danado, debe acudir a unha comisar\u00EDa de polic\u00EDa para renovar.\nSe continuar\u00E1 co almac\u00E9n por defecto do sistema.
SimpleKeyStoreManager.6=Detectado DNIe danado
SimpleKeyStoreManager.7=Non foi posible inicializar o seu DNIe.\nSe continuar\u00E1 co almac\u00E9n por defecto do sistema.
SimpleKeyStoreManager.8=Erro na iniciaizaci\u00F3n do DNIe

VisorFirma.0=Visor de firmas electr\u00F3nicas
VisorFirma.1=Abrir
VisorPanel.0=Pechar visor
VisorPanel.1=Ver outra firma

ErrorPane.1=<a>Ver detalles</a>

TrayIcon.0=Utilice este men\u00FA para configurar as opci\u00F3ns de Autofirma.
TrayIcon.1=Accede ao di\u00E1logo  de preferencias de Autofirma.
TrayIcon.10=Selecci\u00F3n de Almac\u00E9n de certificados prioritario
TrayIcon.11=Selecciona o almac\u00E9n de claves e certificados prioritario da aplicaci\u00F3n.
TrayIcon.12=Ver Almac\u00E9n de certificados
TrayIcon.13=Mostra o contido do almac\u00E9n de claves e certificados por defecto da aplicaci\u00F3n.
TrayIcon.14=Non foi posible modificar a opci\u00F3n de inicio autom\u00E1tico de Autofirma
TrayIcon.15=Erro
TrayIcon.16=Selecci\u00F3n de Almac\u00E9n de certificados por defecto
TrayIcon.17=Selecciona o almac\u00E9n de claves e certificados por defecto da aplicaci\u00F3n.
TrayIcon.2=Pecha o men\u00FA de configuraci\u00F3n das opci\u00F3ns de Autofirma.
TrayIcon.20=Selecionar almac\u00E9n por defecto
TrayIcon.21=Selecionar almac\u00E9n prioritario
TrayIcon.22=<html><p>Usarase o almac&eacute;n prioritario sempre que estea presente, con preferencia sobre o almac&eacute;n por defecto.</p><p>Se se tratase dun cart&oacute;n intelixente, esta deber&aacute; permanecer inserida durante toda a execuci&oacute;n do programa.</p><br>Se non se establece un almac&eacute;n prioritario usarase sempre o por defecto.</html>
TrayIcon.3=Mostra informaci\u00F3n acerca de Autofirma.
TrayIcon.4=Habilita o inicio autom\u00E1tico de Autofirma mostrando unha icona na \u00E1rea de notificaci\u00F3ns.
TrayIcon.5=Preferencias
TrayIcon.6=Pechar
TrayIcon.7=Acerca de Autofirma
TrayIcon.8=Mostrar Icona
TrayIcon.9=Almac\u00E9n de certificados

TimestampsAnalyzer.0=Por favor, introduza o contrasinal do PDF

RestoreApplication.0=Ocorreu un erro durante a configuraci\u00F3n de Autofirma.\nAutofirma non poder\u00E1 comunicarse co seu navegador web.
RestoreApplication.1=Ocorreu un erro grave durante a configuraci\u00F3n de Autofirma.\nAutofirma non poder\u00E1 comunicarse co seu navegador web.
RestoreApplication.2=Erro
RestoreApplication.3=\ \ Erro ao copiar, ler ou eliminar alg\u00FAn dos ficheiros de configuraci\u00F3n
RestoreApplication.4=\ \ Erro ao xerar as claves de cifrado SSL
RestoreApplication.5=\ \ Erro na importacion do CA de confianza ou a limpeza do almacen
RestoreApplication.6=Non se se ten acceso \u00E1 rede. \u00E9 posible que isto afecte os procesos\nde firma na invocaci\u00F3n desde unha p\u00E1xina web.
RestoreApplication.7=Peche o navegador Mozilla Firefox para poder instalar o certificado de confianza de Autofirma no navegador.
RestoreApplication.8=Peche o navegador Chrome para rexistrar o protocolo de Autofirma no navegador.
RestoreApplication.9=Aviso
RestoreApplication.10=O certificado de confianza para a comunicaci\u00F3n entre Mozilla Firefox e Autofirma\nno puido instalarse. Para realizar esta operaci\u00F3n debe executar Autofirma en modo administrador.
RestoreApplication.11=Non se pechou o navegador Chrome. Peche o Chrome e pulse o bot\u00F3n OK para rexistrar\nel procolo de Autofirma no navegador. Se non pode ou non desexa pechar o navegador, pulse o\nbot\u00F3n Cancelar para continuar coa restauraci\u00F3n.
RestoreApplication.12=Non se pechou o navegador Firefox. Peche o Firefox e pulse o bot\u00F3n OK para poder\ninstalar o certificado de confianza de Autofirma no navegador. Se non necesita utilizar Autofirma\ndesde Firefox, pulse o bot\u00F3n Cancelar para continuar coa restauraci\u00F3n. 
RestoreApplication.13=INFO: Inicio da restauraci\u00F3n
RestoreApplication.14=INFO: Fin da restauraci\u00F3n

RestoreConfigWindows.0=O certificado de confianza para a comunicaci\u00F3n entre o o seu navegador Web e Autofirma\nno puido instalarse. Necesita instalar este certificado para poder realizar firmas desde\nsu navegador. Queres reintentar instalar este certificado?
RestoreConfigWindows.1=Erro
RestoreConfigWindows.11=INFO: Gardando en disco o certificados SSL...
RestoreConfigWindows.12=INFO: Non se detectaron perf\u00EDs de Mozilla Firefox no que instalar o certificado
RestoreConfigWindows.13=INFO: Instalando o certificado SSL no almac\u00E9n de Mozilla Firefox
RestoreConfigWindows.14=INFO: Utiliz\u00E1sense os certificados do directorio de instalaci\u00F3n
RestoreConfigWindows.16=INFO: Eliminando o certificados SSL anteriores...
RestoreConfigWindows.17=ERRO: Non se puido eliminar a versi\u00F3n previa dos certificados.
RestoreConfigWindows.18=INFO: Instalando certificados SSL no almac\u00E9n de Windows...
RestoreConfigWindows.20=ERRO: Non se importou a certificado ra\u00EDz CA "Autofirma ROOT" en almac\u00E9n de Windows. O proceso de restauraci\u00F3n continuar\u00E1 pero non estar\u00E1 completo ata importar o certificado no almac\u00E9n de Windows.
RestoreConfigWindows.22=INFO: Eliminando certificados anteriores do almac\u00E9n de Windows...
RestoreConfigWindows.24=INFO: Restaurando a configuraci\u00F3n do protocolo afirma no rexistro de Windows...
RestoreConfigWindows.25=ERRO: Non se puido restaurar o protocolo "afirma". Execute Autofirma con privilexios de administrador para realizar esta tarefa.
RestoreConfigWindows.26=INFO: A certificado ra\u00EDz xa se atopaba instalado no almac\u00E9n de Windows.
RestoreConfigWindows.27=ERRO: Non puido cargarse a certificado ra\u00EDz para a s\u00FAa instalaci\u00F3n.
RestoreConfigWindows.3=INFO: Directorio de aplicaci\u00F3n: %0
RestoreConfigWindows.31=ERRO: Non se puido instalar o certificado de confianza no almac\u00E9n de Firefox.
RestoreConfigWindows.32=ERRO: Cancelouse a instalaci\u00F3n do certificado no almac\u00E9n de Windows.
RestoreConfigWindows.33=ERRO: Non se puideron xerar e copiar a disco o certificados SSL para a conexi\u00F3n cos navegadores. Se omite o seu configuraci\u003Fn.
RestoreConfigWindows.34=ADVERTENCIA: Non se puido eliminar algunha importaci\u00F3n previa da certificado ra\u00EDz do almac\u00E9n de Windows
RestoreConfigWindows.35=INFO: Eliminando certificado anterior do almac\u00E9n de Windows. Comprobe se se abriu un di\u00E1logo en segundo plano pedindo confirmaci\u00F3n...
RestoreConfigWindows.36=INFO: Copiando o almacen SSL para a conexi\u00F3n con Autofirma WebStart...
RestoreConfigWindows.37=ADVERTENCIA: Non se puido copiar o almacen SSL para a conexi\u00F3n con Autofirma WebStart.
RestoreConfigWindows.38=INFO: Crearanse novos certificados SSL.
RestoreConfigWindows.39=INFO: Reutilizaranse os certificados do directorio de instalaci\u00F3n.
RestoreConfigWindows.4=ERRO: Non se cargar o certificado raiz do directorio de instalacion.
RestoreConfigWindows.41=INFO: Configuramos Firefox para que conf\u00EDe na certificados ra\u00EDz do almac\u00E9n de confianza do sistema.
RestoreConfigWindows.42=INFO: Rest\u00E1urase a configuraci\u00F3n de Firefox para que s\u00F3 conf\u00EDe nos certificados do seu almac\u00E9n.
RestoreConfigWindows.43=ERRO: Non se puido cambiar a confianza de Firefox no almac\u00E9n de certificados do sistema.
RestoreConfigWindows.44=INFO: Non se detectaron perf\u00EDs de Mozilla Firefox nos que configurar a confianza no almac\u00E9n do sistema.
RestoreConfigWindows.45=ADVERTENCIA: Non se pechou Firefox. \u00E9 posible que non poida executar Autofirma en todos os despregamentos desde este navegador.
RestoreConfigWindows.5=INFO: Xerando certificados para a comunicaci\u00F3n co navegador web...

ConfiguratorConsole.0=Configurador

RestoreConfigLinux.1=ERRO: Non se puido identificar un directorio de aplicaci\u00F3n ao que copiar os certificados. Ab\u00F3rtase a restauraci\u00F3n.
RestoreConfigLinux.10=ERRO: Non se puido instalar o certificado de confianza SSL no almac\u00E9n do sistema.
RestoreConfigLinux.11=INFO: Gardando almac\u00E9n de claves...
RestoreConfigLinux.12=ADVERTENCIA: Non se detectou un perfil de Mozilla Firefox no que instalar o certificado.
RestoreConfigLinux.13=INFO: Instalando o certificado de confianza SSL no almac\u00E9n de Mozilla Firefox...
RestoreConfigLinux.14=INFO: O certificado para a configuraci\u00F3n da canle segura xa se atopa xerado.
RestoreConfigLinux.15=INFO: Restaurando a configuraci\u00F3n do protocolo "afirma" en Mozilla Firefox... (Poida que solic\u00EDtenselle permisos de administrador)
RestoreConfigLinux.16=ERRO: Non se puido restaurar a configuraci\u00F3n do protocolo "afirma".
RestoreConfigLinux.17=ERRO: Non se puideron copiar as ferramentas de instalaci\u00F3n de certificados. Ab\u00F3rtase a restauraci\u00F3n do certificados SSL.
RestoreConfigLinux.18=ADVERTENCIA: Non se puido instalar o certificado de confianza SSL en todos os perf\u00EDs de Mozilla Firefox.
RestoreConfigLinux.19=INFO: Operaci\u00F3n cancelada polo usuario.
RestoreConfigLinux.2=ERRO: Non se puideron xerar os certificados de confianza SSL. Ab\u00F3rtase a restauraci\u00F3n do certificados SSL.
RestoreConfigLinux.3=INFO: Directorio de aplicaci\u00F3n: %0.
RestoreConfigLinux.4=ERRO: Non se puideron copiar os certificados de confianza SSL a disco.
RestoreConfigLinux.5=INFO: Xerando certificado para a comunicaci\u00F3n co navegador web...
RestoreConfigLinux.6=ERRO: Non se puideron localizar os directorios de usuario do sistema. Ab\u00F3rtase a restauraci\u00F3n do certificados SSL.
RestoreConfigLinux.9=INFO: Instalando o certificado no almac\u00E9n do sistema...

RestoreConfigMacOSX.1=ERRO: Non se te\u00F1en permisos sobre o directorio de aplicacion. Conceder manualmente repita a restauraci\u00F3n.
RestoreConfigMacOSX.10=ERRO: Non se te\u00F1en permisos para instalar o certificados SSL no almacen de confianza do sistema. Ab\u00F3rtase a restauraci\u00F3n do certificados SSL.
RestoreConfigMacOSX.11=ERRO: Non se puideron instalar o certificados SSL no almacen de confianza. Ab\u00F3rtase a restauraci\u00F3n do certificados SSL.
RestoreConfigMacOSX.12=ADVERTENCIA: Non se detectou un perfil de Mozilla Firefox no que instalar o certificado
RestoreConfigMacOSX.13=INFO: Instalando o certificado no almac\u00E9n de Mozilla Firefox...
RestoreConfigMacOSX.14=INFO: Xa se atopa xerado o certificado para a configuraci\u00F3n da canle segura.
RestoreConfigMacOSX.15=ERRO: Non se puido crear o script temporal para a execuci\u00F3n das operaci\u00F3ns
RestoreConfigMacOSX.17=INFO: Copiando o almacen SSL para a conexi\u00F3n con Autofirma WebStart...
RestoreConfigMacOSX.18=ADVERTENCIA: Non se puido copiar o almacen SSL para a conexi\u00F3n con Autofirma WebStart.
RestoreConfigMacOSX.19=ADVERTENCIA: Non se puido instalar o certificado de confianza SSL en todos os perf\u00EDs de Mozilla Firefox.
RestoreConfigMacOSX.20=ERRO: Non se puido instalar o certificado de confianza SSL no llavero do sistema.
RestoreConfigMacOSX.21=INFO: Configuramos Firefox para que conf\u00EDe na certificados ra\u00EDz do almac\u00E9n de confianza do sistema.
RestoreConfigMacOSX.22=INFO: Rest\u00E1urase a configuraci\u00F3n de Firefox para que s\u00F3 conf\u00EDe nos certificados do seu almac\u00E9n.
RestoreConfigMacOSX.23=ERRO: Non se puido cambiar a confianza de Firefox no almac\u00E9n de certificados do sistema.
RestoreConfigMacOSX.24=INFO: Non se detectaron perf\u00EDs de Mozilla Firefox nos que configurar a confianza no almac\u00E9n do sistema.
RestoreConfigMacOSX.25=INFO: Certificado de CA importado.
RestoreConfigMacOSX.26=INFO: Certificado SSL importado.
RestoreConfigMacOSX.27=<html><p>Non se puideron importar o certificados SSL no Llavero. Deber&aacute; instalar manualmente os seguintes\ncertificados para permitir o uso de Autofirma desde o navegador:</p>&nbsp;- %0<br>&nbsp;- %1</html>
RestoreConfigMacOSX.28=Erro na importaci\u00F3n
RestoreConfigMacOSX.29=Insira o contrasinal do administrador para a importaci\u00F3n dos certificados
RestoreConfigMacOSX.3=INFO: Directorio de aplicaci\u00F3n: %0 
RestoreConfigMacOSX.30=Contrasinal incorrecto. Insira o contrasinal do administrador para a importaci\u00F3n dos certificados
RestoreConfigMacOSX.31=Se cancela a importaci\u00F3n dos certificados non poder\u00E1 utilizar Autofirma desde o\nnavegador do sistema. Queres cancelar a instalacion?
RestoreConfigMacOSX.32=Cancelar importacion
RestoreConfigMacOSX.33=INFO: O usuario cancelo a importacion do certificados SSL no llavero.
RestoreConfigMacOSX.35=ADVERTENCIA: Non se puido configurar "certutil" polo que non se podran instalar os certificados no almacen de Firefox.
RestoreConfigMacOSX.36=INFO: Restauramos os certificados no perfil de Firefox: %0
RestoreConfigMacOSX.37=ADVERTENCIA: Non se ha puideron restaurar os certificados no perfil '%0'. \u00E9 posible que o usuario non pos\u00FAa permisos sobre o mesmo.
RestoreConfigMacOSX.38=INFO: Editamos a confianza de Firefox no almac\u00E9n do sistema para o perfil: %0
RestoreConfigMacOSX.39=ADVERTENCIA: Non se puido editar a confianza de Firefox no almac\u00E9n do sistema para o perfil '%0'. \u00E9 posible que o usuario non pos\u00FAa permisos sobre o mesmo.
RestoreConfigMacOSX.5=INFO: Xerando certificado para a comunicaci\u00F3n co navegador web...
RestoreConfigMacOSX.6=INFO: Importando certificado no almac\u00E9n de confianza do sistema...
RestoreConfigMacOSX.7=ERRO: Non se puideron copiar a disco o certificados SSL xerados. Ab\u00F3rtase a restauraci\u00F3n do certificados SSL.
RestoreConfigMacOSX.9=ERRO: Non se puideron xerar o certificados SSL. Ab\u00F3rtase a restauraci\u00F3n do certificados SSL.

ConfiguratorWindows.15=Non se puido configurar Chrome para o usuario: %1s
ConfiguratorWindows.16=Vaise a instalar o esquema "afirma" como protocolo seguro en Chrome

ConfiguratorGeneral.0=Non se puido iniciar o proceso de restauraci\u00F3n da configuraci\u00F3n. Debe pechar todos os navegadores antes de comezar.

PluginsManagementPanel.0=Plugins instalados
PluginsManagementPanel.1=Agregar
PluginsManagementPanel.2=Eliminar
PluginsManagementPanel.3=Informaci\u00F3n do plugin
PluginsManagementPanel.4=Configurar
PluginsManagementPanel.5=Pechar
PluginsManagementPanel.6=Pecha o panel de gesti\u00E3n de plugins
PluginsManagementPanel.7=Instala un novo plugin 
PluginsManagementPanel.8=Elimina o plugin seleccionado

PluginsManagementHandler.0=O plugin non \u00E9 v\u00E1lido e non se cargar\u00E1.
PluginsManagementHandler.1=Xa existe unha versi\u00F3n instalada do plugin "%0".\nQueres substitu\u00EDla pola nova versi\u00F3n?
PluginsManagementHandler.2=Ocorreu un erro ao instalar o plugin
PluginsManagementHandler.3=Cargar plugin
PluginsManagementHandler.4=Plugin de Autofirma
PluginsManagementHandler.5=Vaise a desinstalar o plugin "%0". Queres continuar?
PluginsManagementHandler.6=Ocorreu un erro desinstalar o plugin.
PluginsManagementHandler.7=Erro
PluginsManagementHandler.8=Non se puido cargar a lista de plugins.
PluginsManagementHandler.9=Versi\u00F3n:
PluginsManagementHandler.10=Autores:
PluginsManagementHandler.11=Contacto:
PluginsManagementHandler.12=Descrici\u00F3n:
PluginsManagementHandler.13=O di\u00E1logo de configuraci\u00F3n do plugin devolveu un erro. Consulte\ncon o desenvolvedor como resolver o problema.
PluginsManagementHandler.14=Desinstalar plugin
PluginsManagementHandler.15=Non se puido desinstalar a version anterior do plugin. Elimine manualmente o\ndirectorio do plugin do directorio de instalacion de Autofirma. 
PluginsManagementHandler.16=Instalar plugin
PluginsManagementHandler.17=A operaci\u00F3n finalizou correctamente. Reinicie a aplicaci\u00F3n para que os cambios\nsurtan efecto.
PluginsManagementHandler.18=Reiniciar Autofirma
PluginsManagementHandler.19=A operaci\u00F3n finalizou correctamente, pero \u00E9 necesario reiniciar a aplicaci\u00F3n para\nque os cambios fornezan efecto. Queres que se reinicie a aplicaci\u00F3n?
PluginsManagementHandler.20=O plugin non est\u00E1 asinado ou non est\u00E1 completamente asinado. Instalar s\u00F3 se conf\u00EDa na s\u00FAa orixe.\nQueres continuar coa instalaci\u00F3n?
PluginsManagementHandler.21=Plugin sen asinar
PluginsManagementHandler.22=O sinatura do plugin non \u00E9 v\u00E1lida. Instalar s\u00F3 se conf\u00EDa na s\u00FAa orixe.\nQueres continuar coa instalaci\u00F3n?
PluginsManagementHandler.23=O sinatura do plugin cont\u00E9n erros
PluginsManagementHandler.24=Ocorreu un erro durante a lectura do ficheiro de plugin.
PluginsManagementHandler.25=Certificado de firma

PluginManagementError.240000=Ocorreu un erro ao tentar cargar o plugin
PluginManagementError.240001=Ocorreu un erro ao desinstalar o plugin
PluginManagementError.240002=O propio plugin devolveu un erro durante a s\u00FAa instalaci\u00F3n
PluginManagementError.240003=Ocorreu un erro ao eliminar o plugin anterior
PluginManagementError.240004=Ocorreu un problema co directorio de instalaci\u00F3n

PluginManagementError.530001=Atop\u00F3ronse plugins mal definidos no ficheiro importado
PluginManagementError.530002=Non se atopou ning\u00FAn plugin nos arquivos
PluginManagementError.530003=Non se permite a carga simult\u00E1nea de varios plugins
PluginManagementError.530004=O plugin non definiu acci\u00F3n para un bot\u00F3n
PluginManagementError.530005=O plugin non definiu a xanela na que debe aparecer un bot\u00F3n
PluginManagementError.530006=O plugin definiu unha clase de acci\u00F3n err\u00F3nea
PluginManagementError.530007=O ficheiro cargado non \u00E9 v\u00E1lido para ser importado
PluginManagementError.530008=O plugin seleccionado xa se atopa instalado
PluginManagementError.530009=Non se atopou o ficheiro de plugin

PluginConfigurationDialog.0=Aceptar
PluginConfigurationDialog.1=Cancelar

CertificateConfirmPanel.0=O plugin at\u00F3pase asinado por:
CertificateConfirmPanel.1=Descargar certificado
CertificateConfirmPanel.2=Descargar certificado de %0
CertificateConfirmPanel.3=Queres continuar coa instalaci\u00F3n?
CertificateConfirmPanel.4=Erro ao gardar o certificado
CertificateConfirmPanel.5=Erro
CertificateConfirmPanel.6=Certificado
CertificateConfirmPanel.7=Gardar certificado
CertificateConfirmPanel.8=certificado_plugin.cer
CertificateConfirmPanel.9=caducado
CertificateConfirmPanel.10=Descargar certificado de %0 (caducado)

PermissionsDialog.0=Informaci\u00F3n do plugin
PermissionsDialog.1=Di\u00E1logo de informaci\u00F3n do plugin
PermissionsDialog.2=Permisos requiridos polo plugin
PermissionsDialog.3=Conceder permisos
PermissionsDialog.4=Cancelar

LanguageManagementError.230000 = Ocorreu un erro ao importar o ficheiro de idioma
LanguageManagementError.230001 = Non se puido ler correctamente o arquivo ZIP
LanguageManagementError.230002 = Produciuse un erro ao crear o directorio do idioma

permission.INSTALL=Instalaci\u00F3n
permission.INSTALL.desc=Permiso para facer cambios no equipo durante a instalaci\u00F3n do plugin.
permission.UNINSTALL=Desinstalaci\u00F3n
permission.UNINSTALL.desc=Permiso para facer cambios no equipo durante a desinstalaci\u00F3n do plugin.
permission.RESET=Reinicio
permission.RESET.desc=Permiso para reiniciar a aplicaci\u00F3n.
permission.PRESIGN=Preprocesado
permission.PRESIGN.desc=Permiso para procesar os datos antes das operaci\u00F3ns de firma. 
permission.POSTSIGN=Postprocesado
permission.POSTSIGN.desc=Permiso para procesar as\u00EDnalas despois da s\u00FAa xeraci\u00F3n.
permission.BUTTONS=Novos bot\u00F3ns
permission.BUTTONS.desc=Permisos para agregar bot\u00F3ns \u00E1 interface da aplicaci\u00F3n.
permission.MENU=Novo men\u00FA
permission.MENU.desc=Permisos para agregar un men\u00FA \u00E1 interface da aplicaci\u00F3n.
permission.COMMANDS=Novos comandos
permission.COMMANDS.desc=Permisos para agregar novos comandos executables por li\u00F1a de comandos.
permission.INLINE_PROCESS=Firma en li\u00F1a
permission.INLINE_PROCESS.desc=Permisos para modificar o proceso de firma cando se solicite desde o navegador.


# Cadeas de solicitude dinamica de datos ao usuario
signingLts=A firma cont\u00E9n selos de arquivo e quedar\u00E1 invalidada ao agregar a nova firma. Queres continuar?
signingLtsPossible=A firma cont\u00E9n selos de arquivo e poder\u00EDa quedar invalidada ao agregar a nova firma. Queres continuar?
agePolicyIncompatibilitySign=A firma que desexa xerar non \u00E9 compatible coa Pol\u00EDtica de sinatura da AGE, nin ser\u00E1 validada polos sistemas de validaci\u00F3n de sinatura da AGE.\nQueres completar a operaci\u00F3n sen agregar a pol\u00EDtica de firma?
agePolicyIncompatibilityCosign=A firma que desexa cofirmar non \u00E9 compatible coa Pol\u00EDtica de sinatura da AGE, nin ser\u00E1 validada polos sistemas de validaci\u00F3n de sinatura da AGE.\nQueres completar a operaci\u00F3n sen agregar a pol\u00EDtica de firma? 
agePolicyIncompatibilityCounterSign=A firma que desexa contrafirmar non \u00E9 compatible coa Pol\u00EDtica de sinatura da AGE, nin ser\u00E1 validada polos sistemas de validaci\u00F3n de sinatura da AGE.\nQueres completar a operaci\u00F3n sen agregar a pol\u00EDtica de firma? 
signingCertifiedPdf=O PDF que desexa asinar est\u00E1 certificado e non admite novas firmas. Agregar novas firmas invalidar\u00E1 a firma anterior.\nQueres continuar?
signingPdfWithUnregisteredSigns=O PDF que desexa asinar cont\u00E9n firmas previas nun formato antigo. Agregar novas firmas poder\u00EDa invalidar as xa existentes.\nQueres continuar?
signingModifiedPdfForm=O documento PDF cont\u00E9n un formulario do cal se modificaron os campos despois de asinarse.\nQueres continuar?
pdfShadowAttackSuspect=O PDF \u00E9 sospeitoso de ser modificado tras a \u00FAltima firma. Queres continuar?
pdfpasswordprotected=O PDF est\u00E1 protexido por contrasinal. Introduza do contrasinal do PDF.
pdfbadpassword=O contrasinal introducido \u00E9 incorrecto. Introduza do contrasinal do PDF.