CertificateInfo.0=Certificat gen\u00E8ric X.509v3
CertificateInfo.1=Titular del certificat:  
CertificateInfo.2=Emissor del certificat: 
CertificateInfo.3=Certificat X.509v3 gen\u00E8ric

CertificationLevelResources.0=Signatura ordin\u00E0ria no certificada
CertificationLevelResources.1=Signatura d'autor
CertificationLevelResources.2=Signatura d'autor certificada
CertificationLevelResources.3=Signatura certificada
CertificationLevelResources.4=Preguntar sempre abans de signar

TimeStampPdfTypeResource.0=Sol segell a nivell de signatura
TimeStampPdfTypeResource.1=Sol segell a nivell de document
TimeStampPdfTypeResource.2=Dos segells, un a nivell de signatura i un altre a nivell de document

CipherDialog.0=Xifrat de fitxers
CipherDialog.1=Di\u00E0leg per al xifrat de fitxers
CipherDialog.2=Algorisme de xifrat
CipherDialog.3=Fitxer a xifrar
CipherDialog.4=Cancel·lar
CipherDialog.5=Xifrar
CipherDialog.6=Seleccionar fitxer a xifrar
CipherDialog.7=Polse este bot\u00F3 per a buscar l'arxiu a xifrar
CipherDialog.8=Contrasenya
CipherDialog.9=Polse este bot\u00F3 per a xifrar l'arxiu
CipherDialog.10=Polse este bot\u00F3 per a tancar el di\u00E0leg
CipherDialog.11=Tots els arxius (*.*)

ClosePanel.0=No tornar a mostrar este missatge

ConfirmSignatureDialog.0=Autoritzar signatura
ConfirmSignatureDialog.1=Es realitzar\u00E0 la signatura electr\u00F2nica d'un document.
ConfirmSignatureDialog.2=Es realitzar\u00E0 la signatura electr\u00F2nica de %0 documents.
ConfirmSignatureDialog.4=<html>Polse "Acceptar" per a donar fe d'entendre les implicacions legals de signar i<br>autoritzar la signatura dels documents seleccionats. En cas contrari, polse<br>"Cancel·lar".</html>
ConfirmSignatureDialog.5=Ometre esta confirmaci\u00F3 en futures operacions de signatura.
ConfirmSignatureDialog.6=Acceptar
ConfirmSignatureDialog.7=Cancel·lar

DataDebugDialog.0=Binari
DataDebugDialog.1=Tipus de les dades a signar: %0
DataDebugDialog.2=Grand\u00E0ria de les dades a signar: %0 octets
DataDebugDialog.3=Contingut de les dades a signar:
DataDebugDialog.4=Dades a signar
DataDebugDialog.5=Ha fallat la c\u00E0rrega de dades des de fitxer
DataDebugDialog.6=Fitxer de dades
DataDebugDialog.7=Seleccione el fitxer amb les dades a signar
DataDebugDialog.8=Continuar
DataDebugDialog.9=Polse este bot\u00F3 per a continuar amb el proc\u00E9s de signatura

DataFileInfoDialog.0=Guardar
DataFileInfoDialog.1=Obrir
DataFileInfoDialog.2=Cancel·lar
DataFileInfoDialog.3=Dades signades
DataFileInfoDialog.4=Tipus de document:
DataFileInfoDialog.5=Desconegut
DataFileInfoDialog.6=Extensi\u00F3:
DataFileInfoDialog.7=Desconeguda
DataFileInfoDialog.8=Grand\u00E0ria:

DnieCertAnalyzer.0=de
DnieCertAnalyzer.2=Certificat de signatura de DNIe
DnieCertAnalyzer.4=Certificat de DNI electr\u00F2nic

DNIePasswordCallback.1=Introdu\u00EFsca el PIN del seu DNIe
DNIePasswordCallback.3=DNI electr\u00F2nic

DNIeWaitPanel.0=Usar magatzem per defecte
DNIeWaitPanel.1=Si no desitja usar DNI electr\u00F2nic polse este bot\u00F3 o la tecla escape per a poder seleccionar un certificat qualsevol des del magatzem de claus i certificats del sistema operatiu
DNIeWaitPanel.2=Bot\u00F3 d'omissi\u00F3 d'espera per a inserci\u00F3 de DNIe
DNIeWaitPanel.3=Inserisca el seu DNIe en el lector de targetes i polse el bot\u00F3 "Continuar amb DNIe"
DNIeWaitPanel.4=Continuar amb DNIe
DNIeWaitPanel.5=Polse este bot\u00F3 per a usar el seu DNIe en les operacions posteriors de signatura
DNIeWaitPanel.6=Bot\u00F3 de confirmaci\u00F3 d'\u00FAs de DNIe
DNIeWaitPanel.7=Una vegada inserit, no extraga el DNIe ni el lector de targetes durant tota l'execuci\u00F3 d'este programa
DNIeWaitPanel.8=No tornar a mostrar esta pantalla inicial i treballar sempre amb el magatzem per defecte

MainMenu.0=Arxiu
MainMenu.1=Men\u00FA amb operacions d'obertura i signatura d'arxius
MainMenu.10=Men\u00FA amb operacions relacionades amb l'ajuda de l'aplicaci\u00F3
MainMenu.11=Ajuda d'Autofirma
MainMenu.12=Prefer\u00E8ncies
MainMenu.13=C\u00E0rrega l'ajuda de l'aplicaci\u00F3 en una nova finestra
MainMenu.14=<html><p align="center">Autofirma %0<br>&copy; 2011-2025 Govern d'Espa&ntilde;a</p><br><p>Autofirma &eacute;s Programari Lliure; pots redistribuir-ho i/o modificar-ho sota els termes d'almenys<br>una d'estes dues llic&egrave;ncies: <ul><li>La "GNU General Public License" tal com &eacute;s publicada per la Free Programari Foundation;<br>versi&oacute; 2 de la Llic&egrave;ncia, o (a la seua elecci&oacute;) qualsevol versi&oacute; posterior.</li><li>L'"European Programari License"; versi&oacute; 1.1 de la Llic&egrave;ncia, o (a la seua elecci&oacute;) qualsevol<br>versi&oacute; posterior.</li></ul><p>Autofirma cont&eacute;, entre altres, els seg\u00FCents components de programari lliure:<br>iText 2.1.7 (MPL 1.1/LGPL), jMimeMagic (Apatxe License 2.0), JUniversalCharDet (MPL 1.1),<br>jXAdES (EUPL 1.1/GPLv3), SpongyCastle (MIT), Java WebSockets (MIT), Proxy Vole (Apatxe License 2.0), etc.</p><p><br>Versi&oacute; de Java actualment en &uacute;s: %1 (%2bits)</p></html>
MainMenu.15=Sobre Autofirma
MainMenu.16=Prefer\u00E8ncies generals de l'aplicaci\u00F3
MainMenu.17=Mostra informaci\u00F3 addicional sobre Autofirma
MainMenu.18=Opcions
MainMenu.19=Men\u00FA amb les opcions configurables de l'aplicaci\u00F3
MainMenu.20=Restaurar instal·laci\u00F3
MainMenu.21=Eina per a restaurar la configuraci\u00F3 dels navegadors
MainMenu.2=Obrir arxiu a signar
MainMenu.24=Prefer\u00E8ncies de configuraci\u00F3 de signatura electr\u00F2nica
MainMenu.25=Empremtes digitals
MainMenu.26=Calcular empremta digital
MainMenu.27=Comprovar empremta digital
MainMenu.28=Calcular empremta digital de directori
MainMenu.29=Comprovar empremta digital de directori
MainMenu.30=Fitxer
MainMenu.31=Directori
MainMenu.32=Eines
MainMenu.33=Men\u00FA amb eines complement\u00E0ries
MainMenu.34=Veure signatura
MainMenu.35=Obrir signatura
MainMenu.36=Signatures electr\u00F2niques
MainMenu.37=Gestionar plugins
MainMenu.38=Idioma
MainMenu.39=Espa\u00F1ol
MainMenu.40=English
MainMenu.41=Catal\u00e1
MainMenu.42=Galego
MainMenu.43=Euskera
MainMenu.44=Valenci\u00E0
MainMenu.45=Importar idioma
MainMenu.46=Obrir fitxer per a importar idioma
MainMenu.47=Arxiu comprimit
MainMenu.48=Error en importar idioma
MainMenu.49=Reinicie l'operaci\u00F3 perqu\u00E8 els canvis facen efecte.
MainMenu.50=Reiniciar Autofirma
MainMenu.51=\u00C9s necessari reiniciar l'aplicaci\u00F3 perqu\u00E8 els canvis facen efecte. Desitja que es reinicie l'aplicaci\u00F3?
MainMenu.52=L'idioma s'ha importat correctament
MainMenu.3=Obri un fitxer per a permetre la seua posterior signatura
MainMenu.4=Seleccione el fitxer a signar
MainMenu.5=Signar arxiu
MainMenu.6=Signatura el fitxer seleccionat per a la seua signatura
MainMenu.7=Eixir
MainMenu.8=Tanca l'aplicaci\u00F3
MainMenu.9=Ajuda

MenuValidation.0=Validaci\u00F3
MenuValidation.1=Validar certificat
MenuValidation.10=Certificat inv\u00E0lid
MenuValidation.11=El certificat no \u00E9s v\u00E0lid o no s'ha pogut validar:
MenuValidation.12=Validar signatura electr\u00F2nica
MenuValidation.13=Validaci\u00F3 de signatures electr\u00F2niques quant a estructura i empremtes digitals
MenuValidation.14=<html>El certificat em&eacute;s per:<br><i>&nbsp;&nbsp;%0</i><br>A nom de:<br><i>&nbsp;&nbsp;%1</i><br>&Eacute;s v&agrave;lid.<br>Esta comprovaci&oacute; pot ser parcial, per a una comprovaci&oacute; completa<br>use la Plataforma @signa.</html>
MenuValidation.15=Certificat v\u00E0lid
MenuValidation.16=Seleccione la signatura a validar
MenuValidation.17=Signatures electr\u00F2niques (*.*)
MenuValidation.2=Validaci\u00F3 de certificats (per\u00EDode de validesa, revocaci\u00F3, etc.)
MenuValidation.3=Seleccione el certificat a validar
MenuValidation.4=Certificats digitals (*.cer, *.cert, *.crt, *.pem)
MenuValidation.5=Error
MenuValidation.6=No es tenen permisos per a llegir el fitxer
MenuValidation.7=Error llegint el fitxer de certificat
MenuValidation.8=El certificat est\u00E0 corrupte i no pot ser validat
MenuValidation.9=No es coneixen mecanismes de validaci\u00F3 per a este certificat

PreferencesPanel.0=Aplicar ara
PreferencesPanel.1=Incloure una c\u00F2pia de les dades signades en la pr\u00F2pia signatura
PreferencesPanel.10=Codi postal del lloc en el qual es realitza la signatura
PreferencesPanel.11=Ciutat en la qual es realitza la signatura
PreferencesPanel.12=Pa\u00EDs en el qual es realitza la signatura
PreferencesPanel.13=C\u00E0rrec atribu\u00EFt al signant
PreferencesPanel.14=Prov\u00EDncia en la qual es realitza la signatura
PreferencesPanel.15=Format de signatura:
PreferencesPanel.16=Opcions de signatura
PreferencesPanel.17=Opcions de signatura
PreferencesPanel.18=Algorisme de petjada per a la signatura:
PreferencesPanel.19=Metadades de les signatures
PreferencesPanel.2=General
PreferencesPanel.20=Ra\u00F3 per la qual se signa el document
PreferencesPanel.21=Ciutat en la qual es realitza la signatura
PreferencesPanel.22=Contacte del signant (usualment una adre\u00E7a de correu electr\u00F2nic)
PreferencesPanel.23=Pol\u00EDtica de signatura:
PreferencesPanel.24=Cap pol\u00EDtica
PreferencesPanel.25=Pol\u00EDtica de signatura de l'AGE 1.8
PreferencesPanel.26=Pol\u00EDtica de signatura a mesura
PreferencesPanel.CAdES.27=Identificador de la pol\u00EDtica (ha de ser un OID)
PreferencesPanel.XAdES.27=Identificador de la pol\u00EDtica (ha de ser una URI)
PreferencesPanel.PAdES.27=Identificador de la pol\u00EDtica (ha de ser un OID)
PreferencesPanel.FacturaE.27=Identificador de la pol\u00EDtica (ha de ser una URI)
PreferencesPanel.28=Empremta digital de l'identificador de la pol\u00EDtica (en Base64)
PreferencesPanel.29=Algorisme de l'empremta digital de l'identificador de la pol\u00EDtica
PreferencesPanel.3=Signatures PAdES (PDF)
PreferencesPanel.30=Qualificador de la pol\u00EDtica (URL)
PreferencesPanel.31=Cancel·lar
PreferencesPanel.32=Cancel·la l'establiment de prefer\u00E8ncies descartant els canvis realitzats des de l'\u00FAltima vegada que es van guardar
PreferencesPanel.33=Acceptar
PreferencesPanel.34=Guarda els valors establits per a les prefer\u00E8ncies i finalitza el proc\u00E9s d'establiment d'estes tancant la finestra
PreferencesPanel.35=Guarda els valors establits per a les prefer\u00E8ncies permetent continuar amb el proc\u00E9s d'establiment d'estes
PreferencesPanel.36=No demanar confirmaci\u00F3 en tancar l'aplicaci\u00F3
PreferencesPanel.37=Prefer\u00E8ncies generals
PreferencesPanel.38=Les dades de la pol\u00EDtica de signatura CAdES s\u00F3n inv\u00E0lids
PreferencesPanel.4=Signatures CAdES
PreferencesPanel.40=Opcions generals de configuraci\u00F3
PreferencesPanel.41=Opcions de configuraci\u00F3 per a les signatures PAdES de documents PDF
PreferencesPanel.42=Opcions de configuraci\u00F3 per a les signatures CAdES de fitxers binaris
PreferencesPanel.43=Opcions de configuraci\u00F3 per a les signatures XAdES de documents XML
PreferencesPanel.44=Establix si ha d'ometre's la sol·licitud de confirmaci\u00F3 a l'usuari quan s'intente tancar l'aplicaci\u00F3
PreferencesPanel.45=Establix si les signes CAdES generades han de ser impl\u00EDcites
PreferencesPanel.46=Algorisme que s'utilitzar\u00E0 en totes les signatures electr\u00F2niques que permeten la seua configuraci\u00F3
PreferencesPanel.47=Configuraci\u00F3 de pol\u00EDtica de signatura per a signatures XAdES
PreferencesPanel.48=Configuraci\u00F3 de pol\u00EDtica de signatura per a signatures PAdES
PreferencesPanel.49=Configuraci\u00F3 de pol\u00EDtica de signatura per a signatures CAdES
PreferencesPanel.5=Signatures XAdES
PreferencesPanel.50=Algorisme utilitzat per al c\u00E0lcul de l'empremta digital de l'identificador de la pol\u00EDtica de signatura per a signatures XAdES
PreferencesPanel.51=Algorisme utilitzat per al c\u00E0lcul de l'empremta digital de l'identificador de la pol\u00EDtica de signatura per a signatures CAdES
PreferencesPanel.52=Algorisme utilitzat per al c\u00E0lcul de l'empremta digital de l'identificador de la pol\u00EDtica de signatura per a signatures PAdES
PreferencesPanel.53=Format utilitzat en la generaci\u00F3 de les signatures XAdES
PreferencesPanel.54=URI identificadora de la pol\u00EDtica de signatura per a signatures XAdES
PreferencesPanel.55=Empremta digital de l'identificador de la pol\u00EDtica de signatura per a signatures XAdES
PreferencesPanel.56=URL qualificadora de la pol\u00EDtica de signatura per a signatures XAdES
PreferencesPanel.57=OID identificador de la pol\u00EDtica de signatura per a signatures CAdES
PreferencesPanel.58=Empremta digital de l'identificador de la pol\u00EDtica de signatura per a signatures CAdES
PreferencesPanel.59=URL qualificadora de la pol\u00EDtica de signatura per a signatures CAdES
PreferencesPanel.6=Les dades de la pol\u00EDtica de signatura XAdES s\u00F3n inv\u00E0lids
PreferencesPanel.60=OID identificador de la pol\u00EDtica de signatura per a signatures PAdES
PreferencesPanel.61=Empremta digital de l'identificador de la pol\u00EDtica de signatura per a signatures PAdES
PreferencesPanel.62=URL qualificadora de la pol\u00EDtica de signatura per a signatures PAdES
PreferencesPanel.63=Raz\u00EDn de signatura dels documents PDF
PreferencesPanel.64=Ciutat en la qual es realitza la signatura PDF
PreferencesPanel.65=Informaci\u00F3 de contacte que s'agrega a les signatures PDF. Comunament una adre\u00E7a de correu electr\u00F2nic
PreferencesPanel.66=Ciutat en la qual es realitza la signatura
PreferencesPanel.67=Pa\u00EDs en el qual es realitza la signatura
PreferencesPanel.68=Prov\u00EDncia en la qual es realitza la signatura
PreferencesPanel.69=Opcions de signatura
PreferencesPanel.7=Les dades de la pol\u00EDtica de signatura PAdES s\u00F3n inv\u00E0lids
PreferencesPanel.70=Format b\u00E0sic de les signatures PAdES
PreferencesPanel.71=PAdES B\u00E0sic
PreferencesPanel.72=PAdES-BES
PreferencesPanel.73=Pol\u00EDtica de signatura de l'AGE 1.9
PreferencesPanel.79=Realitzar per defecte signatures visibles PDF
PreferencesPanel.8=Metadades de les signatures
PreferencesPanel.80=Signatura visible
PreferencesPanel.81=Ometre pantalla inicial de DNIe.
PreferencesPanel.82=Establix si ha de mostrar-se o no la pantalla inicial que pregunta a l'usuari si desitja usar nom\u00E9s DNIe o qualsevol certificat
PreferencesPanel.84=Magatzems de claus
PreferencesPanel.85=Opcions de configuraci\u00F3 per als magatzems de claus i certificats
PreferencesPanel.86=Seleccione el fitxer de configuraci\u00F3
PreferencesPanel.87=Buscar actualitzacions a l'inici
PreferencesPanel.88=En esta casella pot seleccionar si desitja o no que el programa busque autom\u00E0ticament actualitzacions en iniciar-se
PreferencesPanel.9=Prov\u00EDncia o regi\u00F3 en la qual es realitza la signatura
PreferencesPanel.100=Factura Electr\u00F2nica
PreferencesPanel.101=Opcions de configuraci\u00F3 per a la Factura Electr\u00F2nica de documents
PreferencesPanel.102=Codi postal del lloc en el qual es realitza la signatura
PreferencesPanel.104=Format 1
PreferencesPanel.105=Format 2
PreferencesPanel.106=Format b\u00E0sic de la Signatura Electr\u00F2nica
PreferencesPanel.107=Importar configuraci\u00F3
PreferencesPanel.108=Opcions generals
PreferencesPanel.109=Seleccione la URL per a desc\u00E0rrega del fitxer de prefer\u00E8ncies
PreferencesPanel.110=Importar configuraci\u00F3 des de xarxa
PreferencesPanel.111=Configuracions d'Autofirma (*.afconfig)
PreferencesPanel.112=Polse este bot\u00F3 per a seleccionar un fitxer amb les opcions de configuraci\u00F3 per a tot el programa
PreferencesPanel.113=Mostrar icona en l'\u00E0rea de notificacions i executar autom\u00E0ticament a l'inici (necessita reiniciar)
PreferencesPanel.114=Establix la icona en l'\u00E0rea de notificacions i executar autom\u00E0ticament a l'inici
PreferencesPanel.115=Format avan\u00E7at de signatura:
PreferencesPanel.116=Error important la configuraci\u00F3 des de xarxa
PreferencesPanel.117=Error
PreferencesPanel.118=Personalitzar format de segell de temps
PreferencesPanel.119=Configurar
PreferencesPanel.120=Polse este bot\u00F3 per a personalitzar el format de segells de temps
PreferencesPanel.121=Segell de temps
PreferencesPanel.122=Aplicar segells de temps al document signat
PreferencesPanel.123=Nivell de certificaci\u00F3 de la signatura
PreferencesPanel.124=Segells de temps
PreferencesPanel.125=Configuraci\u00F3 de xarxa
PreferencesPanel.126=Configurar proxy
PreferencesPanel.127=Polse este bot\u00F3 per a configurar les opcions de proxy
PreferencesPanel.128=Canviar configuraci\u00F3 de proxy per a les connexions de xarxa:
PreferencesPanel.129=Error
PreferencesPanel.130=No s'ha pogut instal·lar la icona en l'\u00E1rearea de notificacions
PreferencesPanel.131=No s'ha pogut desinstal·lar la icona de l'\u00E1rearea de notificacions
PreferencesPanel.132=<html>S'ha instal·lat correctament la icona en l'&aacute;rearea de notificacions. L'aplicaci&oacute; s'executara autom&agrave;ticament a partir del pr&ograve;xim reinicie</html>
PreferencesPanel.133=<html>S'ha desinstal·lat correctament la icona de l'&aacute;rearea de notificacions. L'aplicaci&oacute; deixar&agrave; d'executar-se autom&agrave;ticament a partir del pr&ograve;xim reinicie</html>
PreferencesPanel.134=Icona en l'\u00E1rearea de notificacions
PreferencesPanel.135=Restaurar configuraci\u00F3
PreferencesPanel.136=Polse este bot\u00F3 per a restaurar les opcions de configuraci\u00F3 per a tot el programa.
PreferencesPanel.137=Xifrat
PreferencesPanel.138=Opcions de configuraci\u00F3 per al xifrat
PreferencesPanel.139=Restaurar configuraci\u00F3
PreferencesPanel.140=Voleu restaurar la configuraci\u00F3 general de l'aplicaci\u00F3?
PreferencesPanel.141=Ha ocorregut un error eliminant les prefer\u00E8ncies de l'aplicaci\u00F3
PreferencesPanel.142=La configuraci\u00F3 s'ha importat correctament.
PreferencesPanel.143=Importaci\u00F3 de la configuraci\u00F3
PreferencesPanel.144=Restaurar valors
PreferencesPanel.145=Restaura els valors per defecte de les prefer\u00E8ncies
PreferencesPanel.146=Fa\u00E7a clic en el seg\u00FCent bot\u00F3 per a restaurar la configuraci\u00F3 de signatures PAdES.
PreferencesPanel.147=Restaurar configuraci\u00F3
PreferencesPanel.148=Fa\u00E7a clic en el seg\u00FCent bot\u00F3 per a restaurar la configuraci\u00F3 de signatures XAdES.
PreferencesPanel.149=Fa\u00E7a clic en el seg\u00FCent bot\u00F3 per a restaurar la configuraci\u00F3 de signatures FacturaE.
PreferencesPanel.150=Configurar pol\u00EDtica
PreferencesPanel.151=Polse este bot\u00F3 per a configurar la pol\u00EDtica de signatura
PreferencesPanel.152=Fa\u00E7a clic en el seg\u00FCent bot\u00F3 per a configurar la pol\u00EDtica de signatura.
PreferencesPanel.153=Configuraci\u00F3 de la pol\u00EDtica de signatura
PreferencesPanel.154=Fa\u00E7a clic en el seg\u00FCent bot\u00F3 per a restaurar la configuraci\u00F3 de signatures CAdES.
PreferencesPanel.155=Voleu restaurar la configuraci\u00F3 de les signatures PAdES?
PreferencesPanel.156=Voleu restaurar la configuraci\u00F3 de les signatures XAdES?
PreferencesPanel.157=Voleu restaurar la configuraci\u00F3 de les signatures CAdES?
PreferencesPanel.158=Voleu restaurar la configuraci\u00F3 de les Factures Electr\u00F2niques?
PreferencesPanel.160=Sobreescriure fitxers en el directori d'eixida en les signatures massives 
PreferencesPanel.161=Canviar format de signatura per a cada tipus de fitxer:
PreferencesPanel.162=Configurar formats
PreferencesPanel.163=Polse este bot\u00F3 per a configurar el format de signatura que ha d'aplicar-se a cada tipus de fitxer
PreferencesPanel.164=Formats de signatura
PreferencesPanel.165=Habilitar JMulticard per a l'\u00FAs de targetes de la FNMT i DNIe (requereix reiniciar Autofirma)
PreferencesPanel.166=Habilita l'\u00FAs de DNIe i targetes CERES mitjan\u00E7ant JMulticard (requereix reiniciar)
PreferencesPanel.167=Operaci\u00F3 en multisignatures
PreferencesPanel.168=Cosignatura
PreferencesPanel.169=Contrafirma (\u00FAnicament dels nodes fulla)
PreferencesPanel.170=Contrafirma (de tot l'arbre)
PreferencesPanel.171=Pol\u00EDtica de signatura:
PreferencesPanel.172=Aplicar marca visible a documents PDF
PreferencesPanel.173=Acceptar nom\u00E9s connexions amb llocs segurs (Recomanat)
PreferencesPanel.174=Nom\u00E9s s'acceptaran connexions amb direccions HTTPS quan el certificat siga de confian\u00E7a
PreferencesPanel.175=Ofuscar identificadors d'usuari dels certificats de les signatures visibles
PreferencesPanel.176=Permetre l'\u00FAs de certificats caducats
PreferencesPanel.177=Permetre seleccionar certificats caducats per a signar
PreferencesPanel.178=Permetre agregar noves signatures a documents amb signatures no v\u00E0lides
PreferencesPanel.179=Sol·licitar confirmaci\u00F3 per a signar
PreferencesPanel.180=Demana confirmaci\u00F3 a l'usuari abans d'executar una operaci\u00F3 de signatura
PreferencesPanel.181=Caixa per a introduir text
PreferencesPanel.182=Casella de verificaci\u00F3 per a activar o desactivar 
PreferencesPanel.183=Desplegable amb opcions de 
PreferencesPanel.184=Bot\u00F3 d'opci\u00F3 para 
PreferencesPanel.185=Dominis segurs
PreferencesPanel.186=Bot\u00F3 per a obrir llistat de dominis segurs
PreferencesPanel.187=Comprovar PDF Shadow Attack
PreferencesPanel.188=Bot\u00F3 per a activar la comprobaci\u00F3nn de PDF Shadow Attacks
PreferencesPanel.189=En activar esta opci\u00F3, el proc\u00E9s de validaci\u00F3 per a PDF pot retardar-se.
PreferencesPanel.190=Funcionament optimitzat per a VDI. No recomanat en altres entorns.
PreferencesPanel.191=Adapta la comunicaci\u00F3 amb el navegador per a un millor acompliment sobre entorns VDI.
PreferencesPanel.192=Magatzems de claus
PreferencesPanel.193=Opcions de configuraci\u00F3 de certificats
PreferencesPanel.194=Certificats de confian\u00E7a
PreferencesPanel.195=Polse este bot\u00F3 per a configurar els certificats de confian\u00E7a
PreferencesPanel.196=Exportar configuraci\u00F3
PreferencesPanel.197=Polse este bot\u00F3 per a exportar a un fitxer les opcions de configuraci\u00F3 per a tot el programa
PreferencesPanel.198=Seleccione una ruta on exportar l'arxiu de configuraci\u00F3
PreferencesPanel.199=La configuraci\u00F3 s'ha exportat correctament.
PreferencesPanel.200=Exportaci\u00F3 de la configuraci\u00F3
PreferencesPanel.201=exported_config.afconfig
PreferencesPanel.203=Tipus per defecte:
PreferencesPanel.204=Permetre generar PDF certificat.
PreferencesPanel.205=Bot\u00F3 per a activar la generaci\u00F3nn de PDF certificat
PreferencesPanel.206=Sense certificar
PreferencesPanel.207=Certificada d'autor
PreferencesPanel.208=Certificada d'autor per a formularis
PreferencesPanel.209=Certificada comuna
PreferencesPanel.210=Generar signatura PDF certificat

DefaultFormatPanel.1=Seleccione el format de signatura que s'utilitzar\u00E0 per a signar cada tipus de fitxer.
DefaultFormatPanel.2=Restablir
DefaultFormatPanel.3=Establix els valors per defecte originals en els camps del di\u00E0leg
DefaultFormatPanel.5=Documents PDF
DefaultFormatPanel.6=Documents OOXML de Microsoft Office
DefaultFormatPanel.7=Factures electr\u00F2niques
DefaultFormatPanel.8=Fitxers XML gen\u00E8rics
DefaultFormatPanel.9=Fitxers ODF de LibreOffice o OpenOffice
DefaultFormatPanel.10=Resta de fitxers

PreferencesPanelCiperment.0=Panell per a configurar les opcions de xifrat.
PreferencesPanelCiperment.1=Opcions de xifrat
PreferencesPanelCiperment.10=encipherOnly
PreferencesPanelCiperment.11=decipherOnly
PreferencesPanelCiperment.12=Algorisme de xifrat
PreferencesPanelCiperment.13=Repositori de certificats d'usuaris destinataris
PreferencesPanelCiperment.14=URI del Repositori
PreferencesPanelCiperment.15=M\u00E8tode d'acc\u00E9s
PreferencesPanelCiperment.16=Comprovar
PreferencesPanelCiperment.17=Polse este bot\u00F3 per a comprovar que la URI introdu\u00EFda \u00E9s correcta.
PreferencesPanelCiperment.18=La URI introdu\u00EFda no \u00E9s correcta.
PreferencesPanelCiperment.19=Error
PreferencesPanelCiperment.2=Usos de clau permesos
PreferencesPanelCiperment.20=La URI introdu\u00EFda \u00E9s correcta.
PreferencesPanelCiperment.3=digitalSignature
PreferencesPanelCiperment.4=nonRepudiation
PreferencesPanelCiperment.5=keyEncipherment
PreferencesPanelCiperment.6=dataEncipherment
PreferencesPanelCiperment.7=keyAgreement
PreferencesPanelCiperment.8=keyCertSign
PreferencesPanelCiperment.9=cRLSign

PreferencesPanelXades.0=C\u00E0rrec atribu\u00EFt al signant

PreferencesPlistHandler.0=No ha sigut possible llegir el fitxer de prefer\u00E8ncies, no es va fer cap canvi en la configuraci\u00F3
PreferencesPlistHandler.1=Error
PreferencesPlistHandler.2=El fitxer de prefer\u00E8ncies no ha sigut signat.
PreferencesPlistHandler.3=El fitxer de prefer\u00E8ncies no esta signat, no es va fer cap canvi en la configuraci\u00F3
PreferencesPlistHandler.4=El fitxer de prefer\u00E8ncies no esta signat correctament, no es va fer cap canvi en la configuraci\u00F3
PreferencesPlistHandler.5=El fitxer de prefer\u00E8ncies esta signat digitalment per: %0
PreferencesPlistHandler.6=<html>El signant de les prefer&egrave;ncies no esta autoritzat ('%0').<br>No es va fer cap canvi en la configuraci&oacute;.</html>
PreferencesPlistHandler.7=No s'ha pogut extraure la informaci\u00F3 de la signatura del fitxer de prefer\u00E8ncies, no es va fer cap canvi en la configuraci\u00F3
PreferencesPlistHandler.8=El fitxer de prefer\u00E8ncies \u00E9s inv\u00E0lid, no es va fer cap canvi en la configuraci\u00F3
PreferencesPlistHandler.109=<html><p>Si cont&iacute;nua, es reempla\u00E7ar&agrave; la configuraci&oacute; actual amb la indicada en el fitxer, &iquest;Desitja continuar?<br>Si cancel·la la importaci&oacute;, no s'aplicar&agrave; cap configuraci&oacute; del fitxer seleccionat.</p><p>%0</p></html>
PreferencesPlistHandler.110=Importar configuraci\u00F3 de signatura

PreferencesPanelFacturaE.0=Versi\u00F3 de la pol\u00EDtica de signatura de factura electr\u00F2nica
PreferencesPanelFacturaE.1=Pol\u00EDtica de Factura Electr\u00F2nica 3.0
PreferencesPanelFacturaE.2=Pol\u00EDtica de Factura Electr\u00F2nica 3.1
PreferencesPanelFacturaE.3=Paper del signant de la factura electr\u00F2nica:
PreferencesPanelFacturaE.4=Metadades de les signatures
PreferencesPanelFacturaE.5=Emissor
PreferencesPanelFacturaE.6=Receptor
PreferencesPanelFacturaE.7=Tercer

PreferencesPanelKeyStores.1=Magatzem per defecte
PreferencesPanelKeyStores.2=Veure contingut
PreferencesPanelKeyStores.3=Usar tamb\u00E9 en les anomenades a Autofirma des del navegador
PreferencesPanelKeyStores.4=Filtres de certificats
PreferencesPanelKeyStores.5=Mostrar pantalla inicial de selecci\u00F3 de DNIe o qualsevol altre certificat
PreferencesPanelKeyStores.6=Permetre l'\u00FAs de certificats caducats
PreferencesPanelKeyStores.7=Usar sol certificats espec\u00EDfics per a signatura en les signatures electr\u00F2niques (atribut de no repudi)
PreferencesPanelKeyStores.8=Usar exclusivament certificats de pseud\u00F2nim
PreferencesPanelKeyStores.9=Targetes intel·ligents
PreferencesPanelKeyStores.10=Connectar
PreferencesPanelKeyStores.11=Agregar targeta
PreferencesPanelKeyStores.12=Selecci\u00F3 de magatzem local
PreferencesPanelKeyStores.13=Magatzems de claus
PreferencesPanelKeyStores.14=No s'ha pogut carregar el DNIe
PreferencesPanelKeyStores.15=Voleu restaurar la configuraci\u00F3 per als magatzems de claus?
PreferencesPanelKeyStores.16=Error en obtindre magatzem
PreferencesPanelKeyStores.17=Permet utilitzar el magatzem per defecte en cas de realitzar anomenades a l'aplicaci\u00F3 des del navegador.
PreferencesPanelKeyStores.18=Contingut del magatzem '%0'
PreferencesPanelKeyStores.19=\u00E9s possible que no tots els certificats mostrats estiguen disponibles per a signar electr\u00F2nicament.
PreferencesPanelKeyStores.20=Error en recuperar el magatzem per defecte seleccionat
PreferencesPanelKeyStores.21=Error en registrar targeta intel·ligent en el sistema
PreferencesPanelKeyStores.22=Error en obtindre els registres de targetes intel·ligents
PreferencesPanelKeyStores.23=Modificar
PreferencesPanelKeyStores.24=Eliminar
PreferencesPanelKeyStores.25=Voleu eliminar la targeta seleccionada?
PreferencesPanelKeyStores.26=Error en eliminar targeta intel·ligent del sistema
PreferencesPanelKeyStores.27=Emplene tots els camps
PreferencesPanelKeyStores.28=Error en connectar amb targeta intel·ligent
PreferencesPanelKeyStores.29=Connexi\u00F3 correcta amb targeta intel·ligent.
PreferencesPanelKeyStores.30=Informaci\u00F3
PreferencesPanelKeyStores.31=Seleccione una targeta
PreferencesPanelKeyStores.32=Ometre certificat d'autenticaci\u00F3 de DNIe
PreferencesPanelKeyStores.33=<html>Agregue targetes intel·ligents per mitj&agrave; dels seus PKCS#11 per a poder accedir directament <br> als seus certificats.</html>
PreferencesPanelKeyStores.34=El nom de targeta introdu\u00EFt ja es troba registrat. Per favor, introdu\u00EFsca un diferent.
PreferencesPanelKeyStores.35=El controlador introdu\u00EFt ja es troba registrat. Per favor, introdu\u00EFsca un diferent.
PreferencesPanelKeyStores.36=No s'ha identificar el tipus de magatzem.

PreferencesPanelTimeStamps.0=Configuraci\u00F3 dels par\u00E0metres de segells de temps
PreferencesPanelTimeStamps.1=Di\u00E0leg per a configurar els par\u00E0metres de segells de temps
PreferencesPanelTimeStamps.2=Acceptar
PreferencesPanelTimeStamps.3=Tipus de segell de temps a aplicar
PreferencesPanelTimeStamps.4=URL de l'autoritat de segell de temps
PreferencesPanelTimeStamps.5=Pol\u00EDtica de segellament de temps
PreferencesPanelTimeStamps.6=Algorisme d'empremta digital
PreferencesPanelTimeStamps.7=Certificat de la TSA requerit
PreferencesPanelTimeStamps.8=Nom d'usuari de la TSA
PreferencesPanelTimeStamps.9=Contrasenya de l'usuari de la TSA
PreferencesPanelTimeStamps.10=OID de l'extensi\u00F3 a afegir a la petici\u00F3 al servidor de segell de temps (opcional)
PreferencesPanelTimeStamps.11=Valor, en binari convertit a Base64, de l'extensi\u00F3 a afegir a la petici\u00F3 al servidor de segell de temps
PreferencesPanelTimeStamps.12=L'OID de l'extensi\u00F3 indicada anteriorment \u00E9s cr\u00EDtica
PreferencesPanelTimeStamps.13=El format d'URL introdu\u00EFt \u00E9s erroni o buit
PreferencesPanelTimeStamps.14=Error URL
PreferencesPanelTimeStamps.15=El format d'OID introdu\u00EFt \u00E9s erroni
PreferencesPanelTimeStamps.16=Error OID
PreferencesPanelTimeStamps.17=Cancel·lar
PreferencesPanelTimeStamps.18=Polse este bot\u00F3 per a cancel·lar els canvis i tornar a la pantalla anterior

PreferencesPanelTrustedSites.0=Configuraci\u00F3 de les pol\u00EDtiques de certificaci\u00F3 permeses
PreferencesPanelTrustedSites.1=Di\u00E0leg per a configurar que pol\u00EDtiques de certificaci\u00F3 estaran permeses per a les operacions de signatura
PreferencesPanelTrustedSites.10=Polse este bot\u00F3 per a acceptar els canvis i tornar a la pantalla anterior
PreferencesPanelTrustedSites.11=Cancel·lar
PreferencesPanelTrustedSites.12=Polse este bot\u00F3 per a cancel·lar els canvis i tornar a la pantalla anterior
PreferencesPanelTrustedSites.13=Error
PreferencesPanelTrustedSites.14=Necessita afegir almenys un OID per a habilitar el filtre.
PreferencesPanelTrustedSites.2=<html>Agregue o lleve els OID de les pol&iacute;tiques que desitge admetre en signatures electr&ograve;niques.</html>
PreferencesPanelTrustedSites.3=Afegir OID:
PreferencesPanelTrustedSites.4=Agregar
PreferencesPanelTrustedSites.5=Polse este bot\u00F3 per a afegir el lloc seleccionat
PreferencesPanelTrustedSites.6=OID de pol\u00EDtiques admeses per a signatura:
PreferencesPanelTrustedSites.7=Llevar
PreferencesPanelTrustedSites.8=Polse este bot\u00F3 per a llevar el lloc seleccionat
PreferencesPanelTrustedSites.9=Acceptar

PreferencesPanelPolicy.0 = Ha ocorregut un error configurant la pol\u00edtica
PreferencesPanelPolicy.1 = L'identificador de pol\u00edtica no pot ser nul ni buit
PreferencesPanelPolicy.2 = L'identificador ha de ser una URI v\u00e0lida
PreferencesPanelPolicy.3 = Si s'indica l'empremta digital \u00e9s obligatori indicar tamb\u00e9 l'algorisme
PreferencesPanelPolicy.4 = Si no s'especifica l'empremta digital, l'identificador ha de ser una URI accessible
PreferencesPanelPolicy.5 = L'empremta digital ha d'estar en format Base64
PreferencesPanelPolicy.6 = El qualificador ha de ser una URI v\u00e0lida
PreferencesPanelPolicy.7 = L'identificador ha de tindre un format OID v\u00e0lid
PreferencesPanelPolicy.8 = L'empremta digital no pot estar buida
PreferencesPanelPolicy.9 = El qualificador ha de ser una URL v\u00e0lida

ProxyDialog.0=Configuraci\u00F3 de proxy
ProxyDialog.1=L'host no \u00E9s v\u00E0lid
ProxyDialog.10=<html>Connexi&oacute; <i>incorrecta</i></html>
ProxyDialog.11=Autodetectar
ProxyDialog.12=Panell per a configurar un servidor de proxy
ProxyDialog.13=Polse este bot\u00F3 per a autodetectar si hi ha proxys en el sistema
ProxyDialog.14=No s'han detectat proxies en el sistema
ProxyDialog.15=La configuraci\u00F3 de proxy s'aplica a HTTP, HTTPS, FTP i SOCKS.
ProxyDialog.16=Usuari:
ProxyDialog.17=Contrasenya:
ProxyDialog.18=No es va poder carregar la contrasenya del proxy. S'ometr\u00E0 el valor actual.
ProxyDialog.19=No es va poder guardar la contrasenya del proxy. S'ignorar\u00E0 la contrasenya establida.
ProxyDialog.2=Error
ProxyDialog.20=No usar proxy per a les seg\u00FCents IP i adreces de domini:
ProxyDialog.21=<html>Les direccions se separen amb comes (,) i es pot utilitzar asterisc (*) al principi<br>i fi de les direccions com a comod&iacute;.</html>
ProxyDialog.22=Sense proxy
ProxyDialog.23=Usar la configuraci\u00F3 de proxy del sistema
ProxyDialog.24=Configuraci\u00F3 manual del proxy
ProxyDialog.3=El port no \u00E9s v\u00E0lid
ProxyDialog.4=Usar un servidor proxy per a les connexions de xarxa.
ProxyDialog.5=Host: 
ProxyDialog.6=Polse este bot\u00F3 per a comprovar la connexi\u00F3 de les dades introdu\u00EFdes
ProxyDialog.7=Port:
ProxyDialog.8=Verificar connexi\u00F3
ProxyDialog.9=<html>Connexi&oacute; <i>correcta</i></html>

SecureDomainsDialog.0=Llistat de dominis segurs
SecureDomainsDialog.1=Error
SecureDomainsDialog.2=<html>Es consideren dominis segurs tots aquells en els quals la connexi&oacute; est&agrave; xifrada<br>amb un certificat SSL reconegut internacionalment, vigent i em&eacute;s per al domini<br>en q\u00FCesti&oacute;. Addicionalment, es consideraran dominis segurs tots aquells<br>recollits en este llistat.</html>
SecureDomainsDialog.3=<html>Les direccions se separen per comes (,) o salts de l&iacute;nia i es poden utilitzar<br>asteriscos (*) al principi i final de cadascuna d'elles com a comod&iacute;.</html>
SecureDomainsDialog.4=Introdu\u00EFsca nom\u00E9s un tipus de separador entre direccions. Comes o salts de l\u00EDnia.
SecureDomainsDialog.5=Introdu\u00EFsca almenys un domini.

TrustedCertificatesDialog.0=Certificats de confian\u00E7a
TrustedCertificatesDialog.1=Certificats importats
TrustedCertificatesDialog.2=Importar...
TrustedCertificatesDialog.3=Veure certificat
TrustedCertificatesDialog.5=Eliminar
TrustedCertificatesDialog.6=Importar certificats
TrustedCertificatesDialog.7=<html>Agregue nous certificats al seu magatzem de confian\u00E7a per a permetre la connexi&oacute; als llocs <br>web que els utilitzen.</html>
TrustedCertificatesDialog.8=Importar certificat local
TrustedCertificatesDialog.9=C\u00E0rrega un certificat en disc per a revisar-lo i importar-lo en el magatzem de confian\u00E7a.
TrustedCertificatesDialog.10=Importar certificat des d'URL
TrustedCertificatesDialog.11=URL
TrustedCertificatesDialog.12=Obtindre certificat
TrustedCertificatesDialog.13=Examinar
TrustedCertificatesDialog.14=Confirmar importaci\u00F3 del certificat
TrustedCertificatesDialog.15=S'han carregat els seg\u00FCents certificats:
TrustedCertificatesDialog.17=Veure certificat
TrustedCertificatesDialog.18=Ometre
TrustedCertificatesDialog.19=Importar certificats
TrustedCertificatesDialog.20=Seleccione el certificat a importar
TrustedCertificatesDialog.21=Certificats digitals (*.cer, *.cert, *.crt)
TrustedCertificatesDialog.22=Verificaci\u00F3 de domini
TrustedCertificatesDialog.23=<html>S'ha tractat de connectar amb el domini<br> %0 que presenta un certificat SSL que no &eacute;s de confian\u00E7a. <br>Desitja importar este certificat al seu magatzem de confian\u00E7a?</html>
TrustedCertificatesDialog.24=Pas 1: Verifique el seu certificat.
TrustedCertificatesDialog.25=Pas 2: Import el certificat si el considera de confian\u00E7a.
TrustedCertificatesDialog.26=Error en crear magatzem de confian\u00E7a.
TrustedCertificatesDialog.27=Error en obtindre el certificat.
TrustedCertificatesDialog.28=Tancar
TrustedCertificatesDialog.29=\u00BFEst\u00E1 segur que vol eliminar el certificat '%0'?
TrustedCertificatesDialog.30=Error en eliminar certificat de confian\u00E7a.
TrustedCertificatesDialog.31=No s'ha indicat una URL v\u00E0lida.
TrustedCertificatesDialog.32=No s'ha pogut carregar el magatzem de confian\u00E7a d'Autofirma. Voleu regenerar-ho?
TrustedCertificatesDialog.33=Nom
TrustedCertificatesDialog.34=Em\u00E8s per
TrustedCertificatesDialog.35=Data d'expiraci\u00F3

PolicyDialog.0=Configuraci\u00F3 de la pol\u00EDtica de signatura
PolicyDialog.1=L'identificador de la pol\u00EDtica no \u00E9s v\u00E0lid 
PolicyDialog.2=Error

SmartCardDialog.0=Agregar targeta com a magatzem de claus
SmartCardDialog.1=Nom de la targeta
SmartCardDialog.2=Controlador PKCS#11
SmartCardDialog.3=Examinar
SmartCardDialog.4=Connectar
SmartCardDialog.5=Introduir un nom per a la targeta que es vol afegir
SmartCardDialog.6=Ruta del controlador PKCS#11 corresponent a la targeta
SmartCardDialog.7=Seleccionar controlador
SmartCardDialog.8=Controladors PKCS\#11
SmartCardDialog.9=Modificar targeta
SmartCardDialog.10=Eliminar targeta

ShowFileLinkAction.1=Guardar dades
ShowFileLinkAction.2=No s'ha pogut obrir el fitxer,\ncompruebe que disposa d'una aplicaci\u00F3 instal·lada per a visualitzar fitxers '%0'
ShowFileLinkAction.3=No s'ha pogut guardar el fitxer
ShowFileLinkAction.4=Error
ShowFileLinkAction.5=document

SignatureAttributesDialog.0=Atributs de signatura
SignatureAttributesDialog.1=<html>A m&eacute;s de les dades, la data i hora i el certificat de signatura que seleccione,<br>la signatura electr&ograve;nica del document inclour&agrave; els seg\u00FCents atributs:</html>
SignatureAttributesDialog.2=Pol\u00EDtica de signatura:
SignatureAttributesDialog.3=Identificador:
SignatureAttributesDialog.4=Empremta digital: 
SignatureAttributesDialog.5=Algorisme de petjada: 
SignatureAttributesDialog.6=Descripci\u00F3: 
SignatureAttributesDialog.7=Refer\u00E8ncia: 
SignatureAttributesDialog.8=Lloc de signatura:
SignatureAttributesDialog.9=Adre\u00E7a: 
SignatureAttributesDialog.10=Ciutat: 
SignatureAttributesDialog.11=Prov\u00EDncia: 
SignatureAttributesDialog.12=Codi postal: 
SignatureAttributesDialog.13=Pa\u00EDs: 
SignatureAttributesDialog.14=Rol de signatura:
SignatureAttributesDialog.15=Rols declarats: 
SignatureAttributesDialog.16=<html>La signatura es realitzar&agrave; sobre les dades del document, la data i hora i el certificat de signatura que seleccione.<br>No s'han definit atributs de signatura addicionals.</html>
SignatureAttributesDialog.17=Ra\u00F3 de signatura:
SignatureAttributesDialog.18=Informaci\u00F3 de contacte:
SignatureAttributesDialog.19=Informaci\u00F3 addicional:

ChangeFormatDialog.0=Configuraci\u00F3 de signatura
ChangeFormatDialog.1=Seleccione el format de signatura que s'utilitzar\u00E0 per al fitxer:
ChangeFormatDialog.2=(Recomanat)

SignDataPanel.0=Fitxer de signatura
SignDataPanel.1=Ruta del fitxer de signatura analitzat
SignDataPanel.10=Fitxer de tipus Factura Electr\u00F2nica (XML) signada
SignDataPanel.12=Polse en la descripci\u00F3 del certificat per a obtindre informaci\u00F3 addicional sobre ell o afegir-lo al magatzem de certificats del seu sistema operatiu
SignDataPanel.13=Descripci\u00F3 del certificat
SignDataPanel.14=Informaci\u00F3 resumida del certificat, polse sobre esta per a obrir una nova finestra amb informaci\u00F3 addicional
SignDataPanel.15=Comprovar validesa
SignDataPanel.16=Comprova la validesa del certificat contra l'OCSP de la seua autoritat de certificaci\u00F3
SignDataPanel.17=Bot\u00F3 per a validar el certificat
SignDataPanel.18=Comprova la validesa del certificat contra l'OCSP de la seua autoritat de certificaci\u00F3
SignDataPanel.2=Fitxer signat:
SignDataPanel.21=Certificat de signatura utilitzat:
SignDataPanel.22=Dades de la signatura:
SignDataPanel.23=No s'ha pogut obrir el fitxer,\ncompruebe que disposa d'una aplicaci\u00F3 instal·lada per a visualitzar Certificats X.509
SignDataPanel.24=Dades en mem\u00F2ria
SignDataPanel.25=Format de signatura
SignDataPanel.26=Dades signades
SignDataPanel.27=La signatura no cont\u00E9 les dades signades
SignDataPanel.28=Veure dades signades
SignDataPanel.29=\u00C1rbol de signatures del document
SignDataPanel.3=Veure fitxer
SignDataPanel.30=Copiar la ruta del fitxer
SignDataPanel.31=Signatura electr\u00F2nica
SignDataPanel.32=No s'han trobat signants
SignDataPanel.4=Obri el fitxer signat amb l'aplicaci\u00F3 configurada en el seu sistema operatiu
SignDataPanel.40=Fitxer de tipus Microsoft Office (OOXML)
SignDataPanel.41=Fitxer de tipus OpenDocument (ODF)
SignDataPanel.42=Segells de temps
SignDataPanel.43=Fitxer
SignDataPanel.44=Format
SignDataPanel.45=Grand\u00E0ria
SignDataPanel.46=Enlla\u00E7 a 
SignDataPanel.47=Llista d'arxius a signar 
SignDataPanel.5=Bot\u00F3 per a obrir les dades signades
SignDataPanel.6=Obri el document signat amb l'aplicaci\u00F3 configurada en el sistema
SignDataPanel.7=No s'ha pogut obrir el fitxer,\ncompruebe que no ha sigut manipulat mentre s'executava esta aplicaci\u00F3\n i que disposa d'una aplicaci\u00F3 instal·lada per a visualitzar-lo
SignDataPanel.9=Fitxer de tipus Portable Document Format (PDF)
SignDetailPanel.0=Signar m\u00E9s fitxers

MassiveResultProcessPanel.0=Directori d'eixida
MassiveResultProcessPanel.1=Ruta del directori en el qual s'han emmagatzemat les signatures
MassiveResultProcessPanel.10=Grand\u00E0ria
MassiveResultProcessPanel.11=Estat
MassiveResultProcessPanel.12=Llista de documents signats 
MassiveResultProcessPanel.13=Signatura correcta 
MassiveResultProcessPanel.14=Signatura incorrecta  
MassiveResultProcessPanel.2=Copiar la ruta del directori
MassiveResultProcessPanel.3=Directori de signatures:
MassiveResultProcessPanel.4=Obrir directori
MassiveResultProcessPanel.5=Obri el directori amb les signatures generades en el seu explorador d'arxius
MassiveResultProcessPanel.6=Bot\u00F3 per a obrir el directori
MassiveResultProcessPanel.7=Obri el directori amb les signatures generades en el seu explorador d'arxius
MassiveResultProcessPanel.8=No s'ha pogut obrir el fitxer,\ncompruebe que no ha sigut manipulat mentre s'executava esta aplicaci\u00F3
MassiveResultProcessPanel.9=Fitxer

SignPanel.0=Fitxer de tipus Portable Document Format (PDF)
SignPanel.1=El fitxer \u00E9s massa gran i no es pot signar per falta de mem\u00F2ria
SignPanel.10=Document XML
SignPanel.11=Document binari gen\u00E8ric
SignPanel.12=Fitxer binari gen\u00E8ric
SignPanel.13=Per favor, espere mentre s'inicialitza el magatzem de claus
SignPanel.14=Benvingut a Autofirma
SignPanel.15=Signant electr\u00F2nicament el fitxer
SignPanel.16=Afegir signatura
SignPanel.17=Fitxer de tipus Factura-e (Factura Electr\u00F2nica)
SignPanel.19=No s'ha pogut completar la selecci\u00F3 de certificats.
SignPanel.20=Factura-e (Factura Electr\u00F2nica)
SignPanel.21=No es permet la signatura de directoris,\n\u00FAnicamente de fitxers individuals.
SignPanel.22=S'intenta carregar una factura electr\u00F2nica ja signada. No es permet agregar noves signatures a\r\nuna factura electr\u00F2nica. Es cancel·lar\u00E0 l'operaci\u00F3.
SignPanel.23=La contrasenya proporcionada per a signar el PDF no \u00E9s v\u00E0lida.
SignPanel.24=No se suporta la signatura de fitxers remots amb esta aplicaci\u00F3,\nseleccione un fitxer local per a signar-lo
SignPanel.25=Signant...
SignPanel.26=El fitxer \u00E9s massa gran.\nSu sistema no pot signar fitxers tan grans per falta de mem\u00F2ria.
SignPanel.29=El magatzem no cont\u00E9 cap certificat que es puga usar per a signar.
SignPanel.3=El fitxer seleccionat no existeix, i per tant no pot signar-se.
SignPanel.30=Document OpenDocument (ODF)
SignPanel.31=Fitxer ODF (Open Document Format)
SignPanel.32=Seleccionar fitxers a signar
SignPanel.33=Polse este bot\u00F3 o arrossegament un fitxer a l'\u00E0rea inferior per a iniciar el proc\u00E9s de selecci\u00F3 de fitxer a signar
SignPanel.34=Bot\u00F3 de selecci\u00F3 de fitxer a signar
SignPanel.35=Seleccione el fitxer a signar
SignPanel.36=No s'ha pogut llegir el contingut del fitxer a signar,\ncompruebe que no esta obert per una altra aplicaci\u00F3 i\nsi est\u00E0 en emmagatzematge extraible prove d'expulsar-ho\ne inserir-ho de nou
SignPanel.37=Document Microsoft Office (OOXML)
SignPanel.38=Fitxer OOXML (Office Open XML)
SignPanel.39=Document de signatura
SignPanel.40=<html><p>En esta pantalla pot signar electr&ograve;nicament fitxers que es troben en el seu disc dur.<br>Quan signatura electr&ograve;nicament un fitxer poden incorporar-se a este certes dades personals, entre els quals poden trobar-se el seu n&uacute;mero de DNI, el seu nom i cognoms o fins i tot informaci&oacute; sobre la seua situaci&oacute; laboral si utilitza un certificat professional. Consulte les pol&iacute;tiques de seguretat i protecci&oacute; de dades dels receptors dels fitxers signats abans d'enviar-los o distribuir-los.</p>A partir d'este punt, si inserida o extrau una targeta intel·ligent o dispositiu criptogr&agrave;fic USB haur&agrave; de seleccionar el magatzem de claus apropiat des del di&agrave;leg de selecci&oacute; de certificats o polsar el bot&oacute; Actualitzar per a recarregar el magatzem seleccionat.</html>
SignPanel.41=Polse el bot\u00F3 o arrossegue fitxers o directoris a esta \u00E0rea
SignPanel.42=Arrossegament un fitxer a este \u00E0rea per a seleccionar-lo i poder signar-lo electr\u00F2nicament
SignPanel.43=Panell d'arrossegament de fitxer
SignPanel.44=Fer la signatura visible dins del PDF
SignPanel.45=Signar
SignPanel.46=Tipus de fitxer: %0
SignPanel.47=Data \u00FAltima modificaci\u00F3: %0
SignPanel.48=<html>Realitzant la signatura electr&ograve;nica...<br>Esta tasca pot tardar diversos minuts.</html>
SignPanel.49=Grand\u00E0ria: 
SignPanel.5=El fitxer seleccionat est\u00E0 buit.\nNo \u00E9s possible signar fitxers buits.
SignPanel.50=Proc\u00E9s de signatura electr\u00F2nica
SignPanel.51=Veure Fitxer
SignPanel.52=Bot\u00F3 de veure fitxer
SignPanel.53=No s'ha pogut obrir el fitxer.\nCompruebe que disposa d'una aplicaci\u00F3 instal·lada per a veure este tipus de fitxers\ny que este no ha sigut manipulat mentre s'executava esta aplicaci\u00F3
SignPanel.55=No s'ha trobat cap certificat per a signar,\nCompruebe el seu magatzem de claus i import un si \u00E9s necessari
SignPanel.56=Es va trobar un error durant l'operaci\u00F3 amb el certificat seleccionat.
SignPanel.6=Fitxer de signatura 
SignPanel.65=Va oc\u00F3rrer un problema durant el proc\u00E9s de signatura, prove de reintentar\nla signatura reiniciant l'aplicaci\u00F3
SignPanel.7=No es tenen permisos de lectura per al fitxer seleccionat.\nSeleccione un altre fitxer o habilite els permisos de lectura per a este.
SignPanel.72=Documents Adobe PDF (*.pdf)
SignPanel.76=Signatures XML (*.xml, *.xsig)
SignPanel.8=Fitxer de tipus XML
SignPanel.80=Signatures bin\u00E0ries (*.csig, *.p7s)
SignPanel.81=Guardar fitxer signat
SignPanel.84=Ja existeix un fitxer amb eixe nom,\nVoleu sobreescriure'l?
SignPanel.88=No s'ha pogut guardar el resultat de la signatura, asegures\u00E9 de\nque el fitxer seleccionat no est\u00E0 obert per una altra aplicaci\u00F3 i\nde que compta amb els permisos adequats i reintente l'operaci\u00F3
SignPanel.89=No s'ha pogut guardar les dades, asegures\u00E9 de\nque el fitxer seleccionat no est\u00E0 obert per una altra aplicaci\u00F3 i\nde que compta amb els permisos adequats i reintente l'operaci\u00F3
SignPanel.9=Document Adobe PDF
SignPanel.91=Documents Microsoft Word (*.docx)
SignPanel.92=Documents Microsoft Powerpoint (*.pptx)
SignPanel.93=Documents Microsoft Excel (*.xslx)
SignPanel.94=Documents Microsoft Office (*.ooxml)
SignPanel.96=Textos d'OpenDocument (*.odt)
SignPanel.97=Presentacions d'OpenDocument (*.odp)
SignPanel.98=Fulls de c\u00E0lcul d'OpenDocument (*.ods)
SignPanel.99=Documents OpenDocument (*.odf)
SignPanel.100=No s'han pogut guardar els par\u00E0metres de la signatura visible
SignPanel.101=L'arxiu no \u00E9s un format d'im\u00E1gen valgut
SignPanel.102=El document indicat no permet que se li agreguen signatures
SignPanel.103=Format: %0 
SignPanel.104=Signatura PDF
SignPanel.105=Signatura de FacturaE
SignPanel.106=Signatura XAdES
SignPanel.107=Signatura CAdES
SignPanel.108=Signatura ODF
SignPanel.109=Signatura OOXML
SignPanel.110=Format desconegut
SignPanel.111=El plugin %0 ha retornat un error en processar les dades d'entrada: %1
SignPanel.112=El plugin %0 ha retornat un error en processar la signatura generada: %1
SignPanel.113=No s'ha pogut carregar el llistat de plugins. No s'usaren per al processament de les dades.
SignPanel.114=No s'ha pogut carregar el llistat de plugins. No s'usaren per al processament de la signatura.
SignPanel.115=El plugin %0 ha retornat un error en reiniciar-se per a permetre noves signatures: %1
SignPanel.116=Cosignatura
SignPanel.117=Contrafirma (\u00FAnicament dels nodes fulla)
SignPanel.118=Contrafirma (de tot l'arbre)
SignPanel.119=Opcions Avan\u00E7ades
SignPanel.120=Inserir una marca visible dins del PDF
SignPanel.121=No es poden aplicar marques visibles a documents ja signats
SignPanel.123=No s'ha pogut carregar el fitxer seleccionat.
SignPanel.124=Tipus de certificat no suportat: %0
SignPanel.125=No es troben les dades signades
SignPanel.126=Informaci\u00F3 corrupta
SignPanel.127=La signatura no es correspon amb les dades signades
SignPanel.128=No es troba la signatura dins del document
SignPanel.129=No es pot extraure un certificat o no \u00E9s v\u00E0lid
SignPanel.130=Certificat de signatura caducat
SignPanel.131=Certificat de signatura que encara no \u00E9s v\u00E0lid
SignPanel.132=Algorisme no reconegut o no suportat
SignPanel.133=No se suporta la CA d'expedici\u00F3
SignPanel.134=CRLs de signatura err\u00F2nies
SignPanel.135=No es pot comprovar la validesa de la signatura PDF
SignPanel.136=No es pot comprovar la validesa de la signatura OOXML
SignPanel.137=No es pot comprovar la validesa de la signatura ODF
SignPanel.138=No es pot comprovar la validesa de la signatura
SignPanel.139=Format de signatura no reconegut
SignPanel.140=Signatura inv\u00E0lida
SignPanel.141=No es pot completar la validaci\u00F3
SignPanel.142=Configuraci\u00F3 de signatura:
SignPanel.143=Atributs de signatura:
SignPanel.144=Rols del signant: %0
SignPanel.145=Informaci\u00F3 del document:
SignPanel.146=Veure tots els atributs...
SignPanel.147=(Signatura inv\u00E0lida)
SignPanel.148=Veure atributs de signatura
SignPanel.149=Lloc de signatura
SignPanel.150=No es pot signar amb format FacturaE la factura ja signada
SignPanel.151=\u00E9s possible que el document s'haja modificat despues de signar-se
SignPanel.152=Possible solapament entre signatures visibles
SignPanel.153=Confirmaci\u00F3 requerida
SignPanel.154=No es va poder completar la signatura: %0
SignPanel.155=Resultat de validaci\u00F3:
SignPanel.156=Signatura v\u00E0lida
SignPanel.157=(Canviar)
SignPanel.158=No es poden agregar signatures certificades a un document ja signat
SignPanel.159=El document certificat no permetia noves signatures

SignPanelSignTask.0=<html>Creant previsualitzaci&oacute; del PDF.<br>Esta tasca pot tardar diversos minuts.</html>
SignPanelSignTask.1=Selecci\u00F3 de camp PDF per a signatura visible
SignPanelSignTask.3=Seleccione el directori d'eixida
SignPanelSignTask.4=Confirmaci\u00F3 requerida

SignResultPanel.0=No ha sigut possible recuperar la informaci\u00F3 addicional,\npruebe a obrir la seg\u00FCent URL des d'un navegador Web:\n
SignResultPanel.10=La signatura electr\u00F2nica \u00E9s v\u00E0lida quant a estructura
SignResultPanel.11=No s'ha pogut completar la validaci\u00F3
SignResultPanel.12=Ha ocorregut un error que ha impedit la validaci\u00F3 de la signatura electr\u00F2nica.
SignResultPanel.13=Es desconeix la validesa de la signatura
SignResultPanel.14=Signatura electr\u00F2nica corrupta.
SignResultPanel.15=No es disposa de les dades originals per a la validaci\u00F3 de la signatura electr\u00F2nica.
SignResultPanel.16=Algun dels certificats de signatura est\u00E0 caducat.
SignResultPanel.17=Algun dels certificats de signatura fins i tot no \u00E9s v\u00E0lid.
SignResultPanel.18=No s'ha pogut extraure el certificat de signatura o aquest est\u00E0 corrupte.
SignResultPanel.19=Les dades contingudes o referenciades en la signatura no es corresponen amb les dades signades.
SignResultPanel.2=Proc\u00E9s de signatura completat satisfact\u00F2riament
SignResultPanel.21=Ha ocorregut un problema processant les llistes de certificats revocats.
SignResultPanel.20=Es va detectar un error en les CRL de la signatura.
SignResultPanel.22=S'ha trobat un algorisme no reconegut o no suportat.
SignResultPanel.23=S'han produ\u00EFt errors en signar un o diversos dels documents seleccionats. 
SignResultPanel.24=Comprove la validesa de la signatura en la seua aplicaci\u00F3 de lectura de PDF.
SignResultPanel.25=Comprove la validesa de la signatura amb l'\u00FAltima versi\u00F3 disponible de Microsoft Office.
SignResultPanel.26=Comprove la validesa de la signatura amb l'\u00FAltima versi\u00F3 disponible del seu programa compatible amb OpenDocument (LibreOffice, Apatxe OpenOffice, etc.)
SignResultPanel.27=Proc\u00E9s finalitzat correctament
SignResultPanel.28=Totes les signatures s'han generat correctament. Pot validar estes o altres signatures electr\u00F2niques en:
SignResultPanel.29=Totes les signatures del lot s'han generat correctament.
SignResultPanel.30=Proc\u00E9s finalitzat amb errors
SignResultPanel.31=Va oc\u00F3rrer un error en signar un o diversos dels documents seleccionats. Comprove que estos documents existeixen i poden llegir-se. Ferm els documents individualment si persisteix el problema. Pot validar les signatures generades correctament en:
SignResultPanel.32=Va oc\u00F3rrer un error en signar algun dels documents seleccionats.
SignResultPanel.33=https://valide.redsara.es/
SignResultPanel.34=No es va poder aplicar la signatura visible correctament als seg\u00FCents documents, \nya que la posici\u00F3 o p\u00E0gines on introduir la mateixa es trobava fora de rang:\n
SignResultPanel.35=S'han trobat canvis en un formulari del PDF posteriors a la signatura.
SignResultPanel.36=\u00E9s probable que el document haja sigut modificat despr\u00E9s de l'\u00FAltima signatura.
SignResultPanel.37=Hi ha signatures solapades en el document, la qual cosa pot ocultar informaci\u00F3 d'aquest.
SignResultPanel.38=Detalls de la signatura
SignResultPanel.39=No es permet la validaci\u00F3 de signatures amb refer\u00E8ncies externes.
SignResultPanel.40=La signatura cont\u00E9 atributs longeus que Autofirma no pot validar. Per a una validaci\u00F3 completa acudisca a VALIDe.
SignResultPanel.3=La signatura \u00E9s correcta quant a estructura, per\u00F2 per a determinar la seua completa validesa legal ha de comprovar a m\u00E9s la validesa dels certificats usats. Per a aix\u00F2, pot validar esta o altres signatures electr\u00F2niques en:
SignResultPanel.4=S'ha generat correctament una signatura electr\u00F2nica
SignResultPanel.5=La signatura no \u00E9s v\u00E0lida o no est\u00E0 suportada
SignResultPanel.6=La signatura electr\u00F2nica seleccionada no \u00E9s v\u00E0lida
SignResultPanel.8=Signatura electr\u00F2nica v\u00E0lida
SignResultPanel.9=La signatura \u00E9s correcta quant a estructura, per\u00F2 per a determinar la seua completa validesa legal ha de comprovar a m\u00E9s la validesa dels certificats usats. Pot validar esta o altres signatures electr\u00F2niques en:

ValidationInfoDialog.0=Detalls de la signatura i errors de validaci\u00F3
ValidationInfoDialog.1=Informaci\u00F3 sobre la signatura:
ValidationInfoDialog.2=Certificat caducat.
ValidationInfoDialog.3=Certificat no v\u00E0lid encara.
ValidationInfoDialog.4=No s'ha pogut verificar la informacion del signant.
ValidationInfoDialog.5=La clau de signatura no \u00E9s v\u00E0lida o no \u00E9s compatible amb l'algorisme de signatura declarat.
ValidationInfoDialog.6=Ciutat
ValidationInfoDialog.7=Estat o prov\u00EDncia
ValidationInfoDialog.8=Codi postal
ValidationInfoDialog.9=Pa\u00EDs
ValidationInfoDialog.10=Paper del signant
ValidationInfoDialog.11=Carrer
ValidationInfoDialog.12=La signatura es troba dins del XML signat.
ValidationInfoDialog.14=Dades annexes a la signatura.
ValidationInfoDialog.16=Relaci\u00F3 interna de dades.
ValidationInfoDialog.17=No s'ha pogut llegir correctament el fitxer de signatura.
ValidationInfoDialog.18=Ra\u00F3 de signatura
ValidationInfoDialog.19=Localitzaci\u00F3
ValidationInfoDialog.20=Informaci\u00F3 de contacte
ValidationInfoDialog.21=La signatura cont\u00E9 les dades.
ValidationInfoDialog.22=La signatura no cont\u00E9 les dades.
ValidationInfoDialog.23=Localitat
ValidationInfoDialog.24=Dades bin\u00E0ries
ValidationInfoDialog.25=PDF
ValidationInfoDialog.26=XML
ValidationInfoDialog.27=PostScript
ValidationInfoDialog.28=HTML
ValidationInfoDialog.29=TIFF
ValidationInfoDialog.30=GIF
ValidationInfoDialog.31=JPEG
ValidationInfoDialog.32=PNG
ValidationInfoDialog.33=MPEG
ValidationInfoDialog.34=SGML
ValidationInfoDialog.35=Microsoft Word
ValidationInfoDialog.36=Microsoft Excel
ValidationInfoDialog.37=Microsoft Project
ValidationInfoDialog.38=Microsoft Powerpoint
ValidationInfoDialog.38=Microsoft Works
ValidationInfoDialog.39=JPG
ValidationInfoDialog.40=Correcta. No s'ha realitzat la comprovaci\u00F3 de revocaci\u00F3 del certificat.
ValidationInfoDialog.41=No s'admeten canvis.
ValidationInfoDialog.42=Nom\u00E9s es permeten accions d'emplenat de formularis, signatura i addici\u00F3 de p\u00E0gines.
ValidationInfoDialog.43=Nom\u00E9s es permeten accions de comentaris, emplenat de formularis, signatura i addici\u00F3 de p\u00E0gines.
ValidationInfoDialog.44=Format
ValidationInfoDialog.45=Localitzaci&oacute; de les dades
ValidationInfoDialog.46=Informaci&oacute; sobre dades signades
ValidationInfoDialog.47=Descripci&oacute;
ValidationInfoDialog.48=Tipus de document
ValidationInfoDialog.49=Arbre de signants
ValidationInfoDialog.50=Resultat de la validaci&oacute;
ValidationInfoDialog.51=Signatura
ValidationInfoDialog.52=Perfil de signatura
ValidationInfoDialog.53=PDF certificat
ValidationInfoDialog.54=Algorisme de signatura
ValidationInfoDialog.55=Data i hora de signatura
ValidationInfoDialog.56=Pol&iacute;tica de signatura
ValidationInfoDialog.57=Identificador
ValidationInfoDialog.58=Hash
ValidationInfoDialog.59=Algorisme
ValidationInfoDialog.60=Qualificador
ValidationInfoDialog.61=Metadades
ValidationInfoDialog.62=Rols
ValidationInfoDialog.63=Certificat
ValidationInfoDialog.64=Nom
ValidationInfoDialog.65=Emissor
ValidationInfoDialog.66=Data de caducitat
ValidationInfoDialog.67=Encoding
ValidationInfoDialog.68=Validaci&oacute;

RestoreConfigPanel.1=Iniciar restauraci\u00F3
RestoreConfigPanel.2=Polse este bot\u00F3 per a iniciar la restauraci\u00F3 de la configuraci\u00F3 en navegadors i connexions d'Autofirma.
RestoreConfigPanel.3=Bot\u00F3 per a iniciar el proc\u00E9s de restauraci\u00F3 de la configuraci\u00F3 de navegadors i connexions d'Autofirma.
RestoreConfigPanel.4=<html><p>Autofirma permet generar signatures electr\u00F2niques com a part d'un tr\u00E0mit web compatible d'administraci\u00F3 electr\u00F2nica. Per a aix\u00F2 \u00E9s necessari que el seu sistema es trobe correctament configurat. Si instal·la un nou navegador web, es d\u00F3na d'alta un nou usuari en el sistema o tens problemes en signar en un tr\u00E0mit web, utilitze esta funci\u00F3 per a restaurar la comunicaci\u00F3 entre Autofirma i els seus navegadors web.</p>
RestoreConfigPanel.5=Tancar
RestoreConfigPanel.6=Tanca el di\u00E0leg de restauraci\u00F3
RestoreConfigPanel.7=Configurar Firefox perqu\u00E8 confie en els certificats arrel del sistema.
RestoreConfigPanel.8=En activar-ho, es configura Firefox perqu\u00E8 conf\u00FDe en els certificats de les entitats de certificaci\u00F3 ra\u00FDz de confian\u00E7a del sistema. Si no s'activa, es desactivar\u00E0 esta opci\u00F3 de Firefox. 
RestoreConfigPanel.9=Casella de verificaci\u00F3 per a activar o desactivar 

SimpleAfirma.0=No s'ha pogut llegir el contingut del fitxer a signar,\ncompruebe que no esta obert per una altra aplicaci\u00F3 i\nsi est\u00E0 en emmagatzematge extraible prove d'expulsar-ho\ne inserir-ho de nou
SimpleAfirma.10=Autofirma v%0
SimpleAfirma.11=No es va poder aplicar la configuraci\u00F3 de proxy configurada. Aix\u00F2 pot afectar del seu \u00FAs des d'aplicacions web. 
SimpleAfirma.2=El fitxer no existeix o no \u00E9s accessible per a lectura
SimpleAfirma.3=L'aplicaci\u00F3 ja s'est\u00E0 executant en una altra finestra.\n\u00DAnicamente es permet una inst\u00E0ncia activa.
SimpleAfirma.4=No s'han pogut carregar els plugins en l'aplicaci\u00F3.
SimpleAfirma.42=No s'ha pogut inicialitzar ni el seu DNIe ni el magatzem de claus del seu sistema operatiu.\nNo podr\u00E0 realitzar signatures electr\u00F2niques.
SimpleAfirma.47=Voleu tancar l'aplicaci\u00F3 de signatura?
SimpleAfirma.48=Advertiment
SimpleAfirma.49=Autofirma s'est\u00E0 executant amb Java %0. Esta versi\u00F3 no est\u00E0 oficialment suportada i poden produir-se errors durant la seua execuci\u00F3.
SimpleAfirma.50=Versi\u00F3 de Java no suportada
SimpleAfirma.51=No tornar a mostrar
SimpleAfirma.52=Va oc\u00F3rrer un error inesperat en executar l'acci\u00F3.
SimpleAfirma.53=Error en llegir l'arxiu d'ajuda.
SimpleAfirma.54=Error en seleccionar el magatzem configurat. Es carregar\u00E0 el del sistema.
SimpleAfirma.56=Error en llegir magatzem. Es carregar\u00E0 el del sistema.
SimpleAfirma.57=Operaci\u00F3 cancel·lada. Es carregar\u00E0 el magatzem de claus del sistema.
SimpleAfirma.58=No s'ha pogut carregar l'ajuda correctament.
SimpleAfirma.6=No s'ha pogut inicialitzar el magatzem de claus.\nNo podr\u00E0 realitzar signatures electr\u00F2niques.
SimpleAfirma.7=Error
SimpleAfirma.8=Problema en l'operaci\u00F3
SimpleAfirma.9=No es permet agregar noves signatures a documents amb signatures no v\u00E0lides. 

SimpleKeyStoreManager.0=Introdu\u00EFsca la contrasenya mestra de Mozilla Firefox
SimpleKeyStoreManager.1=No s'ha detectat un DNIe inserit Voleu reintentar?
SimpleKeyStoreManager.9=El seu DNIe est\u00E0 bloquejat, ha d'acudir a una comissaria de policia per a desbloquejar-ho.\nSe continuar\u00E0 amb el magatzem per defecte del sistema.
SimpleKeyStoreManager.10=Detectat DNIe bloquejat
SimpleKeyStoreManager.11=No s'ha pogut obtindre el magatzem de claus per defecte: %0 . Es carregar\u00E0 el del sistema.
SimpleKeyStoreManager.12=Contrasenya incorrecta
SimpleKeyStoreManager.13=Operaci\u00F3 cancel·lada. Es carregar\u00E0 el magatzem de claus del sistema.
SimpleKeyStoreManager.2=No hi ha targeta en el lector
SimpleKeyStoreManager.3=La targeta detectada en el lector no \u00E9s un DNIe.\nVoleu reintentar?
SimpleKeyStoreManager.4=Detectada targeta incorrecta
SimpleKeyStoreManager.5=El seu DNIe est\u00E0 danyat, ha d'acudir a una comissaria de policia per a renovar-ho.\nSe continuar\u00E0 amb el magatzem per defecte del sistema.
SimpleKeyStoreManager.6=Detectat DNIe danyat
SimpleKeyStoreManager.7=No ha sigut possible inicialitzar el seu DNIe.\nSe continuar\u00E0 amb el magatzem per defecte del sistema.
SimpleKeyStoreManager.8=Error en la iniciaizaci\u00F3n del DNIe

VisorFirma.0=Visor de signatures electr\u00F2niques
VisorFirma.1=Obrir
VisorPanel.0=Tancar visor
VisorPanel.1=Veure una altra signatura

ErrorPane.1=<a>Veure detalls</a>

TrayIcon.0=Utilitze este men\u00FA per a configurar les opcions d'Autofirma.
TrayIcon.1=Accedeix al di\u00E0leg  de prefer\u00E8ncies d'Autofirma.
TrayIcon.10=Selecci\u00F3 de Magatzem de certificats prioritari
TrayIcon.11=Selecciona el magatzem de claus i certificats prioritari de l'aplicaci\u00F3.
TrayIcon.12=Veure Magatzem de certificats
TrayIcon.13=Mostra el contingut del magatzem de claus i certificats per defecte de l'aplicaci\u00F3.
TrayIcon.14=No ha sigut possible modificar l'opci\u00F3 d'inici autom\u00E0tic d'Autofirma
TrayIcon.15=Error
TrayIcon.16=Selecci\u00F3 de Magatzem de certificats per defecte
TrayIcon.17=Selecciona el magatzem de claus i certificats per defecte de l'aplicaci\u00F3.
TrayIcon.2=Tanca el men\u00FA de configuraci\u00F3 de les opcions d'Autofirma.
TrayIcon.20=Selecionar magatzem per defecte
TrayIcon.21=Selecionar magatzem prioritari
TrayIcon.22=<html><p>S'usar&agrave; el magatzem prioritari sempre que siga present, amb prefer&egrave;ncia sobre el magatzem per defecte.</p><p>Si es tractara d'una targeta intel·ligent, esta haur&agrave; de romandre inserida durant tota l'execuci&oacute; del programa.</p><br>Si no s'establix un magatzem prioritari s'usar&agrave; sempre el per defecte.</html>
TrayIcon.3=Mostra informaci\u00F3 sobre Autofirma.
TrayIcon.4=Habilita l'inici autom\u00E0tic d'Autofirma mostrant una icona en l'\u00E0rea de notificacions.
TrayIcon.5=Prefer\u00E8ncies
TrayIcon.6=Tancar
TrayIcon.7=Sobre Autofirma
TrayIcon.8=Mostrar Icona
TrayIcon.9=Magatzem de certificats

TimestampsAnalyzer.0=Per favor, introdu\u00EFsca la contrasenya del PDF

RestoreApplication.0=Va oc\u00F3rrer un error durant la configuraci\u00F3 d'Autofirma.\nAutofirma no podr\u00E0 comunicar-se amb el seu navegador web.
RestoreApplication.1=Va oc\u00F3rrer un error greu durant la configuraci\u00F3 d'Autofirma.\nAutofirma no podr\u00E0 comunicar-se amb el seu navegador web.
RestoreApplication.2=Error
RestoreApplication.3=\ \ Error en copiar, llegir o eliminar algun dels fitxers de configuraci\u00F3
RestoreApplication.4=\ \ Error en generar les claus de xifrat SSL
RestoreApplication.5=\ \ Error en la importacion de la CA de confian\u00E7a o la neteja de l'almacen
RestoreApplication.6=No es es t\u00E9 acc\u00E9s a la xarxa. \u00E9s possible que aix\u00F2 afecte dels processos\nde signatura en la invocaci\u00F3 des d'una p\u00E0gina web.
RestoreApplication.7=Tancament el navegador Mozilla Firefox per a poder instal·lar el certificat de confian\u00E7a d'Autofirma en el navegador.
RestoreApplication.8=Tancament el navegador Chrome per a registrar el protocol d'Autofirma en el navegador.
RestoreApplication.9=Av\u00EDs
RestoreApplication.10=El certificat de confian\u00E7a per a la comunicaci\u00F3 entre Mozilla Firefox i Autofirma\nno ha pogut instal·lar-se. Per a realitzar esta operaci\u00F3 ha d'executar Autofirma en manera administradora.
RestoreApplication.11=No s'ha tancat el navegador Chrome. Tancament el Chrome i polse el bot\u00F3 OK per a registrar\nel procolo d'Autofirma en el navegador. Si no pot o no desitja tancar el navegador, polse el\nbot\u00F3n Cancel·lar per a continuar amb la restauraci\u00F3.
RestoreApplication.12=No s'ha tancat el navegador Firefox. Tancament el Firefox i polse el bot\u00F3 OK per a poder\ninstalar el certificat de confian\u00E7a d'Autofirma en el navegador. Si no necessita utilitzar Autofirma\ndesde Firefox, polse el bot\u00F3 Cancel·lar per a continuar amb la restauraci\u00F3. 
RestoreApplication.13=INFO: Inici de la restauraci\u00F3
RestoreApplication.14=INFO: Fi de la restauraci\u00F3

RestoreConfigWindows.0=El certificat de confian\u00E7a per a la comunicaci\u00F3 entre l'el seu navegador Web i Autofirma\nno ha pogut instal·lar-se. Necessita instal·lar este certificat per a poder realitzar signatures des de\nsu navegador. Voleu reintentar instal·lar este certificat?
RestoreConfigWindows.1=Error
RestoreConfigWindows.11=INFO: Guardant en disc els certificats SSL...
RestoreConfigWindows.12=INFO: No s'han detectat perfils de Mozilla Firefox en el qual instal·lar el certificat
RestoreConfigWindows.13=INFO: Instal·lant el certificat SSL en el magatzem de Mozilla Firefox
RestoreConfigWindows.14=INFO: S'utilitzaren els certificats del directori d'instal·laci\u00F3
RestoreConfigWindows.16=INFO: Eliminant els certificats SSL anteriors...
RestoreConfigWindows.17=ERROR: No s'ha pogut eliminar la versi\u00F3 pr\u00E8via dels certificats.
RestoreConfigWindows.18=INFO: Instal·lant certificats SSL en el magatzem de Windows...
RestoreConfigWindows.20=ERROR: No s'ha importat el certificat arrel CA "Autofirma ROOT" en magatzem de Windows. El proc\u00E9s de restauraci\u00F3 continuar\u00E0 per\u00F2 no estar\u00E0 complet fins a importar el certificat en el magatzem de Windows.
RestoreConfigWindows.22=INFO: Eliminant certificats anteriors del magatzem de Windows...
RestoreConfigWindows.24=INFO: Restaurant la configuraci\u00F3 del protocol afirma en el registre de Windows...
RestoreConfigWindows.25=ERROR: No s'ha pogut restaurar el protocol "afirma". Execute Autofirma amb privilegis d'administrador per a fer esta tasca.
RestoreConfigWindows.26=INFO: El certificat arrel ja es trobava instal·lat en el magatzem de Windows.
RestoreConfigWindows.27=ERROR: No ha pogut carregar-se el certificat arrel per a la seua instal·laci\u00F3.
RestoreConfigWindows.3=INFO: Directori d'aplicaci\u00F3: %0
RestoreConfigWindows.31=ERROR: No s'ha pogut instal·lar el certificat de confian\u00E7a en el magatzem de Firefox.
RestoreConfigWindows.32=ERROR: S'ha cancel·lat la instal·laci\u00F3 del certificat en el magatzem de Windows.
RestoreConfigWindows.33=ERROR: No s'han pogut generar i copiar a disc els certificats SSL per a la connexi\u00F3 amb els navegadors. S'omet la seua configuraci\u003Fn.
RestoreConfigWindows.34=ADVERTIMENT: No s'ha pogut eliminar alguna importaci\u00F3 pr\u00E8via del certificat arrel del magatzem de Windows
RestoreConfigWindows.35=INFO: Eliminant certificat anterior del magatzem de Windows. Comprove si s'ha obert un di\u00E0leg en segon pla demanant confirmaci\u00F3...
RestoreConfigWindows.36=INFO: Copiant l'almacen SSL per a la connexi\u00F3 amb Autofirma WebStart...
RestoreConfigWindows.37=ADVERTIMENT: No s'ha pogut copiar l'almacen SSL per a la connexi\u00F3 amb Autofirma WebStart.
RestoreConfigWindows.38=INFO: Es crearan nous certificats SSL.
RestoreConfigWindows.39=INFO: Es reutilitzaran els certificats del directori d'instal·laci\u00F3.
RestoreConfigWindows.4=ERROR: No es carregar el certificat raiz del directori d'instalacion.
RestoreConfigWindows.41=INFO: Configurem Firefox perqu\u00E8 confie en els certificats arrel del magatzem de confian\u00E7a del sistema.
RestoreConfigWindows.42=INFO: Es restaura la configuraci\u00F3 de Firefox perqu\u00E8 nom\u00E9s confie en els certificats del seu magatzem.
RestoreConfigWindows.43=ERROR: No s'ha pogut canviar la confian\u00E7a de Firefox en el magatzem de certificats del sistema.
RestoreConfigWindows.44=INFO: No s'han detectat perfils de Mozilla Firefox en els quals configurar la confian\u00E7a en el magatzem del sistema.
RestoreConfigWindows.45=ADVERTIMENT: No s'ha tancat Firefox. \u00E9s possible que no puga executar Autofirma en tots els desplegaments des d'este navegador.
RestoreConfigWindows.5=INFO: Generant certificats per a la comunicaci\u00F3 amb el navegador web...

ConfiguratorConsole.0=Configurador

RestoreConfigLinux.1=ERROR: No s'ha pogut identificar un directori d'aplicaci\u00F3 al qual copiar els certificats. S'avorta la restauraci\u00F3.
RestoreConfigLinux.10=ERROR: No s'ha pogut instal·lar el certificat de confian\u00E7a SSL en el magatzem del sistema.
RestoreConfigLinux.11=INFO: Guardant magatzem de claus...
RestoreConfigLinux.12=ADVERTIMENT: No s'ha detectat un perfil de Mozilla Firefox en el qual instal·lar el certificat.
RestoreConfigLinux.13=INFO: Instal·lant el certificat de confian\u00E7a SSL en el magatzem de Mozilla Firefox...
RestoreConfigLinux.14=INFO: El certificat per a la configuraci\u00F3 del canal segur ja es troba generat.
RestoreConfigLinux.15=INFO: Restaurant la configuraci\u00F3 del protocol "afirma" en Mozilla Firefox... (Pot ser que se li sol·liciten permisos d'administrador)
RestoreConfigLinux.16=ERROR: No s'ha pogut restaurar la configuraci\u00F3 del protocol "afirma".
RestoreConfigLinux.17=ERROR: No s'han pogut copiar les eines d'instal·laci\u00F3 de certificats. S'avorta la restauraci\u00F3 dels certificats SSL.
RestoreConfigLinux.18=ADVERTIMENT: No s'ha pogut instal·lar el certificat de confian\u00E7a SSL en tots els perfils de Mozilla Firefox.
RestoreConfigLinux.19=INFO: Operaci\u00F3 cancel·lada per l'usuari.
RestoreConfigLinux.2=ERROR: No s'han pogut generar els certificats de confian\u00E7a SSL. S'avorta la restauraci\u00F3 dels certificats SSL.
RestoreConfigLinux.3=INFO: Directori d'aplicaci\u00F3: %0.
RestoreConfigLinux.4=ERROR: No s'han pogut copiar els certificats de confian\u00E7a SSL a disc.
RestoreConfigLinux.5=INFO: Generant certificat per a la comunicaci\u00F3 amb el navegador web...
RestoreConfigLinux.6=ERROR: No s'han pogut localitzar els directoris d'usuari del sistema. S'avorta la restauraci\u00F3 dels certificats SSL.
RestoreConfigLinux.9=INFO: Instal·lant el certificat en el magatzem del sistema...

RestoreConfigMacOSX.1=ERROR: No es tenen permisos sobre el directori d'aplicacion. Concedisca'ls manualment repetisca la restauraci\u00F3.
RestoreConfigMacOSX.10=ERROR: No es tenen permisos per a instal·lar els certificats SSL en l'almacen de confian\u00E7a del sistema. S'avorta la restauraci\u00F3 dels certificats SSL.
RestoreConfigMacOSX.11=ERROR: No es van poder instal·lar els certificats SSL en l'almacen de confian\u00E7a. S'avorta la restauraci\u00F3 dels certificats SSL.
RestoreConfigMacOSX.12=ADVERTIMENT: No s'ha detectat un perfil de Mozilla Firefox en el qual instal·lar el certificat
RestoreConfigMacOSX.13=INFO: Instal·lant el certificat en el magatzem de Mozilla Firefox...
RestoreConfigMacOSX.14=INFO: Ja es troba generat el certificat per a la configuraci\u00F3 del canal segur.
RestoreConfigMacOSX.15=ERROR: No es va poder crear el script temporal per a l'execuci\u00F3 de les operacions
RestoreConfigMacOSX.17=INFO: Copiant l'almacen SSL per a la connexi\u00F3 amb Autofirma WebStart...
RestoreConfigMacOSX.18=ADVERTIMENT: No s'ha pogut copiar l'almacen SSL per a la connexi\u00F3 amb Autofirma WebStart.
RestoreConfigMacOSX.19=ADVERTIMENT: No s'ha pogut instal·lar el certificat de confian\u00E7a SSL en tots els perfils de Mozilla Firefox.
RestoreConfigMacOSX.20=ERROR: No s'ha pogut instal·lar el certificat de confian\u00E7a SSL en el clauer del sistema.
RestoreConfigMacOSX.21=INFO: Configurem Firefox perqu\u00E8 confie en els certificats arrel del magatzem de confian\u00E7a del sistema.
RestoreConfigMacOSX.22=INFO: Es restaura la configuraci\u00F3 de Firefox perqu\u00E8 nom\u00E9s confie en els certificats del seu magatzem.
RestoreConfigMacOSX.23=ERROR: No s'ha pogut canviar la confian\u00E7a de Firefox en el magatzem de certificats del sistema.
RestoreConfigMacOSX.24=INFO: No s'han detectat perfils de Mozilla Firefox en els quals configurar la confian\u00E7a en el magatzem del sistema.
RestoreConfigMacOSX.25=INFO: Certificat de CA importat.
RestoreConfigMacOSX.26=INFO: Certificat SSL importat.
RestoreConfigMacOSX.27=<html><p>No s'han pogut importar els certificats SSL en el Clauer. Haur&agrave; d'instal·lar manualment els seg\u00FCents\ncertificados per a permetre l'&uacute;s d'Autofirma des del navegador:</p>&nbsp;- %0<br>&nbsp;- %1</html>
RestoreConfigMacOSX.28=Error en la importaci\u00F3
RestoreConfigMacOSX.29=Inserisca la contrasenya de l'administrador per a la importaci\u00F3 dels certificats
RestoreConfigMacOSX.3=INFO: Directori d'aplicaci\u00F3: %0 
RestoreConfigMacOSX.30=Contrasenya incorrecta. Inserisca la contrasenya de l'administrador per a la importaci\u00F3 dels certificats
RestoreConfigMacOSX.31=Si cancel·la la importaci\u00F3 dels certificats no podr\u00E0 utilitzar Autofirma des de el\nnavegador del sistema. Voleu cancel·lar la instalacion?
RestoreConfigMacOSX.32=Cancel·lar importacion
RestoreConfigMacOSX.33=INFO: L'usuari cancel·le la importacion dels certificats SSL en el clauer.
RestoreConfigMacOSX.35=ADVERTIMENT: No es va poder configurar "certutil" pel que no es podran instal·lar els certificats en l'almacen de Firefox.
RestoreConfigMacOSX.36=INFO: Restaurem els certificats en el perfil de Firefox: %0
RestoreConfigMacOSX.37=ADVERTIMENT: No s'ha van poder restaurar els certificats en el perfil '%0'. \u00E9s possible que l'usuari no posse\u00EFsca permisos sobre aquest.
RestoreConfigMacOSX.38=INFO: Editem la confian\u00E7a de Firefox en el magatzem del sistema per al perfil: %0
RestoreConfigMacOSX.39=ADVERTIMENT: No es va poder editar la confian\u00E7a de Firefox en el magatzem del sistema per al perfil '%0'. \u00E9s possible que l'usuari no posse\u00EFsca permisos sobre aquest.
RestoreConfigMacOSX.5=INFO: Generant certificat per a la comunicaci\u00F3 amb el navegador web...
RestoreConfigMacOSX.6=INFO: Important certificat en el magatzem de confian\u00E7a del sistema...
RestoreConfigMacOSX.7=ERROR: No es van poder copiar a disc els certificats SSL generats. S'avorta la restauraci\u00F3 dels certificats SSL.
RestoreConfigMacOSX.9=ERROR: No es van poder generar els certificats SSL. S'avorta la restauraci\u00F3 dels certificats SSL.

ConfiguratorWindows.15=No es va poder configurar Chrome per a l'usuari: %1s
ConfiguratorWindows.16=S'instal·lar\u00E0 l'esquema "afirma" com a protocol segur en Chrome

ConfiguratorGeneral.0=No s'ha pogut iniciar el proc\u00E9s de restauraci\u00F3 de la configuraci\u00F3. Ha de tancar tots els navegadors abans de comen\u00E7ar.

PluginsManagementPanel.0=Plugins instal·lats
PluginsManagementPanel.1=Agregar
PluginsManagementPanel.2=Eliminar
PluginsManagementPanel.3=Informaci\u00F3 del plugin
PluginsManagementPanel.4=Configurar
PluginsManagementPanel.5=Tancar
PluginsManagementPanel.6=Tanca el panell de gesti\u00E3n de plugins
PluginsManagementPanel.7=Instal·la un nou plugin 
PluginsManagementPanel.8=Elimina el plugin seleccionat

PluginsManagementHandler.0=El plugin no \u00E9s v\u00E0lid i no es carregar\u00E0.
PluginsManagementHandler.1=Ja existeix una versi\u00F3 instal·lada del plugin "%0".\nVoleu substituir-la per la nova versi\u00F3?
PluginsManagementHandler.2=Va oc\u00F3rrer un error en instal·lar el plugin
PluginsManagementHandler.3=Carregar plugin
PluginsManagementHandler.4=Plugin d'Autofirma
PluginsManagementHandler.5=Es desinstal·lar\u00E0 el plugin "%0". Voleu continuar?
PluginsManagementHandler.6=Va oc\u00F3rrer un error desinstal·lar el plugin.
PluginsManagementHandler.7=Error
PluginsManagementHandler.8=No s'ha pogut carregar la llista de plugins.
PluginsManagementHandler.9=Versi\u00F3:
PluginsManagementHandler.10=Autors:
PluginsManagementHandler.11=Contacte:
PluginsManagementHandler.12=Descripci\u00F3:
PluginsManagementHandler.13=El di\u00E0leg de configuraci\u00F3 del plugin va retornar un error. Consulte\ncon el desenvolupador com resoldre el problema.
PluginsManagementHandler.14=Desinstal·lar plugin
PluginsManagementHandler.15=No es va poder desinstal·lar la version anterior del plugin. Elimine manualment el\ndirectorio del plugin del directori d'instalacion d'Autofirma. 
PluginsManagementHandler.16=Instal·lar plugin
PluginsManagementHandler.17=L'operaci\u00F3 ha finalitzat correctament. Reinicie l'aplicaci\u00F3 perqu\u00E8 els canvis\nsurtan efecte.
PluginsManagementHandler.18=Reiniciar Autofirma
PluginsManagementHandler.19=L'operaci\u00F3 ha finalitzat correctament, per\u00F2 \u00E9s necessari reiniciar l'aplicaci\u00F3 per a\nque els canvis facen efecte. Voleu que es reinicie l'aplicaci\u00F3?
PluginsManagementHandler.20=El plugin no est\u00E0 signat o no est\u00E0 completament signat. Instal·le-ho nom\u00E9s si confia a l'origen.\nVoleu continuar amb la instal·laci\u00F3?
PluginsManagementHandler.21=Plugin sense signar
PluginsManagementHandler.22=La signatura del plugin no \u00E9s v\u00E0lida. Instal·le-ho nom\u00E9s si confia a l'origen.\nVoleu continuar amb la instal·laci\u00F3?
PluginsManagementHandler.23=La signatura del plugin cont\u00E9 errors
PluginsManagementHandler.24=Va oc\u00F3rrer un error durant la lectura del fitxer de plugin.
PluginsManagementHandler.25=Certificat de signatura

PluginManagementError.240000=Ha ocorregut un error en intentar carregar el plugin
PluginManagementError.240001=Va oc\u00F3rrer un error en desinstal\u00B7lar el plugin
PluginManagementError.240002=El propi plugin va retornar un error durant la seua instal\u00B7laci\u00F3
PluginManagementError.240003=Ha ocorregut un error en eliminar el plugin anterior
PluginManagementError.240004=Ha ocorregut un problema amb el directori d'instal\u00B7laci\u00F3

PluginManagementError.530000=Ha ocorregut un error en intentar carregar el plugin
PluginManagementError.530001=S'han trobat plugins mal definits en el fitxer importat
PluginManagementError.530002=No es va trobar cap plugin en els arxius
PluginManagementError.530003=No es permet la c\u00E0rrega simult\u00E0nia de diversos plugins
PluginManagementError.530004=El plugin no ha definit acci\u00F3 per a un bot\u00F3
PluginManagementError.530005=El plugin no ha definit la finestra en la qual ha d'apar\u00E9ixer un bot\u00F3
PluginManagementError.530006=El plugin va definir una classe d'acci\u00F3 err\u00F2nia
PluginManagementError.530007=El fitxer carregat no \u00E9s v\u00E0lid per a ser importat
PluginManagementError.530008=El plugin seleccionat ja es troba instal·lat

PluginConfigurationDialog.0=Acceptar
PluginConfigurationDialog.1=Cancel·lar

CertificateConfirmPanel.0=El plugin es troba signat per:
CertificateConfirmPanel.1=Descarregar certificat
CertificateConfirmPanel.2=Descarregar certificat de %0
CertificateConfirmPanel.3=Voleu continuar amb la instal·laci\u00F3?
CertificateConfirmPanel.4=Error en guardar el certificat
CertificateConfirmPanel.5=Error
CertificateConfirmPanel.6=Certificat
CertificateConfirmPanel.7=Guardar certificat
CertificateConfirmPanel.8=certificat_plugin.cer
CertificateConfirmPanel.9=caducat
CertificateConfirmPanel.10=Descarregar certificat de %0 (caducat)

PermissionsDialog.0=Informaci\u00F3 del plugin
PermissionsDialog.1=Di\u00E0leg d'informaci\u00F3 del plugin
PermissionsDialog.2=Permisos requerits pel plugin
PermissionsDialog.3=Concedir permisos
PermissionsDialog.4=Cancel·lar

LanguageManagementError.0 = Ha ocorregut un error en importar el fitxer d'idioma
LanguageManagementError.1 = No s'ha pogut llegir correctament l'arxiu ZIP
LanguageManagementError.2 = S'ha produ\u00eft un error en crear el directori de l'idioma

permission.INSTALL=Instal·laci\u00F3
permission.INSTALL.desc=Perm\u00EDs per a fer canvis en l'equip durant la instal·laci\u00F3 del plugin.
permission.UNINSTALL=Desinstal·laci\u00F3
permission.UNINSTALL.desc=Perm\u00EDs per a fer canvis en l'equip durant la desinstal·laci\u00F3 del plugin.
permission.RESET=Reinici
permission.RESET.desc=Perm\u00EDs per a reiniciar l'aplicaci\u00F3.
permission.PRESIGN=Preprocesado
permission.PRESIGN.desc=Perm\u00EDs per a processar les dades abans de les operacions de signatura. 
permission.POSTSIGN=Postprocesado
permission.POSTSIGN.desc=Perm\u00EDs per a processar les signatures despr\u00E9s de la seua generaci\u00F3.
permission.BUTTONS=Nous botons
permission.BUTTONS.desc=Permisos per a agregar botons a la interf\u00EDcie de l'aplicaci\u00F3.
permission.MENU=Nou men\u00FA
permission.MENU.desc=Permisos per a agregar un men\u00FA a la interf\u00EDcie de l'aplicaci\u00F3.
permission.COMMANDS=Nous comandos
permission.COMMANDS.desc=Permisos per a agregar nous comandos executables per l\u00EDnia de comandos.
permission.INLINE_PROCESS=Signatura en l\u00EDnia
permission.INLINE_PROCESS.desc=Permisos per a modificar el proc\u00E9s de signatura quan se sol·licite des del navegador.


# Cadenas de sol·licitud dinamica de dades a l'usuari
signingLts=La signatura cont\u00E9 segells d'arxiu i quedar\u00E0 invalidada en agregar la nova signatura. Voleu continuar?
signingLtsPossible=La signatura cont\u00E9 segells d'arxiu i podria quedar invalidada en agregar la nova signatura. Voleu continuar?
agePolicyIncompatibilitySign=La signatura que desitja generar no \u00E9s compatible amb la Pol\u00EDtica de signatura de l'AGE, ni ser\u00E0 validada pels sistemes de validaci\u00F3 de signatura de l'AGE.\nVoleu completar l'operaci\u00F3 sense agregar la pol\u00EDtica de signatura?
agePolicyIncompatibilityCosign=La signatura que desitja cofirmar no \u00E9s compatible amb la Pol\u00EDtica de signatura de l'AGE, ni ser\u00E0 validada pels sistemes de validaci\u00F3 de signatura de l'AGE.\nVoleu completar l'operaci\u00F3 sense agregar la pol\u00EDtica de signatura? 
agePolicyIncompatibilityCounterSign=La signatura que desitja contrafirmar no \u00E9s compatible amb la Pol\u00EDtica de signatura de l'AGE, ni ser\u00E0 validada pels sistemes de validaci\u00F3 de signatura de l'AGE.\nVoleu completar l'operaci\u00F3 sense agregar la pol\u00EDtica de signatura? 
signingCertifiedPdf=El PDF que desitja signar est\u00E0 certificat i no admet noves signatures. Agregar noves signatures invalidar\u00E0 la signatura anterior.\nVoleu continuar?
signingPdfWithUnregisteredSigns=El PDF que desitja signar cont\u00E9 signatures pr\u00E8vies en un format antic. Agregar noves signatures podria invalidar les ja existents.\nVoleu continuar?
signingModifiedPdfForm=El document PDF cont\u00E9 un formulari del qual s'han modificat els camps despr\u00E9s d'haver-se signat.\nVoleu continuar?
pdfShadowAttackSuspect=El PDF \u00E9s sospit\u00F3s d'haver sigut modificat despr\u00E9s de l'\u00FAltima signatura. Voleu continuar?
pdfpasswordprotected=El PDF est\u00E0 protegit per contrasenya. Introdu\u00EFsca de la contrasenya del PDF.
pdfbadpassword=La contrasenya introdu\u00EFda \u00E9s incorrecta. Introdu\u00EFsca de la contrasenya del PDF.