ColorResource.0=Negre
ColorResource.1=Blanco
ColorResource.2=Gris clar
ColorResource.3=Grisa
ColorResource.4=Gris fosc
ColorResource.5=Rojo
ColorResource.6=Rosa

RotationModel.0=No girar
RotationModel.1=Girar 90º
RotationModel.2=Girar 180º
RotationModel.3=Girar 270º

SignPdfUiPanel.0=Següent
SignPdfUiPanel.1=Seleccioni en aquest \u00E0rea amb una previsualitzaci\u00F3 del document PDF el rectangle on desitja situar la signatura visible
SignPdfUiPanel.10=Afegir p\u00E0gina
SignPdfUiPanel.11=Voleu afegir una p\u00E0gina en blanc al final del document per a signar?
SignPdfUiPanel.12=Ampl\u00E0ria:
SignPdfUiPanel.13=Altura:
SignPdfUiPanel.14=Insereixi o seleccioni l'\u00E0rea de signatura visible.
SignPdfUiPanel.15=Insereixi les coordenades i la grand\u00E0ria de l'\u00E0rea de signatura visible.
SignPdfUiPanel.16=Posici\u00F3 en l'eix X de l'\u00E0rea de signatura
SignPdfUiPanel.17=Posici\u00F3 en l'eix I de l'\u00E0rea de signatura
SignPdfUiPanel.18=Ampl\u00E0ria de la signatura
SignPdfUiPanel.19=Altura de la signatura
SignPdfUiPanel.20=Insereixi o seleccioni l'\u00E0rea de signatura visible per a tots els documents.
SignPdfUiPanel.21=Insereixi les coordenades i la grand\u00E0ria de l'\u00E0rea de signatura visible per a tots els documents.
SignPdfUiPanel.22=<html><b>P&agrave;gina de signatura</b></html>
SignPdfUiPanel.23=P\u00E0gina actual
SignPdfUiPanel.24=Totes les p\u00E0gines
SignPdfUiPanel.25=Selecci\u00F3 de p\u00E0gines
SignPdfUiPanel.26=Error en el format indicat en la selecci\u00F3 de p\u00E0gines. Si us plau, introdueixi un correcte.
SignPdfUiPanel.27=Bot\u00F3 per a obrir ajuda per a signatures visibles en PDF.
SignPdfUiPanel.2=Premi aquest bot\u00F3 per a situar la signatura en el PDF en la p\u00E0gina i posici\u00F3 marcades actualment en la previsualitzaci\u00F3
SignPdfUiPanel.3=Cancel·lar
SignPdfUiPanel.4=Premi aquest bot\u00F3 cancel·lar la selecci\u00F3 de situaci\u00F3 de signatura en el PDF
SignPdfUiPanel.5=P\u00E0gina %0 de %1 (escala: %2%)
SignPdfUiPanel.6=Previsualitzaci\u00F3 de la p\u00E0gina actual del PDF
SignPdfUiPanel.7=<html><b>Posici&oacute; de signatura</b></html>
SignPdfUiPanel.8=X:
SignPdfUiPanel.9=I:

PdfLoader.0=<html>Creant previsualitzaci&oacute; del PDF.<br>Aquesta tasca pot trigar diversos minuts.</html>
PdfLoader.1=Carregant document PDF...

SignPdfDialog.0=<html>No s'ha pogut crear la previsualitzaci&oacute; del PDF.<br>Intenti-ho de nou i si el problema persisteix generi signatures invisibles.</html>
SignPdfDialog.1=Error carregant el document PDF
SignPdfDialog.2=Di\u00E0leg modal per a l'establiment de les propietats d'una signatura visible PDF
SignPdfDialog.3=Propietats de la signatura visible PDF
SignPdfDialog.4=<html>El fitxer &eacute;s massa gran per a generar signatura visible.<br>Provi de generar una signatura invisible.</html>
SignPdfDialog.5=No s'ha pogut crear la previsualitzaci\u00F3 de la nova p\u00E0gina.
SignPdfDialog.6=L'\u00E0rea seleccionada per a mostrar la signatura t\u00E9 una grand\u00E0ria massa petita.
SignPdfDialog.7=Grand\u00E0ria inv\u00E0lida
SignPdfDialog.8=Advertiment
SignPdfDialog.9=No se suporta l'\u00FAs d'imagenes amb transpar\u00E8ncies. La previsualitzaci\u00F3 no reflexa l'acabat final de la signatura.

SignPdfFieldChooser.1=Di\u00E0leg de preparaci\u00F3 de previsualitzaci\u00F3 de signatura pdf visible amb camp per a signatura.
SignPdfFieldChooser.2=Error carregant la previsualitzaci\u00F3 de signatura pdf visible.
SignPdfFieldChooser.3=Error
SignPdfFieldChooser.4=Usar camp seleccionat
SignPdfFieldChooser.5=Cancel·lar signatura
SignPdfFieldChooser.6=Crear camp nou
SignPdfFieldChooser.7=S'ha detectat un camp de signatura buit en el document. Seleccioni el camp en el qual desitja inserir la signatura o si desitja agregar-la en un nou camp.

SignPdfUiPreview.0=Vista Pr\u00E8via
SignPdfUiPreview.1=Configuraci\u00F3 de signatura
SignPdfUiPreview.10=Premi aquest bot\u00F3 per a seleccionar o deseleccionar l'estil de font negreta.
SignPdfUiPreview.11=Premi aquest bot\u00F3 per a seleccionar o deseleccionar l'estil de font cursiva.
SignPdfUiPreview.12=Premi aquest bot\u00F3 per a seleccionar o deseleccionar l'estil de font subratllat.
SignPdfUiPreview.13=Premi aquest bot\u00F3 per a seleccionar o deseleccionar l'estil de font ratllat.
SignPdfUiPreview.14=Negreta
SignPdfUiPreview.15=Cursiva
SignPdfUiPreview.16=Subratllat
SignPdfUiPreview.17=Ratllat
SignPdfUiPreview.18=Grand\u00E0ria del text
SignPdfUiPreview.19=Color text
SignPdfUiPreview.2=\u00C1rea de text
SignPdfUiPreview.20=Tipus de lletra
SignPdfUiPreview.21=Seleccioni el fitxer per a carregar la imatge
SignPdfUiPreview.22=Arxius d'imatge (.jpg, .jpeg, .gif, .png, .bmp)
SignPdfUiPreview.23=Error carregant imatge
SignPdfUiPreview.24=No s'ha pogut carregar la imatge seleccionada. Proporcioni una imatge en format JPEG.
SignPdfUiPreview.25=Signat per $$SUBJECTCN$$ el dia $$SIGNDATE=dd/MM/yyyy$$ amb un certificat em\u00E8s per $$ISSUERCN$$
SignPdfUiPreview.26=Arrossegament una im\u00E1gen a aquest \u00E0rea per a seleccionar-ho i poder previsualizarlo
SignPdfUiPreview.27=Llevar imatge
SignPdfUiPreview.28=Afegir imatge
SignPdfUiPreview.29=Premi la previsualitzaci\u00F3 per a agregar una imatge de fons. Premi amb el bot\u00F3 dret per a eliminar-la.
SignPdfUiPreview.3=Seleccioni les propietats del tipus de lletra i escrigui la signatura en l'\u00E0rea de text per a incloure-la en el PDF.
SignPdfUiPreview.30=Inserir Marca Visible
SignPdfUiPreview.31=Restaurar configuraci\u00F3
SignPdfUiPreview.32=Premi aquest bot\u00F3 per a restaurar la configuraci\u00F3 per defecte de la signatura.
SignPdfUiPreview.33=Recordar configuraci\u00F3
SignPdfUiPreview.34=Eliminar Marca Visible
SignPdfUiPreview.35=Opcions de Marca Visible
SignPdfUiPreview.36=Text de la signatura:
SignPdfUiPreview.37=Imatge de signatura:
SignPdfUiPreview.38=Examinar
SignPdfUiPreview.39=Carregar imatge de signatura
SignPdfUiPreview.40=Netejar
SignPdfUiPreview.41=No usar imatge
SignPdfUiPreview.42=Rotaci\u00F3 del text
SignPdfUiPreview.43=Arxius d'imatge (.jpg, .jpeg, .gif, .png, .bmp)
SignPdfUiPreview.44=No s'ha pogut carregar la imatge seleccionada. Proporcioni una imatge en format JPEG.
SignPdfUiPreview.4=<html><p>La previsualitzaci&oacute; pot diferir del resultat final. Consulti la <a href="https://github.com/ctt-gob-es/clienteafirma/wiki/Uso-del-di%C3%A1logo-gr%C3%A1fico-de-Propiedades-de-la-firma-visible-PDF">p&agrave;gina d'ajuda</a> per a con&egrave;ixer les paraules clau per a introduir informaci&oacute; del certificat.</p></html>
SignPdfUiPreview.5=Acceptar
SignPdfUiPreview.6=Cancel·lar
SignPdfUiPreview.7=Premi aquest bot\u00F3 cancel·lar la selecci\u00F3 de situaci\u00F3 de signatura en el PDF
SignPdfUiPreview.8=Panell per a previsualizar el text intoducido.
SignPdfUiPreview.9=Espai de la p\u00E0gina seleccionada en la pantalla anterior.

SignPdfUiStamp.0=Propietats de marca visible
SignPdfUiStamp.1=Di\u00E0leg modal per a la selecci\u00F3 de la posici\u00F3 d'una marca visible en PDF.
SignPdfUiStamp.10=Cancel·lar
SignPdfUiStamp.11=Premi aquest bot\u00F3 cancel·lar la selecci\u00F3 de posici\u00F3 de marca en el PDF
SignPdfUiStamp.12=Error carregant el document PDF
SignPdfUiStamp.13=<html>No s'ha pogut crear la previsualitzaci&oacute; del PDF.<br>Intenti-ho de nou i si el problema persisteix generi signatures invisibles.</html>
SignPdfUiStamp.14=<html>El fitxer &eacute;s massa gran per a generar signatura visible.<br>Provi de generar una signatura invisible.</html>
SignPdfUiStamp.15=No s'ha pogut crear la previsualitzaci\u00F3 de la nova p\u00E0gina.
SignPdfUiStamp.16=Premi aquest bot\u00F3 per a aplicar la marca en totes les p\u00E0gines del PDF.
SignPdfUiStamp.17=Seleccioni en aquest \u00E0rea amb una previsualitzaci\u00F3 del document PDF el rectangle on desitja situar la marca visible
SignPdfUiStamp.18=Seleccionar imatge
SignPdfUiStamp.19=Premi aquest bot\u00F3 per a obrir un di\u00E1logo en el qual podr\u00E1 seleccionar la imatge de marca.
SignPdfUiStamp.2=<html><b>Posici&oacute; de marca</b></html>
SignPdfUiStamp.20=Ampl\u00E0ria:
SignPdfUiStamp.21=Altura:
SignPdfUiStamp.22=Posici\u00F3 en l'eix X de l'\u00E0rea de signatura
SignPdfUiStamp.23=Posici\u00F3 en l'eix I de l'\u00E0rea de signatura
SignPdfUiStamp.24=Ampl\u00E0ria de la signatura
SignPdfUiStamp.25=Altura de la signatura
SignPdfUiStamp.26=Insereixi o seleccioni l'\u00E0rea per a la imatge de marca visible.
SignPdfUiStamp.27=Insereixi les coordenades i la grand\u00E0ria de l'\u00E0rea de la imatge de marca visible.
SignPdfUiStamp.3=X:
SignPdfUiStamp.4=I:
SignPdfUiStamp.5=Previsualitzaci\u00F3 de la p\u00E0gina actual del PDF
SignPdfUiStamp.6=P\u00E0gina %0 de %1 (escala: %2%)
SignPdfUiStamp.7=Incloure imatge en totes les p\u00E0gines.
SignPdfUiStamp.8=Acceptar
SignPdfUiStamp.9=Premi aquest bot\u00F3 per a situar la marca en el PDF en la p\u00E0gina i posici\u00F3 marcades actualment en la previsualitzaci\u00F3

