<html>
<head>
	<title>Firma electr&oacute;nica avanzada</title>
</head>
<body>
<h2><a name="_Toc275937477">Firma electr&oacute;nica avanzada</a></h2>

<p>La firma electr&oacute;nica avanzada es la firma
electr&oacute;nica que permite identificar al firmante y detectar cualquier cambio
ulterior de los datos firmados, que est&aacute; vinculada al firmante de manera &uacute;nica
y a los datos a que se refiere y que ha sido creada por medios que el firmante
puede mantener bajo su exclusivo control. </p>

<p>Para que una firma electr&oacute;nica pueda ser considera firma electr&oacute;nica
avanzada, la ley marca el cumplimiento de los siguientes requisitos:</p>

<ul>
	<li><b>La identificaci&oacute;n o autenticaci&oacute;n de usuarios:</b> posibilita garantizar la
    identidad del firmante de manera &uacute;nica. Existen dos tipos de finalidades
    de la autenticaci&oacute;n: identificaci&oacute;n de origen de datos (el identificado est&aacute;
    relacionado con ciertos datos que le son propios y que lo vinculan con el
    mensaje enviado) e identificaci&oacute;n de entidades (comparaci&oacute;n de los datos
    enviados con datos almacenados, enviados anteriormente).</li>
	<li><b>Integridad:</b> garantiza que
    el contenido de un mensaje de datos ha permanecido completo e inalterado,
    con independencia de los cambios que hubiera podido sufrir el medio que lo
    contiene como resultado del proceso de comunicaci&oacute;n, archivo o
    presentaci&oacute;n.</li>
	<li><b>No repudio:</b> es la garant&iacute;a de que no puedan ser negados los mensajes en una
    comunicaci&oacute;n telem&aacute;tica. Existen dos tipos: no repudio en origen, que
    garantiza al receptor que el mensaje ha sido enviado, aunque el emisor
    quiera negar tal comunicaci&oacute;n; y no repudio en destino, que garantiza al
    emisor que su comunicaci&oacute;n ha sido recibida, no pudiendo negar el receptor
    tal comunicaci&oacute;n.</li>
	<li><b>Confidencialidad:</b> garantiza al
    firmante o al destinatario que la informaci&oacute;n enviada o recibida
    electr&oacute;nicamente permanece &iacute;ntegra y sin modificaciones, y es protegida de
    su acceso y distribuci&oacute;n no autorizada.</li>
</ul>

</body>
</html>