<html>
<head>
	<title>Contrafirma</title>
</head>
<body>

<h3><a name="_Toc275937506"></a><a name="_Toc275865245">Contrafirma</a></h3>

<p>Esta opci&oacute;n nos mostrar&aacute; el asistente para la generaci&oacute;n de una contrafirma electr&oacute;nica. A lo largo 
de varios pasos se nos explicar&aacute; en que consiste esta operaci&oacute;n y se nos solicitar&aacute;n los datos necesarios 
para ejecutarla:</p>

<p align="center">
	<img src="images/image026.png" width="670" height="585"/>
</p>

<a name="multifirma.wizard.ficherocontrafirma"></a>
<p>Al pulsar el bot&oacute;n "Siguiente &gt;" accederemos a la primera pantalla del asistente, en donde deberemos seleccionar el fichero
con las firmas que deseemos contrafirmar.</p>

<p align="center">
	<img src="images/image028.png" width="670" height="585"/>
</p>

<p>Al pulsar "Siguiente &gt;" no aparecer&aacute; una nueva pantalla en donde se nos mostrar&aacute; el &aacute;rbol de firmas de documento y 
deberemos indicar cu&aacute;les de ellas queremos contrafirmar.</p>

<p align="center">
	<img src="images/image030.png" width="670" height="585"/>
</p>

<p>Las opciones disponibles en esta pantalla son:</p>
<ul>
	<li><a name="multifirma.wizard.lista">Firmas que desea contrafirmar:</a></li>
	<ul type="circle">
		<li>Permite seleccionar las firmas que se desean contrafirmar. Los valores posible son:</li>
		<ul type="square">
			<li>Firmas seleccionadas: Contrafirma todas las firmas que seleccionadas en el &aacute;rbol de firmas.</li>
			<li>Firmantes seleccionados: Contrafirma todas las firmas de los autores de los cuales se ha seleccionado 
			al menos una firma en el &aacute;rbol de firmas.</li>
			<li>Todo el &aacute;rbol de firmas: Contrafirmas todas las firmas.</li>
			<li>Firmas de &uacute;ltimo nivel: Contrafirma todas las firmas que no tienen todav&iacute;a ninguna contrafirma.</li>
		</ul>
	</ul><br/>
	<li><a name="multifirma.wizard.arbolfirmantes">&Aacute;rbol de firmas:</a></li>
	<ul type="circle">
		<li>Listado en forma de &aacute;rbol de todas las firmas contenidas en el fichero de firma seleccionado anteriormente. 
		Para seleccionar una firma, basta con hacer clic sobre la misma, para seleccionar m&aacute;s de una, mantenga pulsada 
		la tecla Control ("Ctrl") al seleccionarlas y para seleccionar varias firmas consecutivas, mantenga pulsada la 
		tecla May&uacute;sculas ("Shift") y seleccione la primera y &uacute;ltima del rango.</li>
	</ul>
</ul>

<p>Al pulsar el bot&oacute;n "Siguiente &gt;" se nos mostrar&aacute; un di&aacute;logo para la selecci&oacute;n del certificado que dese utilizar para 
la firma. Seleccione el certificado deseado y a continuaci&oacute;n se le mostrar&aacute; un segundo di&aacute;logo para el guardado de la multifirma 
generada o, en caso de error, una ventana con el mensaje de error correspondiente.</p>

</body>
</html>