<html>
<head>
	<title>Multifirma</title>
</head>
<body>
<h2><a name="_Toc275937504">Multifirma</a></h2>

<p>Desde la ventana "<i>Multifirma</i>" es posible realizar cofirmas y contrafirmas sobre firmas electr&oacute;nicas ya generadas. 
Esto es, agregar nuevos firmantes a firmas ya existentes, ya sea para firmar tambi&eacute;n el documento (cofirmas) o aprobar una o 
varias de las firmas ya existentes (contrafirmas).</p>

<p align="center">
	<img src="images/image020.png" width="650" height="370"/>
</p>

<p>Las opciones disponibles son:</p>
<ul>
	<li><a name="multifirma.almacen">Almac&eacute;n / repositorio de certificados:</a></li>
	<ul type="circle">
		<li>Permite seleccionar el almac&eacute;n en donde se encuentra el certificado que deseamos utilizar para realizar la firma. 
		Las opciones disponibles son:</li>
		<ul type="square">
			<li>Windows / Internet Explorer: Para tomar el certificado del almac&eacute;n de Windows o un dispositivo externo (por 
			ejemplo, el DNIe) instalado en el sistema.</li>
			<li>Mozilla Firefox (unificado): Para tomar el certificado del almac&eacute;n de Firefox o un dispositivo externo (por 
			ejemplo, el DNIe) configurado en este almac&eacute;n.</li>
			<li>PKCS#12 / PFX: Para tomar el certificado de un almac&eacute;n en disco en formato P12 o PFX.</li>
		</ul>
		<li>Tecla de acceso r&aacute;pido: a</li>
	</ul><br/>
	<li><a name="multifirma.tipo">Tipo de multifirma:</a></li>
	<ul type="circle">
		<li><b>Agregar nueva firma:</b> Permite agregar nuevas firmas a un documento de firmas. En el caso de las firmas PDF, ODF y OOXML, 
		para agregar nuevas firmas al documento basta con firmarlo m&uacute;ltiples veces a trav&eacute;s de la pesta&ntilde;a "Firma"
		de la interfaz. (En la vista avanzada de la herramienta esta opci&oacute;n aparece como "Cofirma")</li>
		<li><b>Refrendar una firma:</b> Permite firmar firmas anteriores de un documento de firmas. (En la vista avanzada de la
		herramienta esta opci&oacute;n aparece como "Contrafirma")</li>
	</ul>
</ul>

<p>Al pulsar el icono de ayuda se muestra la ventana de ayuda para el men&uacute; "Multifirma".</p>
<ul>
	<li>Tecla de acceso r&aacute;pido para el bot&oacute;n de Ayuda: h</li>
</ul>

<p>Al pulsar el bot&oacute;n "Firmar" se abrir&aacute; un asistente para la generaci&oacute;n de la multifirma. Este asistente
variar&aacute; seg&uacute;n se haya decidido realizar una cofirma o una contrafirma.</p>
<ul>
	<li>Tecla de acceso r&aacute;pido para el bot&oacute;n "Firmar": r</li>
</ul>

</body>
</html>