<html>
<head>
	<title>Opciones de configuraci&oacute;n</title>
</head>
<body>
<h2><a name="_Toc275937502">Opciones de configuraci&oacute;n</a></h2>

<p>Es posible acceder a las opciones de configuraci&oacute;n de la Interfaz de Escritorio del Cliente @firma mediante por medio del 
elemento "Opciones del men&uacute; "Herramientas".</p>

<p align="center">
	<img src="images/image010.png" alt="Men&uacute; Herramientas - Opciones" width="650" height="105"/>
</p>

<p>La pantalla de Opciones presenta, en concreto, 2 pesta&ntilde;as con las distintas opciones de configuraci&oacute;n.</p>

<h3>General</h3>

<p align="center">
	<img src="images/image012.png" alt="Configuraci&oacute;n general" width="525" height="600"/>
</p>

<p>Los elementos disponibles en esta pantalla son:</p>
<ul>
	<li><a name="general">General:</a></li>
	<ul type="circle">
		<li><b>Habilitar opciones de configuraci&oacute;n avanzadas:</b> Esta opci&oacute;n habilita la vista avanzada de la Interfaz de Escritorio.</li>
		<li>Tecla de acceso r&aacute;pido: b</li>
	</ul><br/>
	<li><a name="criptografia">Criptograf&iacute;a:</a></li>
	<ul type="circle">
		<li><b>Algoritmo de huella digital por defecto:</b> Es el algoritmo que se debe utilizar para ejecutar las firmas electr&oacute;nicas. 
		Por defecto se utilizar&aacute; SHA-1 (SHA1withRSA). No se recomienda modificar este valor salvo que se est&eacute; seguro que el formato de 
		firmas y el almac&eacute;n de certificados que se desea utilizar soportan este algoritmo.</li>
		<ul>
			<li>Tecla de acceso r&aacute;pido: r</li>
		</ul>
		<li><b>Utilizar tambi&eacute;n este algoritmo para las referencias internas XML:</b> Esta opci&oacute;n permite que las referencias internas 
		de las firmas XML se realicen con el algoritmo seleccionado.</li>
		<ul>
			<li>Tecla de acceso r&aacute;pido: u</li>
		</ul>
	</ul><br/>
	<li><a name="firma">Pol&iacute;tica de firma: (Desactivado en la actual versi&oacute;n)</a></li>
	<ul type="circle">
		<li><b>Configurar pol&iacute;tica de firma (OID):</b> Habilita la generaci&oacute;n de firmas EPES.</li>
		<li><b>Identificador de la pol&iacute;tica de firma:</b> Identificador de la pol&iacute;tica.</li>
		<li><b>Ruta de la pol&iacute;tica de firma (URL):</b> Ruta de la versi&oacute;n legible de la pol&iacute;tica.</li>
	</ul><br/>
	<li><b>Valores por defecto:</b> Establece los valores por defecto para esta pesta&ntilde;a de configuraci&oacute;n.</li>
</ul>

<h3>Contexto de firma</h3>

<p align="center">
	<img src="images/image013.png" alt="Contexto de firma" width="525" height="600"/>
</p>

<p>Los elementos disponibles en esta pantalla son:</p>
<ul>
	<li><a name="firma">Firmas de documentos PDF:</a></li>
	<ul type="circle">
		<li><b>Motivo / raz&oacute;n de la firma electr&oacute;nica:</b> Establece el motivo asociado a las firmas PDF que se generen.</li>
		<li><b>Lugar donde se realiza la firma electr&oacute;nica:</b> Establece la localizaci&oacute;n asociada a las firmas PDF que se generen.</li>
		<li><b>Datos de contacto del firmante:</b> Establece la informaci&oacute;n de contacto de quien genera la firma PDF.</li>
	</ul><br/>
	<li><b>Valores por defecto:</b> Establece los valores por defecto para esta pesta&ntilde;a de configuraci&oacute;n.</li>
</ul>

<p>Al pulsar el icono de ayuda se muestra la ventana de ayuda para el men&uacute; "Opciones de configuraci&oacute;n".</p>
<ul>
<li>Tecla de acceso r&aacute;pido para el bot&oacute;n de Ayuda: h</li>
</ul>

</body>
</html>