<html>
<head>
	<title>Validaci&oacute;n de firmas</title>
</head>
<body>
<h2><a name="_Toc275937508">Validaci&oacute;n de firmas</a></h2>

<p>Desde la opci&oacute;n <em>"Validaci&oacute;n"</em> podemos validar la estructura y la integridad de nuestras firmas
electr&oacute;nicas binarias y XML.
</p>

<p align="center">
	<img src="images/image046.png" width="650" height="370"/>
</p>
<p>Para validar una firma electr&oacute;nica pulsa el bot&oacute;n Examinar y buscar el fichero en el &aacute;rbol de
directorios del sistema. Una vez seleccionada, pulse el bot&oacute;n Validar para proceder a la validaci&oacute;n.</p>

<p>Al pulsar el icono de ayuda se muestra la ventana de ayuda para el men&uacute; "Validaci&oacute;n".</p>
<ul>
	<li>Tecla de acceso r&aacute;pido para el bot&oacute;n de Ayuda: h</li>
</ul>

<p>Al pulsar el bot&oacute;n "VALIDe" se abrir&aacute; un navegador Web y cargar&aacute; la p&aacute;gina de VALIDe.</p>
<ul>
	<li>Tecla de acceso r&aacute;pido para el bot&oacute;n "VALIDe": l</li>
</ul>

<p>En caso de
que la firma sea correcta se mostrar&aacute; la siguiente ventana.
</p>
<p align="center">
	<img src="images/image086.png" width="670" height="585"/>
</p>

<p>En los datos de la firma validada se identifica el formato de firma, si los datos est&aacute;n contenidos en ella y el
&aacute;rbol de firmas del documento con el nombre del firmante y la fecha de la firma (seg&uacute;n el sistema de origen).</p>
<ul>
<li>Para extraer los datos contenidos en la firma pulse el enlace "Ver datos firmados" (s&oacute;lo disponible si los datos
firmados est&aacute;n contenidos en la firma). Al pulsar este enlace se le permitir&aacute;a guardar los datos extra&iacute;dos
de la firma. Si no se puede identificar el tipo de datos, tendr&aacute; que guardarlos con la extensi&oacute;n de fichero que crea
conveniente para el posterior visionado de los datos.</li>
<li>Para revisar los datos de uno de los certificados de firma, haga clic  sobre el nombre del certificado en cuesti&oacute;n.</li>
</ul>

<p>En caso de detectar un error en la firma se informar&aacute; de que la firma no es v&aacute;lida y se le describir&aacute; el
error al usuario.</p>

</body>
</html>