AutofirmaConfigurator.0=Ocorreu un erro durante a configuraci\u00F3n de Autofirma.\nAutofirma non poder\u00E1 comunicarse co seu navegador web.
AutofirmaConfigurator.1=Ocorreu un erro grave durante a configuraci\u00F3n de Autofirma.\nAutofirma non poder\u00E1 comunicarse co seu navegador web.
AutofirmaConfigurator.2=Erro
AutofirmaConfigurator.3=\ \ Erro ao copiar ou ler alg\u00FAn dos ficheiros de configuraci\u00F3n
AutofirmaConfigurator.4=\ \ Erro ao xerar as claves de cifrado SSL
AutofirmaConfigurator.5=\ \ Erro na importacion do CA de confianza ou a limpeza do almacen
AutofirmaConfigurator.6=Non se se ten acceso \u00E1 rede. \u00E9 posible que isto afecte os procesos\nde firma na invocacion desde unha p\u00E1xina web.
AutofirmaConfigurator.7=Usouse unha JVM non compatible con interfaces gr\u00E1ficos. Non podra executarse a interface de escritorio de Autofirma con esta versi\u00F3n
ConfiguratorWindows.0=O certificado de confianza para a comunicaci\u00F3n entre o seu navegador Web e Autofirma\nno puido instalarse. Necesita instalar este certificado para poder realizar firmas desde\nsu navegador. \u00BF Desexa reintentar instalar este certificado?
ConfiguratorWindows.1=Erro
ConfiguratorWindows.10=O certificado de confianza para a comunicaci\u00F3n entre Mozilla Firefox e Autofirma\nno puido instalarse. Necesita instalar este certificado para poder realizar firmas desde\nMozilla Firefox. Se o problema persiste, comprobe que non te\u00F1a instaladas versi\u00F3ns anteriores de Autofirma.\n\u00BF Desexa reintentar instalar este certificado?
ConfiguratorWindows.11=G\u00E1rdase o almac\u00E9n de claves xerado no directorio de instalaci\u00F3n da aplicaci\u00F3n
ConfiguratorWindows.12=Non se detectou un perfil de Mozilla Firefox no que instalar o certificado
ConfiguratorWindows.13=Vaise a instalar o certificado no almac\u00E9n de Mozilla Firefox
ConfiguratorWindows.14=Xa se atopa instalado o certificado para a configuraci\u00F3n da canle segura, non se far\u00E1 nada
ConfiguratorWindows.17=Vaise a instalar o certificado SSL para a comunicaci\u00F3n segura entre o seu navegador Web\ny a ferramenta de firma electr\u00F3nica. Por favor, dea permisos para a s\u00FAa instalaci\u00F3n no seguinte di\u00E1logo.
ConfiguratorWindows.18=Insira o contrasinal mestre de Firefox para a instalaci\u00F3n dos certificados necesarios para a comunicaci\u00F3n con Autofirma.
ConfiguratorWindows.19=Habilitando o uso das certificados ra\u00EDces de confianza do sistema en Mozilla Firefox.
ConfiguratorWindows.2=Identificando directorio de aplicaci\u00F3n...
ConfiguratorWindows.20=Deshabilitando o uso das certificados ra\u00EDces de confianza do sistema en Mozilla Firefox
ConfiguratorWindows.21=Non se detectou un perfil de Mozilla Firefox ao que activar a confianza na certificados ra\u00EDz do sistema
ConfiguratorWindows.22=Config\u00FArase a integraci\u00F3n de Firefox con coas certificados ra\u00EDces do sistema
ConfiguratorWindows.23=Non se puido copiar o almac\u00E9n ao directorio de instalaci\u00F3n
ConfiguratorWindows.24=Non se puido copiar o certificado de confianza ao directorio de instalaci\u00F3n
ConfiguratorWindows.25=G\u00E1rdase o almac\u00E9n de claves proporcionado no directorio de instalaci\u00F3n da aplicaci\u00F3n
ConfiguratorWindows.26=Eliminando posibles versi\u00F3ns anteriores do certificado de confianza no almac\u00E9n de Firefox 
ConfiguratorWindows.27=Agregando ruta ao PATH
ConfiguratorWindows.28=Erro ao agregar a ruta ao PATH
ConfiguratorWindows.29=Ruta agregada correctamente ao PATH
ConfiguratorWindows.3=  Directorio de aplicaci\u00F3n: 
ConfiguratorWindows.4=Copiando ficheiros de configuraci\u00F3n...
ConfiguratorWindows.5=Xerando certificado para a comunicaci\u00F3n co navegador web...
ConfiguratorWindows.6=Importando certificado no almac\u00E9n de confianza do sistema...
ConfiguratorWindows.7=Eliminando ficheiros de configuraci\u00F3n...
ConfiguratorWindows.8=Fin da configuraci\u00F3n
ConfiguratorWindows.9=Importando certificado no almac\u00E9n de confianza de Mozilla Firefox...
ConfiguratorConsole.0=Configurador
ConfiguratorLinux.0=O certificado de confianza para a comunicaci\u00F3n entre o o seu navegador Web e Autofirma\nno puido instalarse. Necesita instalar este certificado para poder realizar firmas desde\nsu navegador. \u00BFDesea reintentar instalar este certificado?
ConfiguratorLinux.1=Erro
ConfiguratorLinux.10=O certificado de confianza para a comunicaci\u00F3n entre Mozilla Firefox e Autofirma\nno puido instalarse. Necesita instalar este certificado para poder realizar firmas desde\nMozilla Firefox. \u00BFDesea reintentar instalar este certificado?
ConfiguratorLinux.11=G\u00E1rdase o almac\u00E9n de claves no directorio de instalaci\u00F3n da aplicaci\u00F3n
ConfiguratorLinux.12=Non se detectou un perfil de Mozilla Firefox no que instalar o certificado
ConfiguratorLinux.13=Vaise a instalar o certificado no almacen de Mozilla Firefox
ConfiguratorLinux.14=Xa se atopa instalado o certificado para a configuraci\u00F3n da canle segura, non se far\u00E1 nada
ConfiguratorLinux.2=Identificando directorio de aplicaci\u00F3n...
ConfiguratorLinux.3=  Directorio de aplicaci\u00F3n: 
ConfiguratorLinux.4=Copiando ficheiros de configuraci\u00F3n...
ConfiguratorLinux.5=Xerando certificado para a comunicaci\u00F3n co navegador web...
ConfiguratorLinux.6=Importando certificado no almac\u00E9n de confianza do sistema...
ConfiguratorLinux.7=Eliminando ficheiros de configuraci\u00F3n...
ConfiguratorLinux.8=Fin da configuraci\u00F3n
ConfiguratorLinux.9=Importando certificado no almac\u00E9n de confianza de Mozilla Firefox...
ConfiguratorMacOSX.0=O certificado de confianza para a comunicaci\u00F3n entre o o seu navegador Web e Autofirma\nno puido instalarse. Necesita instalar este certificado para poder realizar firmas desde\nsu navegador. \u00BF Desexa reintentar instalar este certificado?
ConfiguratorMacOSX.1=Erro
ConfiguratorMacOSX.10=O certificado de confianza para a comunicaci\u00F3n entre Mozilla Firefox e Autofirma\nno puido instalarse. Necesita instalar este certificado para poder realizar firmas desde\nMozilla Firefox. \u00BF Desexa reintentar instalar este certificado?
ConfiguratorMacOSX.11=G\u00E1rdase o almac\u00E9n de claves no directorio de instalaci\u00F3n da aplicaci\u00F3n
ConfiguratorMacOSX.12=Non se detectou un perfil de Mozilla Firefox no que instalar o certificado
ConfiguratorMacOSX.13=Vaise a instalar o certificado no almacen de Mozilla Firefox
ConfiguratorMacOSX.14=Xa se atopa instalado o certificado para a configuraci\u00F3n da canle segura, non se far\u00E1 nada
ConfiguratorMacOSX.15=Se desinstalan versi\u00F3ns anteriores do certificados
ConfiguratorMacOSX.16=Almac\u00E9n de Firefox bloqueado
ConfiguratorMacOSX.17=Peche o navegador Mozilla Firefox para continuar coa instalaci\u00F3n de Autofirma.
ConfiguratorMacOSX.18=Erro creando script temporal
ConfiguratorMacOSX.19=Xa se atopa instalado o certificado para a configuraci\u00F3n da canle segura, non se far\u00E1 nada
ConfiguratorMacOSX.2=Identificando directorio de aplicaci\u00F3n...
ConfiguratorMacOSX.20=Vaise a instalar o certificado SSL para a comunicaci\u00F3n segura entre o seu navegador Web e<br>a ferramenta de firma electr\u00F3nica. Necesitaranse permisos de administrador para completar<br>esta operaci\u00F3n.
ConfiguratorMacOSX.21=Non se detectou un perfil de Mozilla Firefox ao que activar a confianza na certificados ra\u00EDz do sistema
ConfiguratorMacOSX.22=Config\u00FArase a integraci\u00F3n de Firefox con coas certificados ra\u00EDces do sistema 
ConfiguratorMacOSX.23=Desexa que se configure Firefox para que conf\u00EDe na certificados ra\u00EDz do llavero do sistema?
ConfiguratorMacOSX.24=Integraci\u00F3n con Firefox
ConfiguratorMacOSX.25=<html><p>Non se puideron importar o certificados SSL no Llavero. Non ser&aacute; posible utilizar Autofirma desde o navegador.\nSi desexa utilizar, abra Autofirma cando termine a instalaci&oacute;n e utilice a funci&oacute;n "Restaurar instalaci&oacute;n"</p></html>
ConfiguratorMacOSX.26=Erro na importaci\u00F3n
ConfiguratorMacOSX.27=Insira o seu contrasinal para o acceso aos certificados do Llavero.
ConfiguratorMacOSX.28=Contrasinal incorrecto. Insira o seu contrasinal para o acceso aos certificados do Llavero.
ConfiguratorMacOSX.29=Se cancela esta operaci\u00F3n, non poder\u00E1 utilizar Autofirma desde o\nnavegador do sistema. \u00BF Desexa cancelar o proceso?
ConfiguratorMacOSX.3=Directorio de aplicaci\u00F3n: 
ConfiguratorMacOSX.30=Cancelar acceso ao Llavero
ConfiguratorMacOSX.31=O usuario cancelo o acceso ao Llavero.
ConfiguratorMacOSX.32=Certificado de CA importado.
ConfiguratorMacOSX.33=Certificado SSL importado.
ConfiguratorMacOSX.34=Erro ao importar o certificados SSL no Llavero.
ConfiguratorMacOSX.35=Imp\u00F3rtase o certificado no perfil: %1
ConfiguratorMacOSX.36=Erro ao importar o certificado no perfil: %1
ConfiguratorMacOSX.4=Copiando ficheiros de configuraci\u00F3n...
ConfiguratorMacOSX.5=Xerando certificado para a comunicaci\u00F3n co navegador web...
ConfiguratorMacOSX.6=Importando certificado no almac\u00E9n de confianza do sistema...
ConfiguratorMacOSX.7=Eliminando ficheiros de configuraci\u00F3n...
ConfiguratorMacOSX.8=Fin da configuraci\u00F3n
ConfiguratorMacOSX.9=Importando certificado no almac\u00E9n de confianza de Mozilla Firefox...

