AutofirmaConfigurator.0=Ocurri\u00F3 un error durante la configuraci\u00F3n de Autofirma.\nAutofirma no podr\u00E1 comunicarse con su navegador web.
AutofirmaConfigurator.1=Ocurri\u00F3 un error grave durante la configuraci\u00F3n de Autofirma.\nAutofirma no podr\u00E1 comunicarse con su navegador web.
AutofirmaConfigurator.2=Error
AutofirmaConfigurator.3=\ \ Error al copiar o leer alguno de los ficheros de configuraci\u00F3n
AutofirmaConfigurator.4=\ \ Error al generar las claves de cifrado SSL
AutofirmaConfigurator.5=\ \ Error en la importacion de la CA de confianza o la limpieza del almacen
AutofirmaConfigurator.6=No se se tiene acceso a la red. Es posible que esto afecte a los procesos\nde firma en la invocacion desde una p\u00E1gina web.
AutofirmaConfigurator.7=Se ha usado una JVM no compatible con interfaces gr\u00E1ficos. No podra ejecutarse la interfaz de escritorio de Autofirma con esta versi\u00F3n
ConfiguratorWindows.0=El certificado de confianza para la comunicaci\u00F3n entre su navegador Web y Autofirma\nno ha podido instalarse. Necesita instalar este certificado para poder realizar firmas desde\nsu navegador. \u00BFDesea reintentar instalar este certificado?
ConfiguratorWindows.1=Error
ConfiguratorWindows.10=El certificado de confianza para la comunicaci\u00F3n entre Mozilla Firefox y Autofirma\nno ha podido instalarse. Necesita instalar este certificado para poder realizar firmas desde\nMozilla Firefox. Si el problema persiste, compruebe que no tenga instaladas versiones anteriores de Autofirma.\n\u00BFDesea reintentar instalar este certificado?
ConfiguratorWindows.11=Se guarda el almac\u00E9n de claves generado en el directorio de instalaci\u00F3n de la aplicaci\u00F3n
ConfiguratorWindows.12=No se ha detectado un perfil de Mozilla Firefox en el que instalar el certificado
ConfiguratorWindows.13=Se va a instalar el certificado en el almac\u00E9n de Mozilla Firefox
ConfiguratorWindows.14=Ya se encuentra instalado el certificado para la configuraci\u00F3n del canal seguro, no se har\u00E1 nada
ConfiguratorWindows.17=Se va a instalar el certificado SSL para la comunicaci\u00F3n segura entre su navegador Web\ny la herramienta de firma electr\u00F3nica. Por favor, d\u00E9 permisos para su instalaci\u00F3n en el siguiente di\u00E1logo.
ConfiguratorWindows.18=Inserte la contrase\u00F1a maestra de Firefox para la instalaci\u00F3n de los certificados necesarios para la comunicaci\u00F3n con Autofirma.
ConfiguratorWindows.19=Habilitando el uso de los certificados ra\u00EDces de confianza del sistema en Mozilla Firefox.
ConfiguratorWindows.2=Identificando directorio de aplicaci\u00F3n...
ConfiguratorWindows.20=Deshabilitando el uso de los certificados ra\u00EDces de confianza del sistema en Mozilla Firefox
ConfiguratorWindows.21=No se ha detectado un perfil de Mozilla Firefox al que activar la confianza en los certificados ra\u00EDz del sistema
ConfiguratorWindows.22=Se configura la integraci\u00F3n de Firefox con con los certificados ra\u00EDces del sistema
ConfiguratorWindows.23=No se ha podido copiar el almac\u00E9n al directorio de instalaci\u00F3n
ConfiguratorWindows.24=No se ha podido copiar el certificado de confianza al directorio de instalaci\u00F3n
ConfiguratorWindows.25=Se guarda el almac\u00E9n de claves proporcionado en el directorio de instalaci\u00F3n de la aplicaci\u00F3n
ConfiguratorWindows.26=Eliminando posibles versiones anteriores del certificado de confianza en el almac\u00E9n de Firefox 
ConfiguratorWindows.3=  Directorio de aplicaci\u00F3n: 
ConfiguratorWindows.4=Copiando ficheros de configuraci\u00F3n...
ConfiguratorWindows.5=Generando certificado para la comunicaci\u00F3n con el navegador web...
ConfiguratorWindows.6=Importando certificado en el almac\u00E9n de confianza del sistema...
ConfiguratorWindows.7=Eliminando ficheros de configuraci\u00F3n...
ConfiguratorWindows.8=Fin de la configuraci\u00F3n
ConfiguratorWindows.9=Importando certificado en el almac\u00E9n de confianza de Mozilla Firefox...
ConfiguratorConsole.0=Configurador
ConfiguratorLinux.0=El certificado de confianza para la comunicaci\u00F3n entre el su navegador Web y Autofirma\nno ha podido instalarse. Necesita instalar este certificado para poder realizar firmas desde\nsu navegador. \u00BFDesea reintentar instalar este certificado?
ConfiguratorLinux.1=Error
ConfiguratorLinux.10=El certificado de confianza para la comunicaci\u00F3n entre Mozilla Firefox y Autofirma\nno ha podido instalarse. Necesita instalar este certificado para poder realizar firmas desde\nMozilla Firefox. \u00BFDesea reintentar instalar este certificado?
ConfiguratorLinux.11=Se guarda el almac\u00E9n de claves en el directorio de instalaci\u00F3n de la aplicaci\u00F3n
ConfiguratorLinux.12=No se ha detectado un perfil de Mozilla Firefox en el que instalar el certificado
ConfiguratorLinux.13=Se va a instalar el certificado en el almacen de Mozilla Firefox
ConfiguratorLinux.14=Ya se encuentra instalado el certificado para la configuraci\u00F3n del canal seguro, no se har\u00E1 nada
ConfiguratorLinux.2=Identificando directorio de aplicaci\u00F3n...
ConfiguratorLinux.3=  Directorio de aplicaci\u00F3n: 
ConfiguratorLinux.4=Copiando ficheros de configuraci\u00F3n...
ConfiguratorLinux.5=Generando certificado para la comunicaci\u00F3n con el navegador web...
ConfiguratorLinux.6=Importando certificado en el almac\u00E9n de confianza del sistema...
ConfiguratorLinux.7=Eliminando ficheros de configuraci\u00F3n...
ConfiguratorLinux.8=Fin de la configuraci\u00F3n
ConfiguratorLinux.9=Importando certificado en el almac\u00E9n de confianza de Mozilla Firefox...
ConfiguratorMacOSX.0=El certificado de confianza para la comunicaci\u00F3n entre el su navegador Web y Autofirma\nno ha podido instalarse. Necesita instalar este certificado para poder realizar firmas desde\nsu navegador. \u00BFDesea reintentar instalar este certificado?
ConfiguratorMacOSX.1=Error
ConfiguratorMacOSX.10=El certificado de confianza para la comunicaci\u00F3n entre Mozilla Firefox y Autofirma\nno ha podido instalarse. Necesita instalar este certificado para poder realizar firmas desde\nMozilla Firefox. \u00BFDesea reintentar instalar este certificado?
ConfiguratorMacOSX.11=Se guarda el almac\u00E9n de claves en el directorio de instalaci\u00F3n de la aplicaci\u00F3n
ConfiguratorMacOSX.12=No se ha detectado un perfil de Mozilla Firefox en el que instalar el certificado
ConfiguratorMacOSX.13=Se va a instalar el certificado en el almacen de Mozilla Firefox
ConfiguratorMacOSX.14=Ya se encuentra instalado el certificado para la configuraci\u00F3n del canal seguro, no se har\u00E1 nada
ConfiguratorMacOSX.15=Se desinstalan versiones anteriores de los certificados
ConfiguratorMacOSX.16=Almac\u00E9n de Firefox bloqueado
ConfiguratorMacOSX.17=Cierre el navegador Mozilla Firefox para continuar con la instalaci\u00F3n de Autofirma.
ConfiguratorMacOSX.18=Error creando script temporal
ConfiguratorMacOSX.19=Ya se encuentra instalado el certificado para la configuraci\u00F3n del canal seguro, no se har\u00E1 nada
ConfiguratorMacOSX.2=Identificando directorio de aplicaci\u00F3n...
ConfiguratorMacOSX.20=Se va a instalar el certificado SSL para la comunicación segura entre su navegador Web y<br>la herramienta de firma electrónica. Se necesitarán permisos de administrador para completar<br>esta operación.
ConfiguratorMacOSX.21=No se ha detectado un perfil de Mozilla Firefox al que activar la confianza en los certificados ra\u00EDz del sistema
ConfiguratorMacOSX.22=Se configura la integraci\u00F3n de Firefox con con los certificados ra\u00EDces del sistema 
ConfiguratorMacOSX.23=¿Desea que se configure Firefox para que conf\u00EDe en los certificados ra\u00EDz del llavero del sistema?
ConfiguratorMacOSX.24=Integraci\u00F3n con Firefox
ConfiguratorMacOSX.25=<html><p>No se han podido importar los certificados SSL en el Llavero. No ser&aacute; posible utilizar Autofirma desde el navegador.\nSi desea utilizarlo, abra Autofirma cuando termine la instalaci&oacute;n y utilice la funci&oacute;n "Restaurar instalaci&oacute;n"</p></html>
ConfiguratorMacOSX.26=Error en la importaci\u00F3n
ConfiguratorMacOSX.27=Inserte su contrase\u00F1a para el acceso a los certificados del Llavero.
ConfiguratorMacOSX.28=Contrase\u00F1a incorrecta. Inserte su contrase\u00F1a para el acceso a los certificados del Llavero.
ConfiguratorMacOSX.29=Si cancela esta operaci\u00F3n, no podr\u00E1 utilizar Autofirma desde el\nnavegador del sistema. \u00BFDesea cancelar el proceso?
ConfiguratorMacOSX.3=Directorio de aplicaci\u00F3n: 
ConfiguratorMacOSX.30=Cancelar acceso al Llavero
ConfiguratorMacOSX.31=El usuario cancelo el acceso al Llavero.
ConfiguratorMacOSX.32=Certificado de CA importado.
ConfiguratorMacOSX.33=Certificado SSL importado.
ConfiguratorMacOSX.34=Error al importar los certificados SSL en el Llavero.
ConfiguratorMacOSX.35=Se importa el certificado en el perfil: %1
ConfiguratorMacOSX.36=Error al importar el certificado en el perfil: %1
ConfiguratorMacOSX.4=Copiando ficheros de configuraci\u00F3n...
ConfiguratorMacOSX.5=Generando certificado para la comunicaci\u00F3n con el navegador web...
ConfiguratorMacOSX.6=Importando certificado en el almac\u00E9n de confianza del sistema...
ConfiguratorMacOSX.7=Eliminando ficheros de configuraci\u00F3n...
ConfiguratorMacOSX.8=Fin de la configuraci\u00F3n
ConfiguratorMacOSX.9=Importando certificado en el almac\u00E9n de confianza de Mozilla Firefox...
