SignApplet.0=Error al agregar un nuevo remitente al sobre electr\u00F3nico
SignApplet.1=Se va a proceder a cargar y firmar ficheros de su sistema.
SignApplet.6=Error inicializando el almac\u00E9n de claves
SignApplet.9=Error obteniendo los certificados
SignApplet.91=El nombre de fichero a firmar y empaquetar no puede ser nulo ni vac\u00EDo
SignApplet.14=El nombre de fichero para guardar datos es incorrecto, no se salvar\u00E1n los datos
SignApplet.15=La URI proporcionada no es v\u00E1lida:  
SignApplet.17=S\u00F3lo se permite grabar en almacenamiento local, no mediante el protocolo: 
SignApplet.18=Error al almacenar los datos en disco
SignApplet.2=Operaci\u00F3n no soportada
SignApplet.23=No se dispone de datos de firma, no se crear\u00E1 el fichero de firma
SignApplet.25=Firma electr\u00F3nica
SignApplet.26=Firma avanzada CAdES (*.csig)
SignApplet.27=Firma XML (*.xsig, *.xml)
SignApplet.28=Adobe PDF (*.pdf)
SignApplet.29=Firma CMS (*.csig, *.p7s, *.sig)
SignApplet.3=El tipo de almac\u00E9n de claves no est\u00E1 soportado 
SignApplet.30=Office Open XML (*.docx, *.xlsx, *.pptx)
SignApplet.31=Factura electr\u00F3nica (*.xml)
SignApplet.32=Open Document Format (*.odt, *.ods, *.odp)
SignApplet.68=Operaci\u00F3n cancelada por el usuario
SignApplet.69=Error al seleccionar el fichero de firma
SignApplet.72=Arbol de firmas no v\u00E1lido
SignApplet.63=La firma introducida no se ajusta a ning\u00FAn formato soportado
SignApplet.64=Error al recuperar los datos de firma
SignApplet.363=Error al seleccionar un certificado del repositorio
SignApplet.92=Error durante el proceso de descifrado
SignApplet.93=Error durante el proceso de cifrado
SignApplet.94=El Cliente @firma solicita firmar y empaquetar el siguiente fichero:
SignApplet.95=Formato de firma no soportado:
SignApplet.97=Error al recuperar los firmantes a contrafirmar
SignApplet.99=Error al seleccionar los nodos de firma 
SignApplet.10=Error al decodificar el certificado de destinatario, aseg\u00FDrese de que es un certificado v\u00E1lido
SignApplet.100=Se debe seleccionar al menos un nodo de firma para contrafirmar
SignApplet.156=Error
SignApplet.101=Error durante el proceso de firma
SignApplet.102=El proceso de contrafirma no gener\u00F3 ningun resultado
SignApplet.103=El Cliente @firma solicita acceso al contenido del siguiente directorio:
SignApplet.105=El Cliente @firma solicita acceso al siguiente directorio para el guardado de las firmas generadas:
SignApplet.139=El formato Enveloped es incompatible con el modo de firma expl\u00EDcito
SignApplet.140=Error desconocido durante la contrafirma
SignApplet.19=El Cliente @firma solicita acceso al siguiente fichero:
SignApplet.197=El formato del algoritmo de firma no es v\u00E1lido: 
SignApplet.198=La firma de huellas digitales no est\u00E1 soportada para el formato: %0  
SignApplet.216=La firma impl\u00EDcita de huella digital exige que se introduzcan los datos a los que corresponde la huella digital
SignApplet.236=Error durante la operaci\u00F3n de firma masiva de huellas digitales
SignApplet.154=El proceso de firma no gener\u00F3 ning\u00FAn resultado
SignApplet.318=Firma PKCS\#1 / RAW (*.sig)
SignApplet.187=Seleccione el directorio de firma
SignApplet.200=No se pudo inicializar el m\u00F3dulo de firma masiva
SignApplet.65=Error al agregar el nuevo remitente al sobre electr\u00F3nico
SignApplet.66=El Cliente @firma solicita guardar los datos descifrados en el siguiente fichero:
SignApplet.67=Error al generar un sobre electr\u00F3nico
SignApplet.655=Est\u00E1 a punto de firmar datos con la siguiente huella digital:
SignApplet.657=No se ha podido calcular la huella digital de los datos que se dispone a firmar. \u00BFDesea continuar con al operaci\u00F3n?.
SignApplet.658=Advertencia
SignApplet.669=La cadena codificada con los par\u00E1metros no es v\u00E1lida
SignApplet.673=No se pudo agregar el identificador de transacci\u00F3n a la firma 
SignApplet.682=Operaci\u00F3n de firma no soportada
SignApplet.690=El OID o el valor del atributo a agregar eran nulos
SignApplet.693=El OID especificado no tiene un formato v\u00E1lido
SignApplet.698=El OID del atributo que se desea eliminar no puede ser nulo
SignApplet.704=El OID especificado no se agreg\u00F3 previamente a la firma
SignApplet.71=El Cliente @firma solicita guardar los datos cifrados en el siguiente fichero:
SignApplet.233=Error al seleccionar el fichero
SignApplet.33=El Cliente @firma solicita acceder al siguiente fichero de firma:
SignApplet.333=Error al seleccionar el directorio
SignApplet.34=El Cliente @firma solicita acceso a datos en un dominio ajeno: 
SignApplet.277=La firma de huellas digitales s\u00F3lo est\u00E1 soportada por los formatos de firma binaria CMS y CAdES 
SignApplet.205=Error durante la operaci\u00F3n de firma masiva
SignApplet.375=No se ha inicializado la operaci\u00F3n de firma masiva
SignApplet.74=Error al recuperar el certificado del directorio LDAP:
SignApplet.75=El formato de sobre electr\u00F3nico indicado no est\u00E1 soportado
SignApplet.77=Error al recuperar el contenido del sobre electr\u00F3nico
SignApplet.78=El nombre de fichero a cifrar no puede ser nulo ni vac\u00EDo
SignApplet.79=El Cliente @firma solicita cifrar el siguiente fichero:
SignApplet.104=Seleccionar directorio
SignApplet.11=Formato de fichero err\u00F3neo o no v\u00E1lido
SignApplet.110=Error al agregar el remitente indicado
SignApplet.111=La clave para el descifrado no es v\u00E1lida
SignApplet.112=El usuario indicado no es uno de los destinatarios del sobre electr\u00F3nico
SignApplet.113=La clave para el cifrado no es v\u00E1lida
SignApplet.114=Error al extraer la clave privada del certificado
SignApplet.115=No se han encontrado en el almac\u00E9n certificados compatibles con la aplicaci\u00F3n
SignApplet.12=\u00BFDesea permitirlo?
SignApplet.16=Solicitud de permiso
SignApplet.163=Seleccione el fichero de firma
SignApplet.201=Archivos a firmar:
SignApplet.212=Se ha cancelado la selecci\u00F3n del fichero de entrada
SignApplet.214=Se ha proporcionado un nombre de fichero no v\u00E1lido
SignApplet.278=No se han introducido los datos que se desean firmar
SignApplet.348=No se ha establecido el fichero del que calcular la huella digital
SignApplet.356=Seleccione el fichero de datos
SignApplet.381=No se ha generado ninguna operaci\u00F3n de firma masiva
SignApplet.383=Fichero de registro
SignApplet.389=Error durante el proceso de firma Web
SignApplet.392=No se pudo almacenar el texto plano (establecido o cifrado) en 
SignApplet.394=No hay datos en claro que guardar
SignApplet.395=No hay datos cifrados que guardar
SignApplet.396=El fichero de salida para los datos no puede ser nulo
SignApplet.397=No se pudo almacenar el texto cifrado en 
SignApplet.4=No se pudo inicializar el almac\u00E9n de claves por defecto, \u00BFDesea intentar inicializar el almac\u00E9n %0?
SignApplet.40=Se va a guardar la clave generada en el repositorio\r\nlocal de @firma. \u00BFEst\u00E1 de acuerdo?
SignApplet.401=No se pudo acceder al fichero que se desea encriptar
SignApplet.402=No se pudo acceder al fichero que se desea desencriptar
SignApplet.403=No se pudo acceder al fichero que se desea ensobrar
SignApplet.407=Error al leer el fichero de datos
SignApplet.41=Almacenar clave autogenerada
SignApplet.414=Introduzca la contrase\u00F1a para el cifrado:
SignApplet.42=Inserte la contrase\u00F1a del almac\u00E9n de claves de usuario
SignApplet.43=Se ha superado el numero m\u00E1ximo de intentos permitidos.\nNo se almacenar\u00E1 la clave de cifrado generada.
SignApplet.46=Introduzca un alias para la clave
SignApplet.464=El algoritmo de huella digital no est\u00E1 soportado: %0
SignApplet.468=No se pudo agregar el destinatario '%0' al sobre electr\u00F3nico
SignApplet.47=Introducir alias
SignApplet.48=El nombre de fichero para firmar segun opciones de firma masiva no puede ser nulo ni vac\u00EDo
SignApplet.5=El Cliente @firma solicita guardar datos en el siguiente fichero:
SignApplet.52=Contrase\u00F1a del almac\u00E9n de claves de cifrado
SignApplet.54=El nombre de fichero para obtener el contenido textual no puede ser nulo ni vac\u00EDo
SignApplet.572=Error al cargar el certificado de destinatario: 
SignApplet.58=El nombre de fichero para obtener el contenido en Base64 no puede ser nulo ni vac\u00EDo
SignApplet.8=Error al inicializar el modulo de multifirma masiva
SignApplet.80=No se pudo inicializar el almacen de claves por defecto, \u00BFDesea intentar inicializar el almacen  %0?
SignApplet.81=Error al leer el fichero
SignApplet.82=No se pudo inicializar el almacen de claves %0, \u00BFDesea intentar inicializar el almacen %1?
SignApplet.83=Error al codificar el certificado recuperado del directorio LDAP
SignApplet.85=No se ha podido cargar el fichero de datos
SignApplet.87=El nombre de fichero a descifrar no puede ser nulo ni vac\u00EDo
SignApplet.88=El Cliente @firma solicita descifrar el siguiente fichero:
SignApplet.89=Se han introducido datos nulos para la operaci\u00F3n de firma masiva
SignApplet.490=Los datos indicados para la firma no est\u00E1n en Base64
SignApplet.491=La huella digital indicada para la firma no est\u00E1 en Base64
SignApplet.492=Los datos indicados no son un Base64 v\u00E1lido
SignApplet.493=No se dispone de memoria suficiente para tratar los datos con los que desea operar
SignApplet.494=El usuario deneg\u00F3 el acceso al fichero: %0
SignApplet.495=El usuario deneg\u00F3 el acceso al directorio: %0
SignApplet.496=El usuario deneg\u00F3 el guardado del fichero: %0
SignApplet.497=El usuario cancel\u00F3 el proceso de firma masiva
SignApplet.499=Guardar datos
SignApplet.500=Guardar firma
SignApplet.501=Guardar log de operaci\u00F3n
SignApplet.13=Los datos proporcionados no son una factura electr\u00F3nica

ExtFilter.1=Todos los ficheros
KeyStoreConfigurationManager.0=Si desea usar su DNI electr\u00F3nico o cualquier otra tarjeta\r\ninteligente criptogr\u00E1fica / almac\u00E9n de certificados\r\n extra\u00EDble (USB, PCMCIA, etc.), por favor, ins\u00E9rtelo ahora\r\ny pulse el bot\u00F3n Aceptar.

SignText.0=Se va a firmar la siguiente informaci\u00F3n:
SignText.1=Por favor, seleccione el certificado de firma:
SignText.10=Se ha usado la hora local de su ordenador, por lo que la comprobaci\u00F3n puede no ser precisa.
SignText.2=Se utilizar\u00E1 el siguiente certificado: 
SignText.3=Si est\u00E1 conforme en firmar este mensaje pulse el bot\u00F3n Aceptar
SignText.5=Puede que el certificado haya caducado.\r\nSe ha usado la hora local de su ordenador, por lo que la comprobaci\u00F3n puede no ser precisa.\r\nQuiz\u00E1s la firma generada no tenga validez legal.\r\n\u00BFDesea continuar con la operaci\u00F3n?
SignText.6=Puede que el certificado aun no sea v\u00E1lido.\r\nSe ha usado la hora local de su ordenador, por lo que la comprobaci\u00F3n puede no ser precisa.\r\nQuiz\u00E1s la firma generada no tenga validez legal.\r\n\u00BFDesea continuar con la operaci\u00F3n?
SignText.9=Error durante la validaci\u00F3n del certificado.\r\n\u00BFDesea continuar con la operaci\u00F3n?

AsynchronousSaveData.0=Firma digital
AsynchronousSaveData.1=Error al almacenar los datos en disco,\r\nlos datos no se han guardado.
AsynchronousSaveData.2=Guardar

CipherManager.0=Seleccione la clave de cifrado.
CipherManager.1=Selección de clave
CMSInformation.0=Tipo:
CMSInformation.1=Versi\u00F3n:
CMSInformation.10=Tipo de Contenido:
CMSInformation.13=Destinatarios:
CMSInformation.14=\ - Informaci\u00F3n de destino de firma
CMSInformation.15=Issuer:
CMSInformation.16=Numero de serie:
CMSInformation.17=Algoritmo de cifrado:
CMSInformation.18=OID del algoritmo de cifrado:
CMSInformation.19=Informaci\u00F3n de los datos cifrados:
CMSInformation.20=OID del algoritmo de MAC:
CMSInformation.21=OID del algoritmo de firma:
CMSInformation.22=OID del tipo de contenido:
CMSInformation.28=Atributos: No tiene atributos opcionales
CMSInformation.29=Atributos:
CMSInformation.30=Firmantes:
CMSInformation.31=- firmante
CMSInformation.35=OID del algoritmo de firma de este firmante:
CMSInformation.36=Atributos obligatorios:
CMSInformation.37=Atributos Autenticados: No tiene atributos autenticados
CMSInformation.38=Atributos Autenticados:
CMSInformation.39=Contiene fecha de firma:
CMSInformation.40=Contiene el atributo "Signing Certificate V2"
CMSInformation.41=Contiene la politica de la firma
CMSInformation.43=Contiene el atributo "MessageDigest"
CMSInformation.45=Contiene la contrafirma de la firma
CMSInformation.9=Algoritmo de firma:

UIDialogs.1=Seleccione los firmantes que desee contrafirmar:
UIDialogs.2=Listado de firmantes
UIDialogs.3=No ha seleccionado ning\u00FAn firmante.
UIDialogs.4=Seleccione los nodos que desee contrafirmar:
UIDialogs.5=\u00C1rbol de firmas
UIDialogs.6=No ha seleccionado ning\u00FAn nodo de firma.