ProtocolLauncher.0=No s'han pogut llegir les dades a signar
ProtocolLauncher.1=La URL rebuda \u00E9s nul\u00B7la
ProtocolLauncher.2=Protocol no suportat
ProtocolLauncher.3=Error en els par\u00E0metres d'entrada
ProtocolLauncher.4=Operaci\u00F3 no suportada. Comprove que disposa de l'\u00FAltima versi\u00F3 d'Autofirma.
ProtocolLauncher.5=No s'ha pogut guardar les dades
ProtocolLauncher.6=Format de signatura no suportat
ProtocolLauncher.8=Error accedint al magatzem de claus i certificats
ProtocolLauncher.9=Error realitzant la signatura electr\u00F2nica
ProtocolLauncher.11=Error en l'envio del resultat de l'operaci\u00F3.
ProtocolLauncher.12=Error en el xifrat de les dades a enviar
ProtocolLauncher.13=S'ha demanat acc\u00E9s a una direcci\u00F3 local, per\u00F2 per seguretat s'ha bloquejat l'acc\u00E9s
ProtocolLauncher.14=<html>L'aplicaci&oacute; est&agrave; obsoleta i no pot processar-se la petici&oacute;.<br>Per favor, instal\u00B7le una versi&oacute; actualitzada i reintente el proc&eacute;s de nou.</html>
ProtocolLauncher.15=Error en el desxifrat de les dades
ProtocolLauncher.16=Error en recuperar les dades del servidor intermedi
ProtocolLauncher.17=Les dades proporcionades no s\u00F3n una signatura electr\u00F2nica reconeguda
ProtocolLauncher.18=Error en descodificar el certificat de signatura
ProtocolLauncher.19=No hi ha ningun certificat v\u00E0lid en el seu magatzem. Comprove les dates de caducitat i instal\u00B7le un certificat v\u00E0lid.
ProtocolLauncher.20=Error en el processament del lot de signatura.
ProtocolLauncher.21=La versi\u00F3 d'Autofirma instal\u00B7lada no \u00E9s compatible amb este tr\uu00E0mit.\nActualice a l'\u00FAltima versi\u00F3 disponible.
ProtocolLauncher.25=Seleccione el fitxer de dades a signar
ProtocolLauncher.26=Seleccione el fitxer de signatura
ProtocolLauncher.28=Ha ocorregut un error realitzant l'operaci\u00F3.
ProtocolLauncher.29=Error
ProtocolLauncher.30=Signatura
ProtocolLauncher.31=Guardar signatura
ProtocolLauncher.32=Fitxers de dades
ProtocolLauncher.33=S'ha establit una pol\u00EDtica de signatura no v\u00E0lida o par\u00E0metres no compatibles amb ella.
ProtocolLauncher.35=Error en la lectura de les dades a carregar.
ProtocolLauncher.36=Error en la comunicaci\u00F3 amb el servei de signatura de lots.
ProtocolLauncher.37=El servei va informar d'un error durant la signatura del lot.
ProtocolLauncher.38=El fitxer no \u00E9s un PDF o \u00E9s un PDF no suportat.
ProtocolLauncher.39=Les signes XAdES Enveloped nom\u00E9s poden realitzar-se sobre dades XML.
ProtocolLauncher.40=El format de les dades a signar no \u00E9s adequat per al tipus de signatura seleccionat.
ProtocolLauncher.41=Les dades introdu\u00EFdes no es corresponen amb un objecte de signatura.
ProtocolLauncher.42=La factura ja t\u00E9 una signatura electr\u00F2nica i no admet signatures addicionals.
ProtocolLauncher.43=La contrasenya proporcionada no \u00E9s v\u00E0lida per al PDF actual o no es va proporcionar cap contrasenya.
ProtocolLauncher.44=El PDF cont\u00E9 signatures no registrades.
ProtocolLauncher.45=El PDF est\u00E0 certificat.
ProtocolLauncher.48=L'arxiu que intenta signar no \u00E9s una factura electr\u00F2nica reconeguda.
ProtocolLauncher.49=La signatura d'entrada no \u00E9s v\u00E0lida.
ProtocolLauncher.51=S'ha identificat una versi\u00F3 no segura o amb errors del Javascript de desplegament de\nAutofirma. Sol\u00B7licite al responsable de l'aplicaci\u00F3 que actualitze a l'\u00FAltima versi\u00F3.
ProtocolLauncher.52=Versi\u00F3 de Javascript no segura
ProtocolLauncher.53=L'\u00FAs d'este tr\u00E0mit web requereix una versi\u00F3 m\u00E9s recent d'Autofirma.\nActualice a l'\u00FAltima versi\u00F3 disponible.
ProtocolLauncher.55=Error durant la signatura visible del PDF.
ProtocolLauncher.56=La signatura no cont\u00E9 les dades i no es compatible amb la configuraci\u00F3 seleccionada
ProtocolLauncher.57=No es va poder obrir un socket per a la comunicaci\u00F3 amb l'aplicaci\u00F3
ProtocolLauncher.58=Aneu de sessi\u00F3 inv\u00E0lid
ProtocolLauncher.60=Advertiment
ProtocolLauncher.61=El document \u00E9s sospit\u00F3s d'haver sigut modificat des de l'\u00FAltima signatura. Verifique el contingut signat en cas de dubte. Desitja continuar amb la signatura?
ProtocolLauncher.62=\u00E9s possible que hagen dos o m\u00E9s signatures que se solapen en el document Desitja continuar amb la signatura?
ProtocolLauncher.65=L'operaci\u00F3 pot generar signatures no valgudes, per la qual cosa no es pot continuar sense confirmacion d'usuari.
ProtocolLauncher.66=El tipus de clau del certificat no est\u00E0 suportat.
ProtocolLauncher.68=El magatzem de claus est\u00E0  bloquejat
ProtocolLauncher.69=Error desconegut

Error=Errore bat aurkitu da eragiketan.
Error.1XXXXX= Errorea gertatu da kanpoko gailuarekin. Ezin da eragiketa burutu.
Error.2XXXXX= Barneko errorea gertatu da eragiketan
Error.220001=Autofirma ezin izan da web nabigatzailearekin komunikatu. Egin berriro eragiketa edo leheneratu autofirmaren instalazioa arazoak bere horretan jarraitzen badu.
Error.220008=No s'han trobat les claus per a la connexi\u00F3 segura amb el navegador.\nExecute la funci\u00F3 de restauraci\u00F3 de la instal·laci\u00F3 des del men\u00FA d'eines d'Autofirma per a poder signar des del seu navegador.

Error.3XXXXX= Kanpoko zerbitzu edo liburutegi batek errorea eman du prozesuan. Operazioa bertan behera geratu da.

Error.4XXXXX = Errorea gertatu da kanpoko zerbitzu edo aplikazio batera konektatzean. Operazioa bertan behera geratu da.
Error.400004=S'ha interromput l'operació en detectar una connexi\u00F3 amb un entorn no segur: %0

Error.5XXXXX=Ezin izan da eragiketa burutu.
Error.500006=Sinadurak informazioa behar du, eta Autofirmak ezin izan du informazio hori identifikatu. Egiaztatu Autofirmaren bertsio berriagorik dagoen.
Error.500007=Sinadura baliozkotzeko Autofirmak identifikatu ezin izan duen informazioa behar da. Egiaztatu Autofirmaren bertsio berriagorik dagoen.
Error.500002=Prozesatu nahi den sinadura baliogabea da.
Error.500003=Zure sistema eragilea ez da eskatutako eragiketarekin bateragarria.
Error.500004=Zure JRE ez da bateragarria eskatutako eragiketarekin. Eguneratu Azken Bertsio Partekiplera.
Error.500005=Web-aplikazioak Autofirmaren bertsio berriagoa behar du. Eguneratu erabilgarri dagoen azken bertsiora.
Error.500008=Fitxategia kargatzeko eragiketa ez dago sistema honetan erabilgarri.
Error.500009=Fitxategi gehiago kargatzeko eragiketa ez dago sistema honetan erabilgarri.
Error.501001=Ez da ziurtagiririk aurkitu sinadura egiteko.
Error.501002=Fitxategiaren formatuak ez du balio egin nahi den eragiketarako.
Error.501003=Txartel adimendunaren PINa ez da zuzena.

Error.501005=Dokumentuak onartutako gehienezko tamaina gainditzen du.
Error.501006=Sinadura ez da bateragarria erabilitako sinadura-formatuarekin.
Error.501007=Ez da sinadura berria gehituko, jatorrizko longeva sinadura baliogabetu egingo bailitzateke.
Error.501008=Ez da dokumentua sinatuko, sortuko den sinadura bateraezina izango bailitzateke sinadura-politikarekin.
Error.501009=Ezin izan da datuentzako sinadura-formaturik identifikatu.
Error.501010=PDF dokumentuaren ageriko sinadura bakarrik onartzen da.
Error.502001=Ez da ziurtagiririk aurkitu hautaketa egiteko.
Error.504001=Ez da ziurtagiririk aurkitu lotea sinatzeko.
Error.506001=Sarrera-direktorioa ez dago.
Error.506002=Ez dago adierazitako direktoriorako sarbiderik.

Error.510001=Sinadurak ez ditu eragiketa osatzeko behar diren sinatutako datuak.
Error.510002=Eragiketa hori egiteko XML fitxategia hautatu behar da.
Error.510003=Eragiketa hori egiteko ODF fitxategi bat hautatu behar da.
Error.510004=Eragiketa hori egiteko OOXML fitxategi bat hautatu behar da.
Error.510005=Eragiketa hori egiteko PDF fitxategi bat hautatu behar da.
Error.510006=Sinadura ez da bateragarria edo gaizki osatuta dago.
Error.510007=Dokumentua XML sinadura da eta ezin da berriro sinatu. Saiatu konfirmatzen edo kontra egiten.
Error.510008=Fakturak badu sinadura elektronikoa eta ez du sinadura osagarririk onartzen.
Error.510009=Eragiketa hori egin ahal izateko, FakturaE fitxategia hautatu behar da.

Error.511003=Gakoen biltegia blokeatuta dago.
Error.511004=Txartel adimenduna blokeatuta dago.

Error.6XXXXX=Jasotako parametroak ez dira zuzenak.
Error.62XXXX=Eskaera ez da baliozkoa.
Error.620011=Instalatutako Autofirmaren bertsioa ez da bateragarria izapide honekin.\nEguneratu erabil daitekeen azken bertsioa.