ProtocolLauncher.0=No se han podido leer los datos a firmar
ProtocolLauncher.1=La URL recibida es nula
ProtocolLauncher.2=Protocolo no soportado
ProtocolLauncher.3=Error en los par\u00E1metros de entrada
ProtocolLauncher.4=Operaci\u00F3n no soportada. Compruebe que dispone de la \u00FAltima versi\u00F3n de Autofirma.
ProtocolLauncher.5=No se ha podido guardar los datos
ProtocolLauncher.6=Formato de firma no soportado
ProtocolLauncher.8=Error accediendo al almac\u00E9n de claves y certificados
ProtocolLauncher.9=Error realizando la firma electr\u00F3nica
ProtocolLauncher.11=Error en el envio del resultado de la operaci\u00F3n.
ProtocolLauncher.12=Error en el cifrado de los datos a enviar
ProtocolLauncher.13=Se ha pedido acceso a una direcci\u00F3n local, pero por seguridad se ha bloqueado el acceso
ProtocolLauncher.14=<html>La aplicaci&oacute;n est&aacute; obsoleta y no puede procesarse la petici&oacute;n.<br>Por favor, instale una versi&oacute;n actualizada y reintente el proceso de nuevo.</html>
ProtocolLauncher.15=Error en el descifrado de los datos
ProtocolLauncher.16=Error al recuperar los datos del servidor intermedio
ProtocolLauncher.17=Los datos proporcionados no son una firma electr\u00F3nica reconocida
ProtocolLauncher.18=Error al descodificar el certificado de firma
ProtocolLauncher.19=No hay ningun certificado v\u00E1lido en su almac\u00E9n. Compruebe las fechas de caducidad e instale un certificado v\u00E1lido.
ProtocolLauncher.20=Error en el procesado del lote de firma.
ProtocolLauncher.21=La versi\u00F3n de Autofirma instalada no es compatible con este tr\u00E1mite.\nActualice a la \u00FAltima versi\u00F3n disponible.
ProtocolLauncher.25=Seleccione el fichero de datos a firmar
ProtocolLauncher.26=Seleccione el fichero de firma
ProtocolLauncher.28=Ha ocurrido un error realizando la operaci\u00F3n.
ProtocolLauncher.29=Error %0
ProtocolLauncher.30=Firma
ProtocolLauncher.31=Guardar firma
ProtocolLauncher.32=Ficheros de datos
ProtocolLauncher.33=Se ha establecido una pol\u00EDtica de firma no v\u00E1lida o par\u00E1metros no compatibles con ella.
ProtocolLauncher.35=Error en la lectura de los datos a cargar.
ProtocolLauncher.36=Error en la comunicaci\u00F3n con el servicio de firma de lotes.
ProtocolLauncher.37=El servicio inform\u00F3 de un error durante la firma del lote.
ProtocolLauncher.38=El fichero no es un PDF o es un PDF no soportado.
ProtocolLauncher.39=Las firmas XAdES Enveloped solo pueden realizarse sobre datos XML.
ProtocolLauncher.40=El formato de los datos a firmar no es adecuado para el tipo de firma seleccionado.
ProtocolLauncher.41=Los datos introducidos no se corresponden con un objeto de firma.
ProtocolLauncher.42=La factura ya tiene una firma electr\u00F3nica y no admite firmas adicionales.
ProtocolLauncher.43=La contrase\u00F1a proporcionada no es v\u00E1lida para el PDF actual o no se proporcion\u00F3 ninguna contrase\u00F1a.
ProtocolLauncher.44=El PDF contiene firmas no registradas.
ProtocolLauncher.45=El PDF est\u00E1 certificado.
ProtocolLauncher.48=El archivo que intenta firmar no es una factura electr\u00F3nica reconocida.
ProtocolLauncher.49=La firma de entrada no es v\u00E1lida.
ProtocolLauncher.51=Se ha identificado una versi\u00F3n no segura o con errores del JavaScript de despliegue de\nAutofirma. Solicite al responsable de la aplicaci\u00F3n que actualice a la \u00FAltima versi\u00F3n.
ProtocolLauncher.52=Versi\u00F3n de JavaScript no segura
ProtocolLauncher.53=El uso de este tr\u00E1mite web requiere una versi\u00F3n m\u00E1s reciente de Autofirma.\nActualice a la \u00FAltima versi\u00F3n disponible.
ProtocolLauncher.55=Error durante la firma visible del PDF.
ProtocolLauncher.56=La firma no contiene los datos y no se compatible con la configuraci\u00F3n seleccionada
ProtocolLauncher.57=No se pudo abrir un socket para la comunicaci\u00F3n con la aplicaci\u00F3n
ProtocolLauncher.58=Id de sesi\u00F3n inv\u00E1lido
ProtocolLauncher.60=Advertencia
ProtocolLauncher.61=El documento es sospechoso de haber sido modificado desde la \u00FAltima firma. Verifique el contenido firmado en caso de duda. ¿Desea continuar con la firma?
ProtocolLauncher.62=Es posible que hayan dos o m\u00E1s firmas que se solapen en el documento ¿Desea continuar con la firma?
ProtocolLauncher.65=La operaci\u00F3n puede generar firmas no validas, por lo que no se puede continuar sin confirmacion de usuario.
ProtocolLauncher.66=El tipo de clave del certificado no est\u00E1 soportado.
ProtocolLauncher.67=Error
ProtocolLauncher.68=El almacen de claves esta bloqueado
ProtocolLauncher.69=Error desconocido

Error=Se ha encontrado un error durante la operaci&oacute;n.
Error.1XXXXX=Se ha producido un error con el dispositivo externo. No se puede completar la operaci\u00F3n. 
Error.2XXXXX=Ocurri\u00F3 un error interno durante la operaci\u00F3n 
Error.220001=Autofirma no ha podido comunicarse con el navegador web. Reintente la operaci\u00F3n o restaure\nla instalaci\u00F3n de Autofirma si el problema persiste.
Error.220008=No se han encontrado las claves para la conexi\u00F3n segura con el navegador.\nEjecute la funci\u00F3n de restauraci\u00F3n de la instalaci\u00F3n desde el men\u00FA de herramientas de Autofirma para poder firmar.

Error.3XXXXX=Un servicio o biblioteca externo devolvi\u00F3 un error durante el proceso. Se aborta la operaci\u00F3n.

Error.4XXXXX=Ocurri\u00F3 un error al conectarse con un servicio o aplicativo externo. Se aborta la operaci\u00F3n.
Error.400004=Se ha interrumpido la operaci\u00F3n al detectar una conexi\u00F3n con un entorno no seguro: %0

Error.5XXXXX=No se ha podido completar la operaci\u00F3n.
Error.500006=La firma requiere informaci\u00F3n que Autofirma no ha podido identificar. Compruebe si existe una versi\u00F3n m\u00E1s reciente de Autofirma.
Error.500007=La validaci\u00F3n de la firma requiere informaci\u00F3n que Autofirma no ha podido identificar. Compruebe si existe una versi\u00F3n m\u00E1s reciente de Autofirma.
Error.500002=La firma que se trata de procesar es inv\u00E1lida.
Error.500003=Su sistema operativo no es compatible con la operaci\u00F3n solicitada.
Error.500004=Su JRE no es compatible con la operaci\u00F3n solicitada. Actual\u00EDcela a la \u00FAltima versi\u00F3n compatiple.
Error.500005=La aplicaci\u00F3n web requiere una versi\u00F3n posterior de Autofirma. Actualicese a la \u00FAltima versi\u00F3n disponible.
Error.500008=La operaci\u00F3n de carga de fichero no est\u00E1 disponible en este sistema.
Error.500009=La operaci\u00F3n de carga de m\u00FAltiples ficheros no est\u00E1 disponible en este sistema.
Error.501001=No se han encontrado certificados para realizar la firma.
Error.501002=El formato de fichero no es v\u00E1lido para la operaci\u00F3n que se intenta realizar.
Error.501003=El PIN del la tarjeta inteligente es incorrecto.

Error.501005=El documento supera el tama\u00F1o m\u00E1ximo permitido.
Error.501006=La firma no es compatible con el formato de firma utilizado.
Error.501007=No se agregar\u00E1 la nueva firma porque la firma longeva original quedar\u00EDa invalidada.
Error.501008=No se firmar\u00E1 el documento porque la firma resultante ser\u00EDa incompatible con la pol\u00EDtica de firma.
Error.501009=No se ha podido identificar un formato de firma para los datos.
Error.501010=S\u00F3lo se permite la firma visible del documento PDF.
Error.502001=No se han encontrado certificados para realizar la selecci\u00F3n.
Error.504001=No se han encontrado certificados para realizar la firma del lote.
Error.506001=El directorio de entrada no existe.
Error.506002=No se tiene acceso al directorio indicado.

Error.510001=La firma no contiene los datos firmados necesarios para completar la operaci\u00F3n.
Error.510002=Para poder realizar esta operaci\u00F3n es necesario seleccionar un fichero XML.
Error.510003=Para poder realizar esta operaci\u00F3n es necesario seleccionar un fichero ODF.
Error.510004=Para poder realizar esta operaci\u00F3n es necesario seleccionar un fichero OOXML.
Error.510005=Para poder realizar esta operaci\u00F3n es necesario seleccionar un fichero PDF.
Error.510006=La firma no es compatible o est\u00E1 mal formada.
Error.510007=El documento es una firma XML y no se puede volver a firmar. Pruebe a cofirmarla o contrafirmarla.
Error.510008=La factura ya tiene una firma electr\u00F3nica y no admite firmas adicionales.
Error.510009=Para poder realizar esta operaci\u00F3n es necesario seleccionar un fichero FacturaE.

Error.511003=El almac\u00E9n de claves esta bloqueado.
Error.511004=La tarjeta inteligente esta bloqueada.

Error.6XXXXX=Los par\u00E1metros recibidos no son corretos.
Error.62XXXX=La petici\u00F3n no es v\u00E1lida.
Error.620011=La versi\u00F3n de Autofirma instalada no es compatible con este tr\u00E1mite.\nActualice a la \u00FAltima versi\u00F3n disponible.
