ProtocolLauncher.0=Non se puideron ler os datos a asinar
ProtocolLauncher.1=A URL recibida \u00E9 nula
ProtocolLauncher.2=Protocolo non soportado
ProtocolLauncher.3=Erro nos par\u00E1metros de entrada
ProtocolLauncher.4=Operaci\u00F3n non soportada. Comprobe que disp\u00F3n da \u00FAltima versi\u00F3n de Autofirma.
ProtocolLauncher.5=Non se puido gardar os datos
ProtocolLauncher.6=Formato de firma non soportado
ProtocolLauncher.8=Erro accedendo ao almac\u00E9n de claves e certificados
ProtocolLauncher.9=Erro realizando a firma electr\u00F3nica
ProtocolLauncher.11=Erro no envio do resultado da operaci\u00F3n.
ProtocolLauncher.12=Erro no cifrado dos datos a enviar
ProtocolLauncher.13=Pediuse acceso a unha direcci\u00F3n local, pero por seguridade bloqueouse o acceso
ProtocolLauncher.14=<html>A aplicaci&oacute;n est&aacute; obsoleta e non pode procesarse o pedimento.<br>Por favor, instale unha versi&oacute;n actualizada e reintente o proceso de novo.</html>
ProtocolLauncher.15=Erro no descifrado dos datos
ProtocolLauncher.16=Erro ao recuperar os datos do servidor intermedio
ProtocolLauncher.17=Os datos proporcionados non son unha firma electr\u00F3nica reco\u00F1ecida
ProtocolLauncher.18=Erro ao descodificar o certificado de firma
ProtocolLauncher.19=Non hai ningun certificado v\u00E1lido no seu almac\u00E9n. Comprobe as datas de caducidade e instale un certificado v\u00E1lido.
ProtocolLauncher.20=Erro no procesado do lote de firma.
ProtocolLauncher.21=A versi\u00F3n de Autofirma instalada non \u00E9 compatible con este tr\u00E1mite.\nActualice \u00E1 \u00FAltima versi\u00F3n dispo\u00F1ible.
ProtocolLauncher.25=Seleccione o ficheiro de datos a asinar
ProtocolLauncher.26=Seleccione o ficheiro de firma
ProtocolLauncher.28=Ocorreu un erro realizando a operaci\u00F3n.
ProtocolLauncher.29=Erro
ProtocolLauncher.30=Firma
ProtocolLauncher.31=Gardar firma
ProtocolLauncher.32=Ficheiros de datos
ProtocolLauncher.33=Estableceuse unha pol\u00EDtica de firma non v\u00E1lida ou par\u00E1metros non compatibles con ela.
ProtocolLauncher.35=Erro na lectura dos datos a cargar.
ProtocolLauncher.36=Erro na comunicaci\u00F3n co servizo de sinatura de lotes.
ProtocolLauncher.37=O servizo informou dun erro durante o sinatura do lote.
ProtocolLauncher.38=O ficheiro non \u00E9 un PDF ou \u00E9 un PDF non soportado.
ProtocolLauncher.39=As\u00EDnalas XAdES Enveloped s\u00F3 poden realizarse sobre datos XML.
ProtocolLauncher.40=O formato dos datos a asinar non \u00E9 adecuado para o tipo de firma seleccionado.
ProtocolLauncher.41=Os datos introducidos non se corresponden cun obxecto de firma.
ProtocolLauncher.42=A factura xa ten unha firma electr\u00F3nica e non admite firmas adicionais.
ProtocolLauncher.43=O contrasinal proporcionado non \u00E9 v\u00E1lida para o PDF actual ou non se proporcionou ning\u00FAn contrasinal.
ProtocolLauncher.44=O PDF cont\u00E9n firmas non rexistradas.
ProtocolLauncher.45=O PDF est\u00E1 certificado.
ProtocolLauncher.48=O arquivo que tenta asinar non \u00E9 unha factura electr\u00F3nica reco\u00F1ecida.
ProtocolLauncher.49=A sinatura de entrada non \u00E9 v\u00E1lida.
ProtocolLauncher.51=Identificouse unha versi\u00F3n non segura ou con erros do Javascript de despregamento de\nAutofirma. Solicite ao responsable da aplicaci\u00F3n que actualice \u00E1 \u00FAltima versi\u00F3n.
ProtocolLauncher.52=Versi\u00F3n de Javascript non segura
ProtocolLauncher.53=O uso deste tr\u00E1mite web require unha versi\u00F3n m\u00E1is recente de Autofirma.\nActualice \u00E1 \u00FAltima versi\u00F3n dispo\u00F1ible.
ProtocolLauncher.55=Erro durante a firma visible do PDF.
ProtocolLauncher.56=A firma non cont\u00E9n os datos e non se compatible coa configuraci\u00F3n seleccionada
ProtocolLauncher.57=Non se puido abrir un socket para a comunicaci\u00F3n coa aplicaci\u00F3n
ProtocolLauncher.58=Ide de sesi\u00F3n inv\u00E1lido
ProtocolLauncher.60=Advertencia
ProtocolLauncher.61=O documento \u00E9 sospeitoso de ser modificado desde a \u00FAltima firma. Verifique o contido asinado en caso de d\u00FAbida. Desexa continuar coa firma?
ProtocolLauncher.62=\u00E9 posible que haxan dous ou m\u00E1is firmas que se solapen no documento Desexa continuar coa firma?
ProtocolLauncher.65=A operaci\u00F3n pode xerar firmas non validas, polo que non se pode continuar sen confirmacion de usuario.
ProtocolLauncher.66=O tipo de clave do certificado non est\u00E1 soportado.
ProtocolLauncher.67=Erro
ProtocolLauncher.68=O almac\u00E9n de chaves est\u00E1 bloqueado
ProtocolLauncher.69=Erro desco\u00F1ecido

Error=Atopouse un erro durante a operaci&oacute;n.
Error.1XXXXX=Produciuse un erro co dispositivo externo. Non se pode completar a operaci\u00F3n.
Error.2XXXXX=Ocorreu un erro interno durante a operaci\u00F3n
Error.220001=Autofirma non puido comunicarse co navegador web. Reintente a operaci\u00F3n ou restaure\n la instalaci\u00F3n de Autofirma se o problema persiste.
Error.220008=Non se atoparon as claves para a conexi\u00F3n segura co navegador.\nExecute a funci\u00F3n de\nrestauraci\u00F3n da instalaci\u00F3n desde o men\u00FA de ferramentas de Autofirma para poder asinar desde o seu navegador.
 
Error.3XXXXX=Un servizo ou biblioteca externo devolveu un erro durante o proceso. Ab\u00F3rtase a operaci\u00F3n.
 
Error.4XXXXX=Ocorreu un erro ao conectarse cun servizo ou aplicaci\u00F3n externa. Ab\u00F3rtase a operaci\u00F3n.
Error.400004=Interrompeuse a operaci\u00F3n ao detectar unha conexi\u00F3n cunha contorna non segura: %0
 
Error.5XXXXX=Non se puido completar a operaci\u00F3n.
Error.500006=A firma require informaci\u00F3n que Autofirma non puido identificar. Comprobe se existe unha versi\u00F3n m\u00E1is recente de Autofirma.
Error.500007=A validaci\u00F3n da firma require informaci\u00F3n que Autofirma non puido identificar. Comprobe se existe unha versi\u00F3n m\u00E1is recente de Autofirma.
Error.500002=A firma que se trata de procesar \u00E9 inv\u00E1lida.
Error.500003=O seu sistema operativo non \u00E9 compatible coa operaci\u00F3n solicitada.
Error.500004=O seu JRE non \u00E9 compatible coa operaci\u00F3n solicitada. Actualizar \u00E1 \u00DAltima versi\u00F3n compatiple.
Error.500005=A aplicaci\u00F3n web require unha versi\u00F3n posterior de Autofirma. Actualicese \u00E1 \u00FAltima versi\u00F3n dispo\u00F1ible.
Error.500008=A operaci\u00F3n de carga de ficheiro non est\u00E1 dispo\u00F1ible neste sistema.
Error.500009=A operaci\u00F3n de carga de m\u00FAltiples ficheiros non est\u00E1 dispo\u00F1ible neste sistema.
Error.501001=Non se atoparon certificados para realizar a firma.
Error.501002=O formato de ficheiro non \u00E9 v\u00E1lido para a operaci\u00F3n que se tenta realizar.
Error.501003=O PIN do o cart\u00F3n intelixente \u00E9 incorrecto.
 
Error.501005=O documento supera o tama\u00F1o m\u00E1ximo permitido.
Error.501006=A firma non \u00E9 compatible co formato de firma utilizado.
Error.501007=Non se agregar\u00E1 a nova firma porque a firma lonxeva orixinal quedar\u00EDa invalidada.
Error.501008=Non se asinar\u00E1 o documento porque a firma resultante ser\u00EDa incompatible coa pol\u00EDtica de firma.
Error.501009=Non se puido identificar un formato de firma para os datos.
Error.501010=S\u00F3 se permite a firma visible do documento PDF.
Error.502001=Non se atoparon certificados para realizar a selecci\u00F3n.
Error.504001=Non se atoparon certificados para realizar o sinatura do lote.
Error.506001=O directorio de entrada non existe.
Error.506002=Non se ten acceso ao directorio indicado.
 
Error.510001=A firma non cont\u00E9n os datos asinados necesarios para completar a operaci\u00F3n.
Error.510002=Para poder realizar esta operaci\u00F3n \u00E9 necesario seleccionar un ficheiro XML.
Error.510003=Para poder realizar esta operaci\u00F3n \u00E9 necesario seleccionar un ficheiro ODF.
Error.510004=Para poder realizar esta operaci\u00F3n \u00E9 necesario seleccionar un ficheiro OOXML.
Error.510005=Para poder realizar esta operaci\u00F3n \u00E9 necesario seleccionar un ficheiro PDF.
Error.510006=A firma non \u00E9 compatible ou est\u00E1 mal formada.
Error.510007=O documento \u00E9 unha asina XML e non se pode volver asinar. Probe a cofirmarla ou contrafirmarla.
Error.510008=A factura xa ten unha firma electr\u00F3nica e non admite firmas adicionais.
Error.510009=Para poder realizar esta operaci\u00F3n \u00E9 necesario seleccionar un ficheiro Facturae.
 
Error.511003=O almac\u00E9n de claves esta bloqueado.
Error.511004=O cart\u00F3n intelixente esta bloqueada.r 

Error.6XXXXX=Os par\u00E1metros recibidos non son corretos.
Error.62XXXX=O pedimento non \u00E9 v\u00E1lida.
Error.620011=A versi\u00F3n de Autofirma instalada non \u00E9 compatible con este tr\u00E1mite.\nActualice \u00E1 \u00FAltima versi\u00F3n dispo\u00F1ible.
