ProtocolLauncher.0=No s'han pogut llegir les dades a signar
ProtocolLauncher.1=La URL rebuda \u00E9s nul\00B7la
ProtocolLauncher.2=Protocol no suportat
ProtocolLauncher.3=Error en els par\u00E0metres d'entrada
ProtocolLauncher.4=Operaci\u00F3 no suportada. Comprovi que disposa de l'\u00FAltima versi\u00F3 d'Autofirma.
ProtocolLauncher.5=No s'ha pogut guardar les dades
ProtocolLauncher.6=Format de signatura no suportat
ProtocolLauncher.8=Error accedint al magatzem de claus i certificats
ProtocolLauncher.9=Error realitzant la signatura electr\u00F2nica
ProtocolLauncher.11=Error en l'envio del resultat de l'operaci\u00F3.
ProtocolLauncher.12=Error en el xifrat de les dades a enviar
ProtocolLauncher.13=S'ha demanat acc\u00E9s a una direcci\u00F3 local, per\u00F2 per seguretat s'ha bloquejat l'acc\u00E9s
ProtocolLauncher.14=<html>L'aplicaci&oacute; est&agrave; obsoleta i no pot processar-se la petici&oacute;.<br>Si us plau, instal\u00B7li una versi&oacute; actualitzada i reintenti el proc&eacute;s de nou.</html>
ProtocolLauncher.15=Error en el desxifrat de les dades
ProtocolLauncher.16=Error en recuperar les dades del servidor intermedi
ProtocolLauncher.17=Les dades proporcionades no s\u00F3n una signatura electr\u00F2nica reconeguda
ProtocolLauncher.18=Error en descodificar el certificat de signatura
ProtocolLauncher.19=No hi ha ningun certificat v\u00E0lid en el seu magatzem. Comprovi les dates de caducitat i instal\u00B7li un certificat v\u00E0lid.
ProtocolLauncher.20=Error en el processament del lot de signatura.
ProtocolLauncher.21=La versi\u00F3 d'Autofirma instal\u00B7lada no \u00E9s compatible amb aquest tr\u00E0mit.\nActualice a l'\u00FAltima versi\u00F3 disponible.
ProtocolLauncher.25=Seleccioni el fitxer de dades a signar
ProtocolLauncher.26=Seleccioni el fitxer de signatura
ProtocolLauncher.28=Ha ocorregut un error realitzant l'operaci\u00F3.
ProtocolLauncher.29=Error
ProtocolLauncher.30=Signatura
ProtocolLauncher.31=Guardar signatura
ProtocolLauncher.32=Fitxers de dades
ProtocolLauncher.33=S'ha establert una pol\u00EDtica de signatura no v\u00E0lida o par\u00E0metres no compatibles amb ella.
ProtocolLauncher.35=Error en la lectura de les dades a carregar.
ProtocolLauncher.36=Error en la comunicaci\u00F3 amb el servei de signatura de lots.
ProtocolLauncher.37=El servei va informar d'un error durant la signatura del lot.
ProtocolLauncher.38=El fitxer no \u00E9s un PDF o \u00E9s un PDF no suportat.
ProtocolLauncher.39=Les signes XAdES Enveloped nom\u00E9s poden realitzar-se sobre dades XML.
ProtocolLauncher.40=El format de les dades a signar no \u00E9s adequat per al tipus de signatura seleccionat.
ProtocolLauncher.41=Les dades introdu\u00EFdes no es corresponen amb un objecte de signatura.
ProtocolLauncher.42=La factura ja t\u00E9 una signatura electr\u00F2nica i no admet signatures addicionals.
ProtocolLauncher.43=La contrasenya proporcionada no \u00E9s v\u00E0lida per al PDF actual o no es va proporcionar cap contrasenya.
ProtocolLauncher.44=El PDF cont\u00E9 signatures no registrades.
ProtocolLauncher.45=El PDF est\u00E0 certificat.
ProtocolLauncher.48=L'arxiu que intenta signar no \u00E9s una factura electr\u00F2nica reconeguda.
ProtocolLauncher.49=La signatura d'entrada no \u00E9s v\u00E0lida.
ProtocolLauncher.51=S'ha identificat una versi\u00F3 no segura o amb errors del Javascript de desplegament de\nAutofirma. Sol\u00B7liciti al responsable de l'aplicaci\u00F3 que actualitzi a l'\u00FAltima versi\u00F3.
ProtocolLauncher.52=Versi\u00F3 de Javascript no segura
ProtocolLauncher.53=L'\u00FAs d'aquest tr\u00E0mit web requereix una versi\u00F3 m\u00E9s recent d'Autofirma.\nActualice a l'\u00FAltima versi\u00F3 disponible.
ProtocolLauncher.55=Error durant la signatura visible del PDF.
ProtocolLauncher.56=La signatura no cont\u00E9 les dades i no es compatible amb la configuraci\u00F3 seleccionada
ProtocolLauncher.57=No es va poder obrir un socket per a la comunicaci\u00F3 amb l'aplicaci\u00F3
ProtocolLauncher.58=Aneu de sessi\u00F3 inv\u00E0lid
ProtocolLauncher.60=Advertiment
ProtocolLauncher.61=El document \u00E9s sospit\u00F3s d'haver estat modificat des de l'\u00FAltima signatura. Verifiqui el contingut signat en cas de dubte. Desitja continuar amb la signatura?
ProtocolLauncher.62=\u00E9s possible que hagin dos o m\u00E9s signatures que se solapin en el document Desitja continuar amb la signatura?
ProtocolLauncher.65=L'operaci\u00F3 pot generar signatures no valgudes, per la qual cosa no es pot continuar sense confirmacion d'usuari.
ProtocolLauncher.66=El tipus de clau del certificat no est\u00E0 suportat.
ProtocolLauncher.67=Error
ProtocolLauncher.68=El magatzem de claus està bloquejat
ProtocolLauncher.69=Error desconegut

Error=S'ha trobat un error durant l'operaci&oacute;.
Error.1XXXXX=S'ha produ\u00EFt un error amb el dispositiu extern. No es pot completar l'operaci\u00F3.
Error.2XXXXX=Va oc\u00F3rrer un error intern durant l'operaci\u00F3
Error.220001=Autofirma no ha pogut comunicar-se amb el navegador web. Reintenti l'operaci\u00F3 o restauri\nla instal\u00B7laci\u00F3 d'Autofirma si el problema persisteix.
Error.220008=No s'han trobat les claus per a la connexi\u00F3 segura amb el navegador.\nExecuti la funci\u00F3 de restauraci\u00F3 de la instal·laci\u00F3 des del men\u00FA d'eines d'Autofirma per a poder signar des del seu navegador.

 
Error.3XXXXX=Un servei o biblioteca extern va retornar un error durant el proc\u00E9s. S'avorta l'operaci\u00F3.
 
Error.4XXXXX=Va oc\u00F3rrer un error en connectar-se amb un servei o aplicatiu extern. S'avorta l'operaci\u00F3.
Error.400004=S'ha interromput l'operació en detectar una connexi\u00F3 amb un entorn no segur: %0
 
Error.5XXXXX=No s'ha pogut completar l'operaci\u00F3.
Error.500006=La signatura requereix informaci\u00F3 que Autofirma no ha pogut identificar. Comprovi si existeix una versi\u00F3 m\u00E9s recent d'Autofirma.
Error.500007=La validaci\u00F3 de la signatura requereix informaci\u00F3 que Autofirma no ha pogut identificar. Comprovi si existeix una versi\u00F3 m\u00E9s recent d'Autofirma.
Error.500002=La signatura que es tracta de processar \u00E9s inv\u00E0lida.
Error.500003=El seu sistema operatiu no \u00E9s compatible amb l'operaci\u00F3 sol\u00B7licitada.
Error.500004=El seu JRE no \u00E9s compatible amb l'operaci\u00F3 sol\u00B7licitada. Actualitzi-la a l'\u00DAltima versi\u00F3 compatiple.
Error.500005=L'aplicaci\u00F3 web requereix una versi\u00F3 posterior d'Autofirma. Actualicese a l'\u00FAltima versi\u00F3 disponible.
Error.500008=L'operaci\u00F3 de c\u00E0rrega de fitxer no est\u00E0 disponible en aquest sistema.
Error.500009=L'operaci\u00F3 de c\u00E0rrega de m\u00FAltiples fitxers no est\u00E0 disponible en aquest sistema.
Error.501001=No s'han trobat certificats per a realitzar la signatura.
Error.501002=El format de fitxer no \u00E9s v\u00E0lid per a l'operaci\u00F3 que s'intenta realitzar.
Error.501003=El PIN del la targeta intel\u00B7ligent \u00E9s incorrecte.
 
Error.501005=El document supera la grand\u00E0ria m\u00E0xima permesa.
Error.501006=La signatura no \u00E9s compatible amb el format de signatura utilitzat.
Error.501007=No s'agregar\u00E0 la nova signatura perqu\u00E8 la signatura longeva original quedaria invalidada.
Error.501008=No se signar\u00E0 el document perqu\u00E8 la signatura resultant seria incompatible amb la pol\u00EDtica de signatura.
Error.501009=No s'ha pogut identificar un format de signatura per a les dades.
Error.501010=Nom\u00E9s es permet la signatura visible del document PDF.
Error.502001=No s'han trobat certificats per a realitzar la selecci\u00F3.
Error.504001=No s'han trobat certificats per a realitzar la signatura del lot.
Error.506001=El directori d'entrada no existeix.
Error.506002=No es t\u00E9 acc\u00E9s al directori indicat.
 
Error.510001=La signatura no cont\u00E9 les dades signades necess\u00E0ries per a completar l'operaci\u00F3.
Error.510002=Per a poder realitzar aquesta operaci\u00F3 \u00E9s necessari seleccionar un fitxer XML.
Error.510003=Per a poder realitzar aquesta operaci\u00F3 \u00E9s necessari seleccionar un fitxer ODF.
Error.510004=Per a poder realitzar aquesta operaci\u00F3 \u00E9s necessari seleccionar un fitxer OOXML.
Error.510005=Per a poder realitzar aquesta operaci\u00F3 \u00E9s necessari seleccionar un fitxer PDF.
Error.510006=La signatura no \u00E9s compatible o est\u00E0 mal formada.
Error.510007=El document \u00E9s una signatura XML i no es pot tornar a signar. Provi a cofirmarla o contrasignar-la.
Error.510008=La factura ja t\u00E9 una signatura electr\u00F2nica i no admet signatures addicionals.
Error.510009=Per a poder realitzar aquesta operaci\u00F3 \u00E9s necessari seleccionar un fitxer FacturaE.
 
Error.511003=El magatzem de claus aquesta bloquejat.
Error.511004=La targeta intel\u00B7ligent aquesta bloquejada.
 
Error.6XXXXX=Els par\u00E0metres rebuts no s\u00F3n corretos.
Error.62XXXX=La petici\u00F3 no \u00E9s v\u00E0lida.
Error.620011=La versi\u00F3 d'Autofirma instal\u00B7lada no \u00E9s compatible amb aquest tr\u00E0mit.\nActualice a l'\u00FAltima versi\u00F3 disponible.

