ProtocolLauncher.0=No s'han pogut llegir les dades a signar
ProtocolLauncher.1=La URL rebuda \u00E9s nul路la
ProtocolLauncher.2=Protocol no suportat
ProtocolLauncher.3=Error en els par\u00E0metres d'entrada
ProtocolLauncher.4=Operaci\u00F3 no suportada. Comprove que disposa de l'\u00FAltima versi\u00F3 d'Autofirma.
ProtocolLauncher.5=No s'ha pogut guardar les dades
ProtocolLauncher.6=Format de signatura no suportat
ProtocolLauncher.8=Error accedint al magatzem de claus i certificats
ProtocolLauncher.9=Error realitzant la signatura electr\u00F2nica
ProtocolLauncher.11=Error en l'envio del resultat de l'operaci\u00F3.
ProtocolLauncher.12=Error en el xifrat de les dades a enviar
ProtocolLauncher.13=S'ha demanat acc\u00E9s a una direcci\u00F3 local, per\u00F2 per seguretat s'ha bloquejat l'acc\u00E9s
ProtocolLauncher.14=<html>L'aplicaci&oacute; est&agrave; obsoleta i no pot processar-se la petici&oacute;.<br>Per favor, instal路le una versi&oacute; actualitzada i reintente el proc&eacute;s de nou.</html>
ProtocolLauncher.15=Error en el desxifrat de les dades
ProtocolLauncher.16=Error en recuperar les dades del servidor intermedi
ProtocolLauncher.17=Les dades proporcionades no s\u00F3n una signatura electr\u00F2nica reconeguda
ProtocolLauncher.18=Error en descodificar el certificat de signatura
ProtocolLauncher.19=No hi ha ningun certificat v\u00E0lid en el seu magatzem. Comprove les dates de caducitat i instal路le un certificat v\u00E0lid.
ProtocolLauncher.20=Error en el processament del lot de signatura.
ProtocolLauncher.21=La versi\u00F3 d'Autofirma instal路lada no \u00E9s compatible amb este tr\uu00E0mit.\nActualice a l'\u00FAltima versi\u00F3 disponible.
ProtocolLauncher.25=Seleccione el fitxer de dades a signar
ProtocolLauncher.26=Seleccione el fitxer de signatura
ProtocolLauncher.28=Ha ocorregut un error realitzant l'operaci\u00F3.
ProtocolLauncher.29=Error
ProtocolLauncher.30=Signatura
ProtocolLauncher.31=Guardar signatura
ProtocolLauncher.32=Fitxers de dades
ProtocolLauncher.33=S'ha establit una pol\u00EDtica de signatura no v\u00E0lida o par\u00E0metres no compatibles amb ella.
ProtocolLauncher.35=Error en la lectura de les dades a carregar.
ProtocolLauncher.36=Error en la comunicaci\u00F3 amb el servei de signatura de lots.
ProtocolLauncher.37=El servei va informar d'un error durant la signatura del lot.
ProtocolLauncher.38=El fitxer no \u00E9s un PDF o \u00E9s un PDF no suportat.
ProtocolLauncher.39=Les signes XAdES Enveloped nom\u00E9s poden realitzar-se sobre dades XML.
ProtocolLauncher.40=El format de les dades a signar no \u00E9s adequat per al tipus de signatura seleccionat.
ProtocolLauncher.41=Les dades introdudes no es corresponen amb un objecte de signatura.
ProtocolLauncher.42=La factura ja t\u00E9 una signatura electr\u00F2nica i no admet signatures addicionals.
ProtocolLauncher.43=La contrasenya proporcionada no \u00E9s v\u00E0lida per al PDF actual o no es va proporcionar cap contrasenya.
ProtocolLauncher.44=El PDF cont\u00E9 signatures no registrades.
ProtocolLauncher.45=El PDF est\u00E0 certificat.
ProtocolLauncher.48=L'arxiu que intenta signar no \u00E9s una factura electr\u00F2nica reconeguda.
ProtocolLauncher.49=La signatura d'entrada no \u00E9s v\u00E0lida.
ProtocolLauncher.51=S'ha identificat una versi\u00F3 no segura o amb errors del Javascript de desplegament de\nAutofirma. Sol路licite al responsable de l'aplicaci\u00F3 que actualitze a l'\u00FAltima versi\u00F3.
ProtocolLauncher.52=Versi\u00F3 de Javascript no segura
ProtocolLauncher.53=L'\u00FAs d'este tr\u00E0mit web requereix una versi\u00F3 m\u00E9s recent d'Autofirma.\nActualice a l'\u00FAltima versi\u00F3 disponible.
ProtocolLauncher.55=Error durant la signatura visible del PDF.
ProtocolLauncher.56=La signatura no cont\u00E9 les dades i no es compatible amb la configuraci\u00F3 seleccionada
ProtocolLauncher.57=No es va poder obrir un socket per a la comunicaci\u00F3 amb l'aplicaci\u00F3
ProtocolLauncher.58=Aneu de sessi\u00F3 inv\u00E0lid
ProtocolLauncher.60=Advertiment
ProtocolLauncher.61=El document \u00E9s sospit\u00F3s d'haver sigut modificat des de l'\u00FAltima signatura. Verifique el contingut signat en cas de dubte. Desitja continuar amb la signatura?
ProtocolLauncher.62=\u00E9s possible que hagen dos o m\u00E9s signatures que se solapen en el document Desitja continuar amb la signatura?
ProtocolLauncher.65=L'operaci\u00F3 pot generar signatures no valgudes, per la qual cosa no es pot continuar sense confirmacion d'usuari.
ProtocolLauncher.66=El tipus de clau del certificat no est\u00E0 suportat.
ProtocolLauncher.67=Error
