<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd"> 
<html>
 <head>
  <meta http-equiv="Content-type" content="text/html;charset=UTF-8">
  <title>
   Valores aceptados como par&aacute;metros adicionales para las firmas XAdES
  </title>
 </head>
 <body>
 <p>Valores aceptados como par&aacute;metros adicionales para las firmas XAdES:</p>
 <dl>
  <dt><b><i>useManifest</i></b></dt>
   <dd>
    Indica, mediante <code>true</code> o <code>false</code> (por defecto), si debe usarse
    un <a href="http://www.w3.org/TR/xmldsig-core1/#sec-o-Manifest">Manifest</a> de XMLDSig
    con las referencias de firma en vez de firmar directamente estas referencias.<br>
    Esto permite que sea opcional la comprobaci&oacute;n del destino y huellas digitales de
    las referencias. 
   </dd>
  <dt><b><i>insertEnvelopedSignatureOnNodeByXPath</i></b></dt>
   <dd>
    Indica, mediante una expresi&oacute;n XPath (v1), el nodo bajo el cual 
    debe insertarse el nodo de firma en el caso de una firma <i>Enveloped</i>.<br>
    Si la expresi&oacute;n devuelve m&aacute;s de un nodo, se usa solo el primero.
    Si la expresi&oacute;n no devuelve nodos o est&aacute; mal construida se 
    lanzar&aacute; una excepci&oacute;n.<br>
    Este par&aacute;metro solo tiene efecto en firmas <i>Enveloped</i>. 
   </dd>
  <dt><b><i>addKeyInfoKeyValue</i></b></dt>
   <dd>
    Indica, mediante <code>true</code> (por defecto) o <code>false</code>, si debe
    incluirse el nodo <code>KeyValue</code> dentro de <code>KeyInfo</code> de XAdES.
   </dd>
  <dt><b><i>addKeyInfoKeyName</i></b></dt>
   <dd>
    Indica, mediante <code>true</code> o <code>false</code> (por defecto), si debe
    incluirse el nodo <code>KeyName</code> dentro de <code>KeyInfo</code> de XAdES.
   </dd>
  <!-- <dt><b><i>avoidXpathExtraTransformsOnEnveloped</i></b> (&uacute;nicamente aplica a firmas <i>enveloped</i>)</dt>
   <dd>
	Indica si se debe evitar la inclusi&oacute;n de la transformaci&oacute;n
	XPATH2 que normalmente se a&ntilde;ade para posibilitar las cofirmas y
	que elimina todas las firmas del documento para dejar &uacute;nicamente
	el contenido. Por defecto, se encuentra a <code>false</code>.
   </dd> -->
  <dt><b><i>nodeToSign</i></b> (no aplica a contrafirmas)</dt>
   <dd>
	Indica un identificador de nodo a firmar, para el caso en el que quiera firmarse
	un nodo concreto en vez de todo el documento. Solo aplica a la firma de
	documentos XML.
	<br>
	El identificador de nodo debe estar indicado con el valor de un atributo llamado <i>Id</i>,
	y se ignorar&aacute;n los atributos con nombre distinto, aunque se hayan declarado
	en el esquema como identificadores (con una l&iacute;nea del tipo
	<code>&lt;xs:attribute name="otronombre" type="xs:ID"/&gt;</code>), para evitar
	conflictos con el esquema de XAdES y XMLDSig.
   </dd>
  <dt><b><i>uri</i></b> (no aplica a contrafirmas)</dt>
   <dd>URL en la que se encuentra el documento a firmar, necesario en el caso del formato <i>XAdES Externally Detached</i>.</dd>
  <dt><b><i>format</i></b></dt>
   <dd>
    Formato de firma. Se aceptan los siguientes valores:<br>
    <ul>
     <li>
      <i>XAdES Detached</i> (<code>AOSignConstants.SIGN_FORMAT_XADES_DETACHED</code>)
     </li>
     <li>
      <i>XAdES Externally Detached</i> (<code>AOSignConstants.SIGN_FORMAT_XADES_EXTERNALLY_DETACHED</code>)
      <p>
       Para el uso del formato <i>XAdES Externally Detached</i> es necesario establecer
       tambi&eacute;n el par&aacute;metro <code>uri</code> con una direcci&oacute;n
       accesible universalmente.
      </p>
     </li>
     <li>
      <i>XAdES Enveloped</i> (<code>AOSignConstants.SIGN_FORMAT_XADES_ENVELOPED</code>)
     </li>
     <li>
      <i>XAdES Enveloping</i> (<code>AOSignConstants.SIGN_FORMAT_XADES_ENVELOPING</code>)
     </li>
    </ul>
   </dd>
  <dt><b><i>policyIdentifier</i></b> (propiedad compartida con CAdES y PAdES)</dt>
   <dd>Identificador de la pol&iacute;tica de firma (normalmente una URL hacia la pol&iacute;tica en formato XML procesable o una URN de tipo OID).</dd>
  <dt><b><i>policyIdentifierHash</i></b> (propiedad compartida con CAdES y PAdES)</dt>
   <dd>
    Huella digital del documento de pol&iacute;tica de firma (normalmente del mismo fichero en formato XML procesable).
    Si no se indica, es obligatorio que el par&aacute;metro <code>policyIdentifier</code> sea una URL accesible universalmente.
   </dd>
  <dt><b><i>policyIdentifierHashAlgorithm</i></b> (propiedad compartida con CAdES y PAdES)</dt>
   <dd>Algoritmo usado para el c&aacute;lculo de la huella digital indicada en el par&aacute;metro <code>policyIdentifierHash</code>.
  <dt><b><i>policyDescription</i></b></dt>
   <dd>Descripci&oacute;n textual de la pol&iacute;tica</dd>
  <dt><b><i>policyQualifier</i></b> (propiedad compartida con CAdES y PAdES)</dt>
   <dd>URL hacia el documento (legible por personas, normalmente en formato PDF) descriptivo de la pol&iacute;tica de firma.</dd>
  <dt><b><i>includeOnlySignningCertificate</i></b> (propiedad compartida con CAdES y PAdES)</dt>
   <dd>
    Indica, mediante un <code>true</code> o <code>false</code>, que debe
    incluirse en la firma &uacute;nicamente el certificado utilizado
	para firmar y no su cadena de certificaci&oacute;n completa.
	Por defecto, se incluir&aacute; toda la cadena de certificaci&oacute;n.
   </dd>
  <dt><b><i>facturaeSign</i></b></dt>
   <dd>
    Indica, mediante un <code>true</code> o <code>false</code>, si se
	deben realizar las necesarias restricciones de comportamiento
	para la firma de facturas electr&oacute;nicas (FACTURAe).
	Estas restricciones son, no introducir la
	transformaci&oacute;n de canonicalizaci&oacute;n de la firma,
	ni la transformaci&oacute;n XPATH en las firmas Enveloped.
   </dd>
  <dt><b><i>signerClaimedRoles</i></b></dt>
   <dd>
    Lista de cargos atribuidos al firmante separados por el car&aacute;cter '<i>|</i>'.<br>
    Los cargos de la lista no pueden contener el car&aacute;cter '<i>|</i>' (ya que este se usa como separador).
   </dd>
  <dt><b><i>precalculatedHashAlgorithm</i></b></dt>
   <dd>
    Algoritmo utilizado para el c&aacute;lculo de la huella digital cuando se proporciona esta en vez de los
    datos a firmar. Cuando se proporcione una huella en vez de datos deben tenerse en cuenta los siguientes aspectos:
    <ul>
     <li>
      La huella digital debe indicarse en lugar de los datos, en el mismo par&aacute;metro del m&eacute;todo de firma.
     </li>
     <li>
      <b>Solo puede indicarse una huella cuando no se incluyan los datos dentro de la propia firma, es decir, en firmas
      <i>Externally Detached</i>, siendo conveniente adem&aacute;s hacer uso de un <i>Manifest</i>.</b>
     </li>
    </ul>
   </dd>
  <dt><b><i>signatureProductionCity</i></b> (propiedad compartida con PAdES y CAdES)</dt>
   <dd>Ciudad en la que se realiza la firma.</dd>
  <dt><b><i>signatureProductionProvince</i></b></dt>
   <dd>Provincia en la que se realiza la firma.</dd>
  <dt><b><i>signatureProductionPostalCode</i></b> (propiedad compartida con CAdES)</dt>
   <dd>C&oacute;digo postal en el que se realiza la firma.</dd>
  <dt><b><i>signatureProductionCountry</i></b> (propiedad compartida con CAdES)</dt>
   <dd>Pa&iacute;s en el que se realiza la firma.</dd>
  <dt><b><i>commitmentTypeIndications</i></b> (propiedad compartida con CAdES)</dt>
   <dd>
    N&uacute;mero de <i>CommitmentTypeIndications</i> a a&ntilde;adir a la firma XAdES.<br>
    En los par&aacute;metros siguientes, los <i>CommitmentTypeIndications</i> se numeran a partir de 0 (cero).
   </dd>
  <dt><b><i>commitmentTypeIndication</i>n<i>Identifier</i></b> (propiedad compartida con CAdES)</dt>  
    <dd>
    Tipo de <i>CommitmentTypeIndication</i> (atributo obligatorio, se debe usar el ordinal, nunca el OID directamente):
    <ul>
     <li><i>1</i> = Prueba de origen</li>
     <li><i>2</i> = Prueba de recepci&oacute;n</li>
     <li><i>3</i> = Prueba de entrega</li>
     <li><i>4</i> = Prueba de env&iacute;o</li>
     <li><i>5</i> = Prueba de aprobaci&oacute;n</li>
     <li><i>6</i> = Prueba de creaci&oacute;n</li>
    </ul> 
   </dd>
  <dt><b><i>commitmentTypeIndication</i>n<i>Description</i></b></dt>
   <dd>
    Descripci&oacute;n textual del <i>CommitmentTypeIndication</i> n&uacute;mero <i>n</i> (atributo opcional). 
   </dd>
  <dt><b><i>commitmentTypeIndication</i>n<i>DocumentationReferences</i></b></dt>
   <dd>
    Lista de URL separadas por el car&aacute;cter '<i>|</i>' que se aportan como referencias documentales del 
    <i>CommitmentTypeIndication</i> n&uacute;mero <i>n</i> (atributo opcional).<br>
    Las URL de la lista no pueden contener el car&aacute;cter '<i>|</i>' (ya que este se usa como separador). 
   </dd>
  <dt><b><i>commitmentTypeIndication</i>n<i>CommitmentTypeQualifiers</i></b></dt>
   <dd>
    Lista de indicadores textuales separados por el car&aacute;cter '<i>|</i>' que se aportan como calificadores adicionales del 
    <i>CommitmentTypeIndication</i> n&uacute;mero <i>n</i> (atributo opcional). Normalmente son OID.<br>
    Los elementos de la lista no pueden contener el car&aacute;cter '<i>|</i>' (ya que este se usa como separador). 
   </dd>
  <dt><b><i>xmlTransforms</i></b></dt>
   <dd>
    N&uacute;mero de transformaciones a aplicar al XML antes de firmarlo.<br>
    En los par&aacute;metros siguientes, las transformaciones se numeran a partir de 0 (cero).
   </dd>
  <dt><b><i>xmlTransform</i>n<i>Type</i></b></dt>
   <dd>Tipo de la transformaci&oacute;n <i>n</i> (debe ser la URL del algoritmo seg&uacute;n define W3C).</dd>
  <dt><b><i>xmlTransform</i>n<i>Subtype</i></b></dt>
   <dd>Subtipo de la transformaci&oacute;n <i>n</i> (por ejemplo, "intersect", "subtract" o "union" para XPATH2).</dd>
  <dt><b><i>xmlTransform</i>n<i>Body</i></b></dt>
   <dd>
    Cuerpo de la transformaci&oacute;n <i>n</i>.
    Los valores aceptados y sus funcionalidades dependen de los valores indicados en <code>xmlTransform<i>n</i>Type</code>
    y en <code>xmlTransform<i>n</i>Subtype</code>.
   </dd>
  <dt><b><i>referencesDigestMethod</i></b></dt>
   <dd>
    Algoritmo de huella digital a usar en las referencias XML (referencesDigestMethod). Debe indicarse como una URL,
    acept&aacute;ndose los siguientes valores:
    <ul>
     <li><i>http://www.w3.org/2000/09/xmldsig#sha1</i> (SHA-1)</li>
     <li><i>http://www.w3.org/2001/04/xmlenc#sha256</i> (SHA-256, valor recomendado)</li>
     <li><i>http://www.w3.org/2001/04/xmlenc#sha512</i> (SHA-512)</li>
    </ul>
   </dd>
  <dt><b><i>mimeType</i></b> (no aplica a contrafirmas)</dt>
   <dd>
    MIME-Type de los datos a firmar. Si no se indica se realiza una auto-detecci&oacute;n cuyo resultado puede
    ser inexacto.
   </dd>
  <dt><b><i>outputXmlEncoding</i></b></dt>
   <dd>
    Codificaci&oacute;n del XML de salida.<br>
    Si no se indica este valor se intenta auto-detectar a partir del XML de entrada (si los datos a firmar son un XML).
   </dd>
  <dt><b><i>encoding</i></b></dt>
   <dd>
    <p>
     Codificaci&oacute;n de los datos a firmar (ver la <a href="https://www.w3.org/TR/xmldsig-core1/#sec-Object">
     documentaci&oacute;n del elemento <i>Object</i> de XMLDSig</a> para m&aacute;s informaci&oacute;n).<br>
     No confundir con la codificaci&oacute;n del XML, son valores independientes.
    </p>
    <p>
     Por restricci&oacute;n de esquema de XMLDsig debe ser una URI:
    </p>
    <pre>
         &lt;element name="Object" type="ds:ObjectType"/&gt;
         &lt;complexType name="ObjectType" mixed="true"&gt;
           &lt;sequence minOccurs="0" maxOccurs="unbounded"&gt;
             &lt;any namespace="##any" processContents="lax"/&gt;
           &lt;/sequence&gt;
           &lt;attribute name="Id" type="ID" use="optional"/&gt;
           &lt;attribute name="MimeType" type="string" use="optional"/&gt;
           &lt;attribute name="Encoding" type="anyURI" use="optional"/&gt;
         &lt;/complexType&gt;
    </pre>
    <p>
     Si se proporcionan datos a firmar previamente codificados en Base64 pero se desea sean considerados como
     su forma descodificada, debe establecerse este valor a <code>http://www.w3.org/2000/09/xmldsig#base64</code>
     y especificarse el tipo real en el par&aacute;metro <code>mimeType</code>.<br>
     Por ejemplo, para firmar una imagen PNG haciendo que la firma se refiera a su forma binaria directa, puede
     proporcionarse la imagen directamente codificada en Base64 indicando el <code>encoding</code> como
     <code>http://www.w3.org/2000/09/xmldsig#base64</code> y el <code>mimeType</code> como <code>image/png</code>.
    </p>
   </dd>
  <dt><b><i>contentTypeOid</i></b> (no aplica a contrafirmas)<dt>
   <dd>OID que identifica el tipo de datos a firmar.</dd>
  <dt><b><i>canonicalizationAlgorithm</i></b></dt>
   <dd>Algoritmo de canonicalizaci&oacute;n.</dd>
  <dt><b><i>xadesNamespace</i></b></dt>
   <dd>
    URL de definici&oacute;n del espacio de nombres de XAdES (y por extensi&oacute;n, versi&oacute;n de XAdES).
    Si se establece este par&aacute;metro es posible que se necesite establecer tambi&eacute;n el par&aacute;metro
    <code>signedPropertiesTypeUrl</code> para evitar incoherencias en la versi&oacute;n de XAdES.
   </dd>
  <dt><b><i>signedPropertiesTypeUrl</i></b></dt>
   <dd>
    URL de definici&oacute;n del tipo de las propiedades firmadas (<i>Signed Properties</i>) de XAdES.
    Si se establece este par&aacute;metro es posible que se necesite establecer tambi&eacute;n el par&aacute;metro
    <code>xadesNamespace</code> para evitar incoherencias en la versi&oacute;n de XAdES.<br>
    Si no se establece se usa el valor por defecto: <a href="http://uri.etsi.org/01903#SignedProperties">http://uri.etsi.org/01903#SignedProperties</a>.
   </dd>
  <dt><b><i>ignoreStyleSheets</i></b> (no aplica a contrafirmas)</dt>
   <dd>
    Ignora las hojas de estilo externas de los XML (no las firma) si se establece a <code>true</code>,
    si se establece a <code>false</code> act&uacute;a normalmente (s&iacute; las firma).
   </dd>
  <dt><b><i>avoidBase64Transforms</i></b> (no aplica a contrafirmas)</dt>
   <dd>
    No declara transformaciones Base64 incluso si son necesarias si se establece a <code>true</code>,
    si se establece a <code>false</code> act&uacute;a normalmente (s&iacute; las declara).
   </dd>
  <dt><b><i>headLess</i></b></dt>
   <dd>
    Evita cualquier interacci&oacute;n con el usuario si se establece a <code>true</code>,
    si se establece a <code>false</code> act&uacute;a normalmente (puede mostrar di&aacute;logos,
    por ejemplo, para la dereferenciaci&oacute;n de hojas de estilo enlazadas con rutas relativas).
    &Uacute;til para los procesos desatendidos y por lotes.
   </dd>
 </dl>
 <p>
  Respecto al uso de los par&aacute;metros <code>xmlTransform</code>n<code>Type</code>,
  <code>xmlTransform</code>n<code>Subtype</code> y <code>xmlTransform</code>n<code>Body</code>,
  sus valores van ligados, acept&aacute;ndose las siguientes combinaciones:
 </p>
 <p>
  Transformaci&oacute;n <b>XPATH</b><br>
  &nbsp;&nbsp;-<b>Tipo</b>: <code>http://www.w3.org/TR/1999/REC-xpath-19991116</code><br>
  &nbsp;&nbsp;-<b>Subtipos</b>: No tiene subtipos.<br>
  &nbsp;&nbsp;-<b>Cuerpo</b>: Especificado mediante sentencias de tipo XPATH.<br>
  <br>Transformaci&oacute;n <b>XPATH2</b><br>
  &nbsp;&nbsp;-<b>Tipo</b>: <code>http://www.w3.org/2002/06/xmldsig-filter2</code><br>
  &nbsp;&nbsp;-<b>Subtipos</b>:<br>
  &nbsp;&nbsp;&nbsp;&nbsp;<b><i>subtract</i></b>: Resta.<br>
  &nbsp;&nbsp;&nbsp;&nbsp;<b><i>intersect</i></b>: Intersecci&oacute;n<br>
  &nbsp;&nbsp;&nbsp;&nbsp;<b><i>union</i></b>: Uni&oacute;n<br>
  &nbsp;&nbsp;-<b>Cuerpo</b>: Especificado mediante sentencias de tipo XPATH2.<br>
  <br>Transformaci&oacute;n <b>BASE64</b>. 
  La transformaci&oacute;n es inversa, es decir, los datos se descodifican desde Base64 antes de firmarse, 
  por lo que estos deben estar previamente codificados en Base64 e indicarse mediante el par&aacute;metro
  adicional <code>encodign=base64</code><br>
  &nbsp;&nbsp;-<b>Tipo</b>: <code>http://www.w3.org/2000/09/xmldsig#base64</code><br>
  &nbsp;&nbsp;-<b>Subtipos</b>: No tiene subtipos.<br>
  &nbsp;&nbsp;-<b>Cuerpo</b>: No tiene cuerpo.
 </p>
 <p>
  No es posible especificar transformaciones complejas que incluyan varias sentencias.
  En su lugar, puede declararse una sucesi&oacute;n de transformaciones simples que produzcan el
  mismo resultado. Cada una de las transformaciones se aplicar&aacute; de forma ordenada sobre el
  resultado de la anterior.
 </p>
 </body>
</html>